{
    "ransom_notes/BadBlock_Help Decrypt.html": "BadBlock is on the block! This machine was infected with ransomware BadBlock. Many of your files are\nencrypted using RSA algorithm, and the key to decrypt this files is with us on\nour server. What this means? It means that to decrypt and recover your files, you will need to pay a\nransom, in bitcoins. The actual ransom for your machine is 2 bitcoins USD\n900.00. If you are not interested in pay this ransom, you can easily format this\nmachine, or even remove BadBlock it's not that hard, but all your files will\nbecome unrecoverable! How do I pay? You simply buy bitcoins, and transfer them to this account:\n The amount is 2 bitcoins, like we talked earlier... You can use this link or\nthis link to help you out on how to buy the bitcoins. What happens after the payment? BadBlock still running on your computer right now, and waiting to detect one\npayment of 2 BTC on the address mentioned above. Once it detects, it will\nstart to decrypt all the encrypted files. The process to detect the payment\ncan take up to 2 hours, and only after this it will start decrypting your\nfiles. So after payment, leave this machine powered. For this reason, we strongly recommend you to not try to remove BadBlock, and\ndisable your antivirus for a while, until you pay and the payment gets\nprocessed, to BadBlock start decrypting. If your antivirus gets updated and\nremove BadBlock automatically, even if you pay the ransom, it will not be able\nto recover your files! How do I know that you will really decrypt my files after payment? You don't. You have only one choice to recover your files: pay the ransom. We\nhave no interest in keeping your files locked for any reason. So right now,\njust rely on us and everything will be fine.",
    "ransom_notes/Dharma_bkp_Info.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email bkp@cock.li Write this ID in the title of your message 3AF0FA8F In case of no answer in 24 hours write us to theese emails:bkp@cock.li You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 file for free decryption. The total size\nof files must be less than 1Mb non archived, and files should not contain\nvaluable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Gpgqwerty_README_DECRYPT.txt": "Your computer is encrypted. All data will be lost if you do not pay 0.1 BTC to the specified BTC wallet  after payment you will receive the decryption code from this mail cryz1@protonmail.com, send your ID 3782. Before paing you can send to us up to 1 files for free decryption. Please note: that files must NOT contain valuable information and their total size must be less than 1Mb",
    "ransom_notes/Cerber_2017-01-05__[]_README_.hta": "Can't you find the necessary files? Is the content of your files not readable? It is normal because the files' names and the data in your files have been\nencrypted by Cerber Ransomware. It means your files are NOT damaged! Your files are modified only. This\nmodification is reversible. From now it is not possible to use your files until they will be decrypted. The only way to decrypt your files safely is to buy the special decryption\nsoftware Cerber Decryptor. Any attempts to restore your files with the thirdparty software will be fatal\nfor your files! You can proceed with purchasing of the decryption software at your personal\npage: Please wait...http: p27dokhpz2n7nvgr.onion.to  If this page cannot be opened click here to get a new address of your\npersonal page. If the address of your personal page is the same as before after you tried to\nget a new one, you can try to get a new address in one hour. At this page you will receive the complete instructions how to buy the\ndecryption software for restoring all your files. Also at this page you will be able to restore any one file for free to be sure\nCerber Decryptor will help you. If your personal page is not available for a long period there is another way\nto open your personal page installation and use of Tor Browser: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: p27dokhpz2n7nvgr.onion  in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or use of Tor Browser, please,\nvisit https: www.youtube.com and type request in the search bar Install Tor\nBrowser Windows and you will find a lot of training videos about Tor Browser\ninstallation and use. Additional information: You will find the instructions README.hta for restoring your files in\nany folder with your encrypted files. The instructions README.hta in the folders with your encrypted files are\nnot viruses! The instructions README.hta will help you to decrypt your\nfiles. Remember! The worst situation already happened and now the future of your\nfiles depends on your determination and speed of your actions.",
    "ransom_notes/Chip_CHIP_FILES.txt": "YOUR ID: Hello! All Your files are encrypted! For more specific instructions, please visit a support home page: http: mm6x57ri2coivya6.onion To see this page follow these steps: 1 Download and install torbrowser: http: www.torproject.org projects torbrowser.html.en 2 After a successful installation, run the browser 3 Type in the address bar http: mm6x57ri2coivya6.onion\n4 Follow the instructions on the site Attention: DO NOT USE ANY PUBLIC DECRYPTERS! YOU CAN DAMAGE YOUR FILES! Kind regards, Support Team. YOUR ID: YOUR ID: YOUR ID: YOUR ID: YOUR ID:",
    "ransom_notes/ransomwhere_notes_1626277588706Screenshot 2021-07-14 at 17.45.34.txt": "Locked by Ranzy Locker\nYour files and servers encrypted. What's happened? All files on each host in your network encrypted with strongest encryption algorithms. Back\nfollow our instruction and remember you don't have so much time. How to decrypt my files? For decryption files you need buy decryption key and Universal Decryption Tool.\nThe only one way for return your files back is cooperate with us and get decryption key. Write to live chat, if you want to buy decryptor You also can decrypt 3 files for FREE as guarantees tell about it in live chat. O Live chat 23 Feb, 13:08 Buy bitcoins here: https: howtobuybitcoins.info 23 Feb, 13:21\nSend to our wallet:\n17PPclsY  G7Twul\n23 Feb, 13:21\nThanks\n23 Feb, 13:52 Man is your bitcoin address correct? I am getting\nerror while doing payment on your given address?\n23 Feb, 13:52",
    "ransom_notes/CryptoWire_DesktopReadme_README.txt": "If you are seeing this message your files are already encrypted. VERY IMPORTANT READ CAREFULLY Any interruption to the program you launched may result in permanent loss of all your files. In 510 minutes a window should open offering you to restore your computer files.\nIf you do not see this window, you will need to rerun the program, disable antivirus, or restart the computer. Failure to see the decryption window and failure to follow the instructions\nWill cause all the files to be permanetly deleted and any personal information collected will be published on dark markets.\nYou have 48 hours from the creation of this TXT file. Can't get decryption window or for serious questions email BellevueInject@openmailbox.org\nMoralizing, preaching, or any non mission critical emails will result in deletion of your files.",
    "ransom_notes/Alpha Crypt_2015-05-06_HELP_TO_SAVE_FILES.txt": "All your documents, photos, databases and other important files have been encrypted\nwith strongest encryption RSA2048 key, generated for this computer. Private decryption key is stored on a secret Internet server and nobody can\ndecrypt your files until you pay and obtain the private key. If you see the main encryptor red window, examine it and follow the instructions.\nOtherwise, it seems that you or your antivirus deleted the encryptor program.\nNow you have the last chance to decrypt your files.\nOpen in your browser one of the links:\nhttp: is6xsotjdy4qtgur.afnwdsy4j32.com http: is6xsotjdy4qtgur.9isernvur33.com https: is6xsotjdy4qtgur.tor2web.blutmagie.de They are public gates to the secret server.\nCopy and paste the following Bitcoin address in the input form on server. Avoid missprints.\n\nFollow the instructions on the server. If you have problems with gates, use direct connection:\n1. Download Tor Browser from http: torproject.org\n2. In the Tor Browser open the http: is6xsotjdy4qtgur.onion Note that this server is available via Tor Browser only. Retry in 1 hour if site is not reachable.\nCopy and paste the following Bitcoin address in the input form on server. Avoid missprints.\n\nFollow the instructions on the server.",
    "ransom_notes/JAFF_2017-05-24_README TO SAVE YOUR FILES.html": "JAFF DECRYPTOR Your files are encrypted! To decrypt flies you need to obtain the private key. The only copy of the private key, which will allow you to decrypt your files,\nis located on a secret server in the Internet. 1. You must install Tor Browser: https: www.torproject.org download downloadeasy.html.en 2 . After instalation, run the Tor Browser and enter address: http: rktazuzi7hbln7sy.onion Follow the instruction on the website. Your decrypt ID: 0123456789",
    "ransom_notes/TeslaCrypt_Unknown_Unkn1_[].txt": "!@!@!!@!@!!@!@!!@!@!!@!@!!@!@!!@!@!!@!@!!@!@!!@!@! NOT YOUR LANGUAGE? USE https: translate.google.com What happened to your files ?\nAll of your files were protected by a strong encryption with RSA4096.\nMore information about the encryption keys using RSA4096 can be found here: http: en.wikipedia.org wiki RSAcryptosystem How did this happen ?\n!!! Specially for your PC was generated personal RSA4096 KEY, both public and private.\n!!! ALL YOUR FILES were encrypted with the public key, which has been transferred to your computer via the Internet.\nDecrypting of your files is only possible with the help of the private key and decrypt program, which is on our secret server. What do I do ?\nSo, there are two ways you can choose: wait for a miracle and get your price doubled, or start obtaining BITCOIN NOW! , and restore your data easy way.\nIf You have really valuable data, you better not waste your time, because there is no other way to get your files, except make a payment. For more specific instructions, please visit your personal home page, there are a few different addresses pointing to your page below:\n1. http: pot98bza3sgfjr35t.fausttime.com removed\n2. http: h5534bvnrnkj345.maniupulp.com removed\n3. http: .orbyscabz.com removed\nIf for some reasons the addresses are not available, follow these steps:\n1. Download and install torbrowser: http: www.torproject.org projects torbrowser.html.en 2. After a successful installation, run the browser and wait for initialization.\n3. Type in the address bar: wbozgklno6x2vfrk.onion removed 4. Follow the instructions on the site. !!! IMPORTANT INFORMATION:\n!!! Your personal pages:\nhttp: pot98bza3sgfjr35t.fausttime.com removed\nhttp: h5534bvnrnkj345.maniupulp.com removed\nhttp: .orbyscabz.com removed !!! Your personal page TorBrowser: wbozgklno6x2vfrk.onion removed !!! Your personal identification ID: removed",
    "ransom_notes/CrypMIC_README.txt": "NOT YOUR LANGUAGE? USE https: translate.google.com What happened to your files ?\nAll of your files were protected by a strong encryption with RSA4096\nMore information about the encryption keys using RSA4096 can be found here: http: en.wikipedia.org wiki RSAcryptosystem How did this happen ?\n!!! Specially for your PC was generated personal RSA4096 Key , both public and private.\n!!! ALL YOUR FILES were encrypted with the public key, which has been transferred to your computer via the Internet.\n!!! Decrypting of your files is only possible with the help of the private key and decrypt program , which is on our Secret Server What do I do ?\nSo , there are two ways you can choose: wait for a miracle and get your PRICE DOUBLED! Or start obtaining BITCOIN NOW! , and restore YOUR DATA easy way\nIf You have really valuable DATA, you better NOT WASTE YOUR TIME, because there is NO other way to get your files, except make a PAYMENT Your personal ID: removed For more specific instructions, please visit your personal home page, there are a few different addresses pointing to your page below: 1 http: ccjlwb22w6c22p2k.onion.to\n2 http: ccjlwb22w6c22p2k.onion.city If for some reasons the addresses are not availablweropie, follow these steps: 1 Download and install torbrowser: http: www.torproject.org projects torbrowser.html.en\n2 Video instruction: https: www.youtube.com watch?vNQrUZdsw2hA\n3 After a successful installation, run the browser\n4 Type in the address bar: http: ccjlwb22w6c22p2k.onion\n5 Follow the instructions on the site",
    "ransom_notes/Hc7_Planetary_RECOVER.txt": "ALL FILES ARE ENCRYPTED. TO RESTORE, YOU MUST SEND 700 EQUIVALENT FOR ONE COMPUTER\nOR 5,000 FOR ALL NETWORK\nPAYMENTS ACCEPTED VIA BITCOIN, MONERO AND ETHEREUM\nBTC ADDRESS: bitcoinaddress\nMONERO XMR ADDRESS: moneroaddress\nCONTACT US WHEN ETHEREUM PAYMENT INFORMATION\nBEFORE PAYMENT SENT EMAIL m4rk0v@tutanota.de\nALONG WITH YOUR IDENTITY: \nINCLUDE SAMPLE ENCRYPTED FILE FOR PROOF OF DECRYPT NOT TO SHUT OFF YOUR COMPUTER, UNLESS IT WILL BREAK",
    "ransom_notes/Locky_remark.txt": "The two ransom notes of ykcol version were from two different samples",
    "ransom_notes/CryptoBit_helloreadmenow23.txt": "ID:12345678 PC:removed USER:removed IF YOU WANT TO GET ALL YOUR FILES BACK, PLEASE EMAIL ME AT: epiclesis@protonmail.ch kyklos@scryptmail.com malakia@openmailbox.org Send an email to all od these addresses, just in case, sometimes emails get lost. Don't forget to check your spam junk folder later, most likely my reply will end up there. If you want to remain anonymous or if you aren't getting a reply, please try using bitmessage bitmessage.org and use this address to contact me: BMNAxZ29ouecw2Y7ibaXKus1vxDRDfheW6. This method will work 100. Encrypted files LOG: C: Users removed Documents 12345678.log",
    "ransom_notes/GandCrab_GandCrabV2_v2.2r_[]-DECRYPT.txt": "GANDCRAB Attention! All your files documents, photos, databases and other important files are encrypted and have the extension: .GDCB The only method of recovering files is to purchase a private key. It is on our server and only we can recover your files. The server with your key is in a closed network TOR. You can get there by the following ways: 1. Download Tor browser https: www.torproject.org 2. Install Tor browser 3. Open Tor Browser 4. Open link in tor browser: http: gdcbghvjyqy7jclk.onion fe1bfd4c60d8c0e3 5. Follow the instructions on this page If Tor Tor browser is locked in your country or you can not install it, open one of the following links in your regular browser: 1. http: gdcbghvjyqy7jclk.onion.casa fe1bfd4c60d8c0e3 2. http: gdcbghvjyqy7jclk.onion.guide fe1bfd4c60d8c0e3 3. http: gdcbghvjyqy7jclk.onion.rip fe1bfd4c60d8c0e3 4. http: gdcbghvjyqy7jclk.onion.plus fe1bfd4c60d8c0e3 On our page you will see instructions on payment and get the opportunity to decrypt 1 file for free. If you have difficulties with TOR or you have any problems, please use this online messenger : https: bitmsg.me PC version https: bitmessage.org.\nIt is absolutely free and anonymous service. Register, generate address, and write to our address :  , in the subject please write your ID fe1bfd4c60d8c0e3 We will answer in a short time. DANGEROUS! Do not try to modify files or use your own private key this will result in the loss of your data forever!",
    "ransom_notes/Hc7_Gotya_RECOVERY.txt": "ALL YOUR FILES WERE ENCRYPTED. TO RESTORE THIS FILE, YOU MUST SEND 700 BTC for MASCHINE\nOR 5,000 BTC FOR ALL NETWORK\nADDRESS: \nAFTER PAYMENT SENT EMAIL m4zn0v@keemail.me\nALONG WITH YOUR IDENTITY: VVNFUi1QQzA5\nNOT TO TURN OFF YOUR COMPUTER, UNLESS IT WILL BREAK",
    "ransom_notes/GandCrab_GandCrabV5_5.0.4_[]-DECRYPT.txt": "GANDCRAB V5.0.4 UNDER NO CIRCUMSTANCES DO NOT DELETE THIS FILE, UNTIL ALL YOUR DATA IS RECOVERED FAILING TO DO SO, WILL RESULT IN YOUR SYSTEM CORRUPTION, IF THERE ARE DECRYPTION ERRORS Attention! All your files, documents, photos, databases and other important files are encrypted and have the extension: .IBKFZ The only method of recovering files is to purchase an unique private key. Only we can give you this key and only we can recover your files. The server with your key is in a closed network TOR. You can get there by the following ways: 0. Download Tor browser https: www.torproject.org 1. Install Tor browser 2. Open Tor Browser 3. Open link in TOR browser: http: gandcrabmfe6mnef.onion 3945f9752ef4eee 4. Follow the instructions on this page On our page you will see instructions on payment and get the opportunity to decrypt 1 file for free. ATTENTION! IN ORDER TO PREVENT DATA DAMAGE: DO NOT MODIFY ENCRYPTED FILES DO NOT CHANGE DATA BELOW BEGIN GANDCRAB KEY  YogBoGw8jeYHvikenInCmO9iP2sdg748In3g  0gc0CcltydL0MTtlm1XJC9x     fyPmJMbg   OYX1 N1a9QOty8ZCJR2A3J6Brl2pCMjlzobx2zUrU G9eT5ss2otiiEcvFnjQ5ZBchzEoe0m8 5GvqMTQVl1KFUBACT sUsCj3Gutz  7203FPhXu7KtOuS8L  OA8zE  iIQreBAtdsSqJ8dnw05i9k 9wN6NCxi6QQV mvuISAQLXLO1GlS0Kd1cuwoFDrj   f3O 0sFl1EiQ0HfY4mZJNNPvG5fn17y     J1sYpRiXrPCRW7YYJGWcytykUU2x3tMew1 NFZnmW4J56HesZMxzFn  72MWWxeqTS3EHGIjvfknwp7aZIh  END GANDCRAB KEY BEGIN PC DATA wfKD6iudumBkmpL8IRr4U4ixFFarOW  FDv  MKkPwIpOLB6TXJwcmuEoTHZ5P74  vkeQtJtiCqcanpLql55i6rF2kU3BtuKt   9MXYBh8gz4xIRfhtVv   DmlIRsTYBIC4rwJZhcyrcs END PC DATA",
    "ransom_notes/ransomwhere_notes_1627023283160t0ik979l-readme.txt": "Welcome. Again. Whats Happen? Your files are encrypted, and currently unavailable. You can check it: all files on your system has extension t0ik979l. By the way, everything is possible to recover restore, but you need to follow our instructions. Otherwise, you cant return your data NEVER. What guarantees? Its just a business. We absolutely do not care about you and your deals, except getting benefits. If we do not do our work and liabilities nobody will not cooperate with us. Its not in our interests. To check the ability of returning files, You should go to our website. There you can decrypt one file for free. That is our guarantee. If you will not cooperate with our service for us, its does not matter. But you will lose your time and data, cause just we have the private key. In practise time is much more valuable than money. How to get access on website? You have two ways: 1 Recommended Using a TOR browser! a Download and install TOR browser from this site: https: torproject.org b Open our website: http: .onion 091E8DFC088B8CE5 2 If TOR blocked in your country, try to use VPN! But you can use our secondary website. For this: a Open your any browser Chrome, Firefox, Opera, IE, Edge b Open our secondary website: http: decoder.re 091E8DFC088B8CE5 Warning: secondary website can be blocked, thats why first variant much better and more available. When you open our website, put the following data in the input form: Key:  xuoEM0r   E  LStM  q4FN2ZpWHVd82zo6B    Ry4h  m1gy 1DW1HscZVXv  4VIkgUPiC7  ZzFsHk3Z6        ezSD7IHdc  3EmV T    vwN B8gBqmRVL2i   joEh37fySUDXO7xB   WC 28NmgkeQ08rhg    H   HK KsFgXpoi9bRMX    cvxIKE62GJrHnnp  mut2xzaqjIG    ax9rvR yp0Ahe3E74 YzGt1vdMyr   UstBa0NVFXWvZcROCRk NFnVRynhLqGiem6we  QZJUmeC   jFbIeyqAr Ewr5XmJ0   EiU  JKyNIARaXoCkX1rH rceUzqiR0YjMNe03T   QCqqEHD0ZCsOP2jWsz KeNDZy   lcYZLQESeJxyXb0v7   FccGqV5wP1r  Xw !!! DANGER !!! DONT try to change files by yourself, DONT use any third party software for restoring your data or antivirus solutions its may entail damge of the private key and, as result, The Loss all data. !!! !!! !!! ONE MORE TIME: Its in your interests to get your files back. From our side, we the best specialists make everything for restoring, but please should not interfere. !!! !!! !!!",
    "ransom_notes/ransomwhere_notes_1636545539946222222222222.txt": "MY DECRYPTOR Tinerypl 1 lile for 1111 Your documents, photos, databases and other important files have been encrypted! WARNING! Any attempts to restore your files with the thirdparty software will be fatal for your files! WARNING! To decrypt your files you need to buy the special software My Decryptor All transactions should be performed via network. Within 5 days you can purchase this product at a special price: BTC 0.04 2664 After 5 days the price of this product will increase up to: BTC 0.0800 5327 The special price is available: 04 . 23:59:22",
    "ransom_notes/TeslaCrypt_2016-02-12_RECOVER+[].htm": "NOT YOUR LANGUAGE? USEGoogle Translate What happened to your files? All of your files were protected by a strong encryption with RSA More information about the encryption RSA can be found here:\nhttps: en.wikipedia.org wiki RSAcryptosystem Wh at does this mean? This means that the structure and data within your files have been\nirrevocably changed, you will not be able work with them, read them or see\nthem, it is the same thing as losing them forever, but with our help, you can\nrestore them. Ho w did this happen? Especially for you, on our SERVER was generated the secret keypair RSA public and private. All your files were encrypted with the public key, which has been\ntransferred to your computer via the Internet. Decrypting of YOUR FILES is only possible with the help of the private key and\ndecrypt program which is on our Secret Server!!! Wh at do I do? Alas, if you do not take the necessary measures for the specified time then\nthe conditions for obtaining the private key will be changed If you really need your data, then we suggest you do not waste valuable\ntime searching for other solutions becausen they do not exist. For more specific instructions, please visit your personal home page, there\nare a few different addresses pointing to your page below: 1.http: .yamenswash.com removed 2.http: p4fhmjnsdfbm4w4fdsc.avowvoice.com removed 3.http: .replylaten.at removed If for some reasons the addresses are not available, follow these steps: 1 . Download and install torbrowser:\nhttp: www.torproject.org projects torbrowser.html.en 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the torbrowser address bar: fwgrhsao3aoml7ej.onion removed 4 . Follow the instructions on the site. !!! IMPO RTANT INFORMATION: Your Personal PAGES: http: .yamenswash.com removed http: p4fhmjnsdfbm4w4fdsc.avowvoice.com removed http: .replylaten.at removed Your Personal TORBrowser page : fwgrhsao3aoml7ej.onion removed Your personal ID if you open the site directly: removed",
    "ransom_notes/GlobeImposter_Unknown_test_Read___ME.html": "Your files are Encrypted! For data recovery needs decryptor. If you want to buy a decryptor click Buy Decryptor Buy Decryptor If not working, click again. Free decryption as guarantee. Before paying you can send us 1 file for free decryption. If you can not contact, follow these two steps: 1 . Install the TOP Browser from this link: torproject.org 2 . Open this link in the TOP browser:\nhttp: n224ezvhg4sgyamb.onion sup.php",
    "ransom_notes/Mmm_unknown_GET_YOUR_FILES_BACK.html": "NOT YOUR LANGUAGE? Use Google Translate What happened to your files? All of\nyour files were encrypted by a strong encryption with RSA2048 How did this\nhappen? Specially for your PC was generated personal RSA2048 Key, both public and private. ALL YOUR FILES were encrypted with the public key, which has been transferred to your PC via the Internet. Decrypting of your files is only possible with the help of the private key and decrypt program, which is on our Server What do I do? So,there are two ways you can choose: wait for a miracle and get\nyour price doubled, or start obtaining BITCOIN NOW and restore your data easy\nway. If you have really valuable data, your better not waste your time,\nbecause there is no other way to get your files, except payment. Your personal\nID: redacted Your personal wallet adress:\n Your price start from 0,45 BTC , after 10\ndays 5 8 2018 he is 0,9 BTC , after 15 day he is 2 BTC. 20 day and your\nsecret key has been deleted. Instruction: 1Buy Bitcoin on btc exchange sites\nPaxful.com, gemini.com, Coinbase,Localbitcoins, Coinmama and another.For buy\nBitcoin you need confirm your Identify. Or buy Bitcoin instantly in your City\nhttps: coinatmradar.com country 226  2send\nBitcoins to  3Write us to email\ntriplem@tuta.io 4After we confirm payment we send you decryption software\nand Private Key for decrypt your files.",
    "ransom_notes/Dr. Fucker_PLEASE_READ_FOR_DECRYPT_FILES_.html": "What happened to your files? All your files encrypted with RSA2048 encryption, For more information search in Google RSA Encryption How to recover files? RSA is a asymmetric cryptographic algorithm, You need one key for encryption and one key for decryption So you need Private key to recover your files. It's not possible to recover your files without private key How to get private key? You can get your private key in 3 easy step: Step1: You must send us 1.7 BitCoin for each affected PC OR 38 BitCoins to receive ALL Private Keys for ALL affected PC's. Step2: After you send us 1.7 BitCoin, Leave a comment on our Site with this detail: Just write Your Host name in your comment Your Host name is: SEAALTSRV1 Step3: We will reply to your comment with a decryption software, You should run it on your affected PC and all encrypted files will be recovered Our Site Address: http: 5hvtr4qvmq76zyfq.onion aya Our BitCoin Address:  If you send us 38 BitCoins For all PC's, Leave a comment on our site with this detail: Just write For All Affected PC's in your comment Also if you want pay for all affected PC's You can pay 19 Bitcoins to receive half of keysrandomly and after you verify it send 2nd half to receive all keys How To Access To Our Site For access to our site you must install Tor browser and enter our site URL in your tor browser. You can download tor browser from https: www.torproject.org download download.html.en For more information please search in Google How to access onion sites Test Decryption Check our site, You can upload 2 encrypted files and we will decrypt your files as demo. Where to buy Bitcoin We advice you to buy Bitcoin with Cash Deposit or WesternUnion From https: localbitcoins.com or https: coincafe.com buybitcoinswestern.php Because they don't need any verification and send your Bitcoin quickly. deadline You just have 7 days to send us the BitCoin after 7 days we will remove your private keys and it's impossible to recover your files",
    "ransom_notes/BTCWare_Payday_Payday.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email Checkzip@india.com You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 3 files for free decryption. The total\nsize of files must be less than 1Mb non archived, and files should not\ncontain valuable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Dharma_monro_FILES ENCRYPTED.txt": "all your data has been locked us You want to return? write email icrypt@cock.li",
    "ransom_notes/Lucky__How_To_Decrypt_My_File_.txt": "I am sorry to tell you.\nSome files has crypted\nif you want your files back , send 1 bitcoin to my wallet\nmy wallet address : \nIf you have any questions, please contact us. Email:nmare@cock.li",
    "ransom_notes/TeslaCrypt_2016-02-26_Recovery.html": "NOT YOUR LANGUAGE? USEGoogle Translate What happened to your files? All of your files were protected by a strong encryption with AES More information about the encryption AES can be found\nhttps: en.wikipedia.org wiki AES Wh at does this mean? This means that the structure and data within your files have been\nirrevocably changed, you will not be able work with them, read them or see\nthem, it is the same thing as losing them forever, but with our help, you can\nrestore them Ho w did this happen? Especially for you, on our SERVER was generated the secret key All your files were encrypted with the public key, which has been\ntransferred to your computer via the Internet. Decrypting of YOUR FILES is only possible with the help of the private key and\ndecrypt program which is on our Secret Server!!! Wh at do I do? Alas, if you do not take the necessary measures for the specified time then\nthe conditions for obtaining the private key will be changed If you really need your data, then we suggest you do not waste valuable\ntime searching for other solutions becausen they do not exist. For more specific instructions, please visit your personal home page, there\nare a few different addresses pointing to your page below: 1 http: .zatcurr.com removed 2 http: .keratadze.at removed 3 http: .milerteddy.com removed If for some reasons the addresses are not available, follow these steps: 1 Download and install torbrowser:\nhttp: www.torproject.org projects torbrowser.html.en 2 After a successful installation, run the browser and wait for\ninitialization. 3 Type in the torbrowser address bar: xlowfznrg4wf7dli.onion removed 4 Follow the instructions on the site. !!! IMPO RTANT INFORMATION: Your Personal PAGES : http: .zatcurr.com removed http: .keratadze.at removed http: .milerteddy.com removed Your Personal TORBrowser page : xlowfznrg4wf7dli.onion removed Your personal ID if you open the site directly: removed",
    "ransom_notes/Amnesia_[unknown].txt": ".. ...... YOUR FILES ARE ENCRYPTED! Your personal Indification key\n\n\n\n\n\n\n906224887828630363 Only option for decryption your files is get decryption software from us.\nWrite to 22222@protonmail.ch\nIn the mail attach your Indification key look in begin of this document. If you dont get answer in 2 hours or mail not working. Register on site http: bitmsg.me online message service to send Bitmessage Write on Bitmessage adress  with your email and Indification key. In answer you will get restoration cost and Bitcoin wallet adress You will need send demanded donation on given BTC wallet.\nYou may send few small files for test decryption before payment. Soon after your payment usualy 1030 min you will get decryption software and restore your files. If you dont have Bitcoins Create Bitcoin wallet: https: blockchain.info ru wallet new Buy Bitcoin: https: localbitcoins.com ru buybitcoins Visa MasterCard, QIWI Visa Wallet, etc. https: totalbitcoin.org  Important note! Contact us soon as you can so we can save your contacts our email can be blocked. Restore files without our help is useless If you dont have full backups of data. Decryption software unique generated for each client. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam. .. ......",
    "ransom_notes/Locky_asasin_asasin.htm": ". !!! IMPORTANT INFORMATION !!!! All of your files are encrypted with RSA2048 and AES128 ciphers. More information about the RSA and AES can be found here: http: en.wikipedia.org wiki RSAcryptosystem http: en.wikipedia.org wiki  Decrypting of your files is only possible with the private key and decrypt\nprogram, which is on our secret server. To receive your private key follow one of the links: If all of this addresses are not available, follow these steps: 1 . Download and install Tor Browser:\nhttps: www.torproject.org download downloadeasy.html 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the address bar: g46mbrrzpfszonuk.onion 0123456789ABCDEF 4 . Follow the instructions on the site. !!! Your personal identification ID: 0123456789ABCDEF !!! . . .. .",
    "ransom_notes/StopDjvu_dalle__readme.txt": "ATTENTION! Don't worry, you can return all your files!\nAll your files like photos, databases, documents and other important are encrypted with strongest encryption and unique key.\nThe only method of recovering files is to purchase decrypt tool and unique key for you.\nThis software will decrypt all your encrypted files.\nWhat guarantees you have?\nYou can send one of your encrypted file from your PC and we decrypt it for free.\nBut we can decrypt only 1 file for free. File must not contain valuable information.\nYou can get and look video overview decrypt tool:\nhttps: we.tl ti9Z5mq0D52\nPrice of private key and decrypt software is 980.\nDiscount 50 available if you contact us first 72 hours, that's price for you is 490.\nPlease note that you'll never restore your data without payment.\nCheck your email Spam or Junk folder if you don't get answer more than 6 hours. To get this software you need write on our email:\ngorentos@bitmessage.ch Reserve email address to contact us:\nferast@firemail.cc Our Telegram account:\n@datarestore Your personal ID:",
    "ransom_notes/Cerber_2017-03-15__READ_THIS_FILE_[]_.hta": "Can't you find the necessary files? Is the content of your files not readable? It is normal because the files' names and the data in your files have been\nencrypted by Cerber Ransomware. It means your files are NOT damaged! Your files are modified only. This\nmodification is reversible. From now it is not possible to use your files until they will be decrypted. The only way to decrypt your files safely is to buy the special decryption\nsoftware Cerber Decryptor. Any attempts to restore your files with the thirdparty software will be fatal\nfor your files! You can proceed with purchasing of the decryption software at your personal\npage: Please wait...http: p27dokhpz2n7nvgr.16bwhs.top  http: p27dokhpz2n7nvgr.1apkjn.top  http: p27dokhpz2n7nvgr.16qpet.top  http: p27dokhpz2n7nvgr.1jhnvt.top  http: p27dokhpz2n7nvgr.1dsdm4.top  If this page cannot be opened click here to get a new address of your\npersonal page. If the address of your personal page is the same as before after you tried to\nget a new one, you can try to get a new address in one hour. At this page you will receive the complete instructions how to buy the\ndecryption software for restoring all your files. Also at this page you will be able to restore any one file for free to be sure\nCerber Decryptor will help you. If your personal page is not available for a long period there is another way\nto open your personal page installation and use of Tor Browser: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: p27dokhpz2n7nvgr.onion  in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or use of Tor Browser, please,\nvisit https: www.youtube.com and type request in the search bar Install Tor\nBrowser Windows and you will find a lot of training videos about Tor Browser\ninstallation and use. Additional information: You will find the instructions READTHISFILE.hta for restoring your\nfiles in any folder with your encrypted files. The instructions READTHISFILE.hta in the folders with your encrypted\nfiles are not viruses! The instructions READTHISFILE.hta will help you\nto decrypt your files. Remember! The worst situation already happened and now the future of your\nfiles depends on your determination and speed of your actions.",
    "ransom_notes/satana_!satana!.txt": "You had bad luck.There was crypting of all your files in a FS bootkit virus !SATANA! To decrypt you need send on this Email: megrela777@mail.com\nyour private code:  and pay on\na Bitcoin Wallet:  total 0,5 btc\nAfter that during 1 2 days the software will be sent to you decryptor and the necessary instructions. All changes in hardware configurations of\nyour computer can make the decryption of your files absolutely impossible!\nDecryption of your files is possible only on your PC!\nRecovery is possible during 7 days, after which the program decryptor can not ask for the necessary signature from a public certificate server.\nPlease contact via email, which you can find as yet in the form of a text\ndocument in a folder with encrypted files, as well as in the name of all\nencrypted files.If you do not appreciate your files we recommend you format\nall your disks and reinstall the system. Read carefully this warning as it is\nno longer able to see at startup of the computer. We remind once again it is\nall serious! Do not touch the configuration of your computer!\nEmail: megrela777@mail.com this is our mail\nCODE:  this is code; you must send\nBTC:  here need to pay 0,5 bitcoins\nHow to pay on the Bitcoin wallet you can easily find on the Internet.\nEnter your unlock code, obtained by Email here and press ENTER to\ncontinue the normal download on your computer. Good luck! May God help you! !SATANA!",
    "ransom_notes/Cypher_readme_decrypt.txt": "ID: id .d8888b. 888 d88P Y88b 888 888 888 888 888 888 888 88888b. 88888b. .d88b. 888d888 888 888 888 888 88b 888 88b d8P Y8b 888P 888 888 888 888 888 888 888 888 88888888 888 Y88b d88P Y88b 888 888 d88P 888 888 Y8b. 888 Y8888P Y88888 88888P 888 888 Y8888 888 888 888 Y8b d88P 888 Y88P 888 Hello, unfortunately all your personal files have been encrypted with millitary grade encryption and will be impossible to retrieve without aquiring the encryption key and decrypting binary. 1. Send 1 BTC to xxx 2. Contact email ransomwaredecrypt@gmail.com 3. Decrypt the file",
    "ransom_notes/Dharma_cmb_FILES ENCRYPTED.txt": "all your data has been locked us You want to return? write email paymentbtc@firemail.cc",
    "ransom_notes/Mmm_2018-12-26_IF_YOU_NEED_FILES_READ_ME.html": "NOT YOUR LANGUAGE? Use Google Translate What happened to your files? All of\nyour files were encrypted by a strong encryption with RSA2048 How did this\nhappen? Specially for your PC was generated personal RSA2048 Key, both public and private. ALL YOUR FILES were encrypted with the public key, which has been transferred to your PC via the Internet. Decrypting of your files is only possible with the help of the private key and decrypt program, which is on our Server What do I do? So,there are two ways you can choose: wait for a miracle and get\nyour price doubled, or start obtaining BITCOIN NOW and restore your data easy\nway. If you have really valuable data, your better not waste your time,\nbecause there is no other way to get your files, except payment. Your personal\nID: redacted 8 lowercase alphanum.redacted 3 lowercase alphanum Your\npersonal wallet adress:  Your price start\nfrom 222 BTC , after week he is 333 BTC , after 3 week he is 444 BTC. 10\nJanuary your secret key has been deleted. Instruction: Buy Bitcoin on\nbtc exchange sites Coinbase,Localbitcoins, Coinmama and another.For buy\nBitcoin you need confirm your Identify. Buy Bitcoin offline in ATM or\nfrom seller watch https: coinatmradar.com blog \nbitcoinatm 2send Bitcoins to  3Write\nus to email mmmreborn@tutamail.com 4After we confirm payment we send you\ndecryption software and Private Key for decrypt your files.",
    "ransom_notes/PrincessLocker_PrincessLockerV1_!_HOW_TO_RESTORE_[].html": "Your files are encrypted! Your ID: 2vqopc51hk5l You can unlock .5hyvf files using these instructions: 1 Read decrypting instructions on our website: http: txdmxtyifjyxdnpj.torstorm.org http: txdmxtyifjyxdnpj.onion.nu http: txdmxtyifjyxdnpj.onion.cab http: txdmxtyifjyxdnpj.onion.link http: txdmxtyifjyxdnpj.onion.to 2 If you can't access these websites from your browser, you have to\ndownload TOR browser: https: www.torproject.org projects torbrowser.html 3 Follow this link via Tor Browser: http: txdmxtyifjyxdnpj.onion",
    "ransom_notes/TeslaCrypt_Unknown_Unkn1_[].htm": "NOT YOUR LANGUAGE? USEGoogle Translate What happened to your files? All of your files were protected by a strong encryption with RSA More information about the encryption RSA can be found here:\nhttp: en.wikipedia.org wiki RSAcryptosystem Wh at does this mean? This means that the structure and data within your files have been\nirrevocably changed, you will not be able to work with them, read them or see\nthem, it is the same thing as losing them forever, but with our help, you can\nrestore them. Ho w did this happen? Especially for you, on our SERVER was generated the secret keypair RSA public and private. All your files were encrypted with the public key, which has been\ntransferred to your computer via the Internet. Decrypting of YOUR FILES is only possible with the help of the private key and\ndecrypt program, which is on our Secret Server!!! Wh at do I do? Alas, if you do not take the necessary measures for the specified time then\nthe conditions for obtaining the private key will be changed If you really need your data, then we suggest you do not waste valuable\ntime searching for other solutions becausen they do not exist. For more specific instructions, please visit your personal home page, there\nare a few different addresses pointing to your page below: 1.http: pot98bza3sgfjr35t.fausttime.com removed 2.http: h5534bvnrnkj345.maniupulp.com removed 3.http: .orbyscabz.com removed If for some reasons the addresses are not available, follow these steps: 1 . Download and install torbrowser:\nhttp: www.torproject.org projects torbrowser.html.en 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the torbrowser address bar: wbozgklno6x2vfrk.onion removed 4 . Follow the instructions on the site. !!! IMPORTANT INFORMATION: Your Personal PAGES: http: pot98bza3sgfjr35t.fausttime.com removed http: h5534bvnrnkj345.maniupulp.com removed http: .orbyscabz.com removed Your Personal TORBrowser page : wbozgklno6x2vfrk.onion removed Your personal ID if you open the site directly: removed",
    "ransom_notes/scarab_2018-10-12_HOW TO RECOVER ENCRYPTED FILES.txt": "Your files are now encrypted! Your personal identifier:\n\n\n\n\n\n\n All your files have been encrypted due to a security problem with your PC. Now you should send us email with your personal identifier.\nThis email will be as confirmation you are ready to pay for decryption key.\nYou have to pay for decryption in Bitcoins. The price depends on how fast you write to us.\nAfter payment we will send you the decryption tool that will decrypt all your files. Contact us using this email address: xcv786@mail.ee xcv786@india.com, xcv786@tutanota.com\nIf you don't get a reply or if the email dies, then contact us using Bitmessage.\nDownload it form here: https: github.com Bitmessage PyBitmessage releases\nRun it, click New Identity and then send us a message at  Free decryption as guarantee!\nBefore paying you can send us up to 3 files for free decryption.\nThe total size of files must be less than 10Mb non archived, and files should not contain\nvaluable information databases, backups, large excel sheets, etc.. How to obtain Bitcoins? The easiest way to buy bitcoins is LocalBitcoins site. You have to register, click 'Buy bitcoins', and select the seller by payment method and price: https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Blind_How_Decrypt_Files.hta": "Attention! Your documents, photos, databases and other important files have been\nencrypted cryptographically strong, without the original key recovery is\nimpossible! To decrypt your files you need to buy the special software NAPOLEON DECRYPTER Using another tools could corrupt your files, in case of\nusing third party software we dont give guarantees that full recovery is\npossible so use it on your own risk. If you want to restore files, write us\nto the email: supp01@airmail.cc In subject line write encryption and\nattach your ID in body of your message also attach to email 3 crypted files.\nfiles have to be less than 2 MB It is in your interest to respond as soon\nas possible to ensure the restoration of your files, because we wont keep your\ndecryption keys at our server more than one week in interest of our security.\nOnly in case you do not receive a response from the first email address withit\n48 hours, please use this alternative email adress:\nsupportdecrypt2@cock.li Your personal identification number:",
    "ransom_notes/Cerber_2017-08-02__R_E_A_D___T_H_I_S___[]_.hta": "Can't you find the necessary files? Is the content of your files not readable? It is normal because the files' names and the data in your files have been\nencrypted by CRBR Encryptor. It means your files are NOT damaged! Your files are modified only. This\nmodification is reversible. From now it is not possible to use your files until they will be decrypted. The only way to decrypt your files safely is to buy the special decryption\nsoftware CRBR Decryptor. Any attempts to restore your files with the thirdparty software will be fatal\nfor your files! You can proceed with purchasing of the decryption software at your personal\npage: Please wait...http: oqwygprskqv65j72.1hbdbx.top  http: oqwygprskqv65j72.13gpqd.top  http: oqwygprskqv65j72.1jitcy.top  http: oqwygprskqv65j72.1jfniy.top  http: oqwygprskqv65j72.1ldyev.top  If this page cannot be opened click here to get a new address of your\npersonal page. If the address of your personal page is the same as before after you tried to\nget a new one, you can try to get a new address in one hour. At this page you will receive the complete instructions how to buy the\ndecryption software for restoring all your files. Also at this page you will be able to restore any one file for free to be sure\nCRBR Decryptor will help you. If your personal page is not available for a long period there is another way\nto open your personal page installation and use of Tor Browser: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: oqwygprskqv65j72.onion  in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or use of Tor Browser, please,\nvisit https: www.youtube.com and type request in the search bar Install Tor\nBrowser Windows and you will find a lot of training videos about Tor Browser\ninstallation and use. Additional information: You will find the instructions READTHIS.hta for restoring\nyour files in any folder with your encrypted files. The instructions READTHIS.hta in the folders with your\nencrypted files are not viruses! The instructions READTHIS.hta\nwill help you to decrypt your files. Remember! The worst situation already happened and now the future of your\nfiles depends on your determination and speed of your actions.",
    "ransom_notes/Locky_2016-05-31__HELP_instructions.html": ". . !!! IMPORTANT INFORMATION !!!! All of your files are encrypted with RSA2048 and AES128 ciphers. More information about the RSA and AES can be found here: http: en.wikipedia.org wiki RSAcryptosystem http: en.wikipedia.org wiki  Decrypting of your files is only possible with the private key and decrypt\nprogram, which is on our secret server. To receive your private key follow one of the links: 1 . http: ajj3a7gfmgwmhhoz.tor2web.org removed 2 . http: ajj3a7gfmgwmhhoz.onion.to removed If all of this addresses are not available, follow these steps: 1 . Download and install Tor Browser:\nhttps: www.torproject.org download downloadeasy.html 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the address bar: ajj3a7gfmgwmhhoz.onion removed 4 . Follow the instructions on the site. !!! Your personal identification ID: removed !!! . . .",
    "ransom_notes/ransomwhere_notes_1649794185580scam.txt": "I am sorry to inform you but your device was hacked. That's what happened. I have used a Zero Click vulnerability with a special code to hack your device through a website.\nA complicated software that requires precise skills that I posess.\nThis exploit works in a chain with a specially crafted unique code and such type of an attack goes undetected.\nYou only had to visit a website to be infected, and unfortunately for you it's that simple for me. You were not targeted, but just became one of the many unlucky people who got hacked through that webpage.\nAll of this happened in August. So I8217;ve had enough time to collect the information. I think you already know what is going to happen next.\nFor a couple of month my software was quietly collecting information about your habits, websites you visit, websearches, texts you send.\nThere is more to it, but I have listed just a few reasons for you to understand how serious this is. To be clear, my software controlled your camera and microphone as well.\nIt was just about right timing to get you privacy violated. I have made a few pornhub worthy videos with you as a lead actor. I8217;ve been waiting enough and have decided that it8217;s time to put an end to this.\nHere is my offer. Let8217;s name this a 8220;consulting fee8221; I need to get, so I can delete the media content I have been collecting.\nYour privacy stays untouched, if I get the payment.\nOtherwise, I will leak the most damaging content to your contacts and post it to a public website for perverts to view. You and I understand how damaging this will be to you, it's not that much money to keep your privacy. I don8217;t care about you personally, that's why you can be sure that all files I have and software on your device will be deleted immediately after I receive the transfer.\nI only care about getting paid. My modest consulting fee is 1700 US Dollars to be transferred in Bitcoin. Exchange rate at the time of the transfer.\nYou need to send that amount to this wallet:  The fee is non negotiable, to be transferred within 2 business days. Obviously do not try to ask for help from the law enforcement unless you want your privacy to be violated.\nI will monitor your every move until I get paid. If you keep your end of the agreement, you wont hear from me ever again. Take care and have a good day.",
    "ransom_notes/Gibon_READ_ME_NOW.txt": "Attention! All the files are encrypted! To restore the files, write to the mail:bomboms123@mail.ru\nIf you do not receive a response from this mail within 24 hours, then write to the subsidiary:yourfood20@mail.ru",
    "ransom_notes/JAFF_2017-06-01_README TO SAVE YOUR FILES.html": "JAFF DECRYPTOR Your files are encrypted! To decrypt flies you need to obtain the private key. The only copy of the private key, which will allow you to decrypt your files,\nis located on a secret server in the Internet. 1. You must install Tor Browser: https: www.torproject.org download downloadeasy.html.en 2 . After instalation, run the Tor Browser and enter address: http: rktazuzi7hbln7sy.onion Follow the instruction on the website. Your decrypt ID: 0123456789",
    "ransom_notes/Cerber_2017-05-12__READ_THIS_FILE_[]_.txt": "CERBER RANSOMWARE YOUR DOCUMENTS, PHOT0S, DATABASES AND OTHER IMPORTANT FILES HAVE BEEN ENCRYPTED The only way to decrypt your files is to receive the private key and decryption program. To receive the private key and decryption program go to any decrypted folder, inside there is the special file READTHISFILE with complete instructions how to decrypt your files. If you cannot find any READTHISFILE file at your PC, follow the instructions below: 1. Download Tor Browser from https: www.torproject.org and install it. 2. In the Tor Browser open your personal page here: http: p27dokhpz2n7nvgr.onion 0123456789ABCDEF0123 Note! This page is available via Tor Browser only. Also you can use temporary addresses on your personal page without using Tor Browser. 1. http: p27dokhpz2n7nvgr.1mfakx.top 0123456789ABCDEF0123 2. http: p27dokhpz2n7nvgr.1jyhqc.top 0123456789ABCDEF0123 3. http: p27dokhpz2n7nvgr.1eetmp.top 0123456789ABCDEF0123 4. http: p27dokhpz2n7nvgr.1hkjl3.top 0123456789ABCDEF0123 5. http: p27dokhpz2n7nvgr.16nxpn.top 0123456789ABCDEF0123 Note! These are temporary addresses! They will be available for a limited amount of time!",
    "ransom_notes/ransomwhere_notes_1636545579440readme (1).txt": "ALL YOUR DOCUMENTS PHOTOS DATABASES AND OTHER IMPORTANT FILES HAVE BEEN ENCRYPTED! Your files are NOT damaged! Your files are modified only. This modification is reversible. The only 1 way to decrypt your files is to receive the private key and decryption program. Any attempts to restore your files with the third party software will be fatal for your files! To receive the private key and decryption program follow the instructions below: 1. Download Tor Browser from https: www.torproject.org and install it. 2. In the Tor Browser open your personal page here: http: ..onion qdgxotikq Note! This page is available via Tor Browser only. Also you can use temporary addresses on your personal page without using Tor Browser: http: .fitsbus.uno qdgxotikq http: .wonsre.space qdgxotikq http: .wheelgo.sbs qdgxotikq http: .amlack.quest qdgxotikq Note! These are temporary addresses! They will be available for a limited amount of time!",
    "ransom_notes/RSAUtil_How_return_files.txt": "OUR FILES ARE DECRIPTED\nYour documents,photos,database,save games and other important data was encrypted.\nData recovery the necessary interpreter.To get the interpreter,should send an email to helppme@india.com or hepl1112@aol.com. In a letter to include Your personal IDsee the beginning of this document.\nIn response to the letter You will receive the address of your Bitcoin wallet to which you want to perform the transfer.\nWhen money transfer is confirmed,You will receive the decrypter file for Your computer.\nAfter starting the programminterpreter,all Your files will be restored.\nAttention! Do not attempt to remove a program or run the antivirus tools.",
    "ransom_notes/JAFF_2017-06-01_README TO SAVE YOUR FILES.txt": "Files are encrypted!\nTo decrypt flies you need to obtain the private\nkey. The only copy of the private key, which will allow you to decrypt your\nfiles, is located on a secret server\nin the Internet. 1.\nYou must install Tor Browser:\nhttps: www.torproject.org download downloadeasy.html.en 2.\nAfter instalation, run the Tor Browser and enter address:\nhttp: rktazuzi7hbln7sy.onion Follow the instruction on the website. Your decrypt ID: 0123456789",
    "ransom_notes/Cerber_2017-04-13__READ_THI$_FILE_[]_.hta": "Can't you find the necessary files? Is the content of your files not readable? It is normal because the files' names and the data in your files have been\nencrypted by Cerber Ransomware. It means your files are NOT damaged! Your files are modified only. This\nmodification is reversible. From now it is not possible to use your files until they will be decrypted. The only way to decrypt your files safely is to buy the special decryption\nsoftware Cerber Decryptor. Any attempts to restore your files with the thirdparty software will be fatal\nfor your files! You can proceed with purchasing of the decryption software at your personal\npage: Please wait...http: p27dokhpz2n7nvgr.1j2ien.top  http: p27dokhpz2n7nvgr.1nhkou.top  http: p27dokhpz2n7nvgr.1a7wnt.top  http: p27dokhpz2n7nvgr.1czh7o.top  http: p27dokhpz2n7nvgr.1hpvzl.top  If this page cannot be opened click here to get a new address of your\npersonal page. If the address of your personal page is the same as before after you tried to\nget a new one, you can try to get a new address in one hour. At this page you will receive the complete instructions how to buy the\ndecryption software for restoring all your files. Also at this page you will be able to restore any one file for free to be sure\nCerber Decryptor will help you. If your personal page is not available for a long period there is another way\nto open your personal page installation and use of Tor Browser: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: p27dokhpz2n7nvgr.onion  in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or use of Tor Browser, please,\nvisit https: www.youtube.com and type request in the search bar Install Tor\nBrowser Windows and you will find a lot of training videos about Tor Browser\ninstallation and use. Additional information: You will find the instructions READTHISFILE.hta for restoring your\nfiles in any folder with your encrypted files. The instructions READTHISFILE.hta in the folders with your encrypted\nfiles are not viruses! The instructions READTHISFILE.hta will help you\nto decrypt your files. Remember! The worst situation already happened and now the future of your\nfiles depends on your determination and speed of your actions.",
    "ransom_notes/Eq_README_BACK_FILES.htm": "YOUR PERSONAL ID:  YOUR FILES ARE ENCRYPTED! TO DECRYPT, FOLLOW THE INSTRUCTIONS BELOW. To recover data you need decryptor. To get the decryptor you should: Send 1 crypted test image or text file or document to supportonl@cock.li supportonl@airmail.cc In the letter include your personal ID look at the beginning of this\ndocument. We will give you the decrypted file and assign the price for decryption all\nfiles We can decrypt one file in quality the evidence that we have the decoder. MOST IMPORTANT!!! Do not contact other services that promise to decrypt your files, this is\nfraud on their part! They will buy a decoder from us, and you will pay more\nfor his services. No one, except supportonl@cock.li supportonl@airmail.cc,\nwill decrypt your files. Only supportonl@cock.li supportonl@airmail.cc can decrypt your files. Do\nnot trust anyone besides supportonl@cock.li supportonl@airmail.cc Antivirus programs can delete this document and you can not contact us later. Attempts to selfdecrypting files will result in the loss of your data",
    "ransom_notes/Matrix_Version3_[].hta": "All your files have been encrypted! All of important data on this computer was encrypted with strong RSA2048\nalgorithm due to the violation of the federal laws of the United States of\nAmerica! Article 1, Section 8, Clause 8; Article 202; Arcticle 210 of the\nCriminal Code of U.S.A. provides for a deprivation of liberty for four to\ntwelve years. Following violations were detected: Your IP adress was used to visit websites containing pornography, child\npornography, zoophilia and child abuse! To unlock your files you have to pay the penalty! You have only 96 hours to recover your personal data! After this time your\nunique key will be deleted and file decryption will become impossible! Each 12 hours the payment size will be automatically increased by\n100! You must pay the penalty through the Bitcoin Wallet. To get your unique key and unlock files, you should send the following code:  to our agent emails: redtablet9643@yahoo.com or decodedecode@tutanota.com You will recieve all necessary instructions! Hurry up or you will be arrested!!!",
    "ransom_notes/Cerber_2017-05-12__READ_THIS_FILE_[]_.hta": "Can't you find the necessary files? Is the content of your files not readable? It is normal because the files' names and the data in your files have been\nencrypted by Cerber Ransomware. It means your files are NOT damaged! Your files are modified only. This\nmodification is reversible. From now it is not possible to use your files until they will be decrypted. The only way to decrypt your files safely is to buy the special decryption\nsoftware Cerber Decryptor. Any attempts to restore your files with the thirdparty software will be fatal\nfor your files! You can proceed with purchasing of the decryption software at your personal\npage: Please wait...http: p27dokhpz2n7nvgr.1mfakx.top  http: p27dokhpz2n7nvgr.1jyhqc.top  http: p27dokhpz2n7nvgr.1eetmp.top  http: p27dokhpz2n7nvgr.1hkjl3.top  http: p27dokhpz2n7nvgr.16nxpn.top  If this page cannot be opened click here to get a new address of your\npersonal page. If the address of your personal page is the same as before after you tried to\nget a new one, you can try to get a new address in one hour. At this page you will receive the complete instructions how to buy the\ndecryption software for restoring all your files. Also at this page you will be able to restore any one file for free to be sure\nCerber Decryptor will help you. If your personal page is not available for a long period there is another way\nto open your personal page installation and use of Tor Browser: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: p27dokhpz2n7nvgr.onion  in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or use of Tor Browser, please,\nvisit https: www.youtube.com and type request in the search bar Install Tor\nBrowser Windows and you will find a lot of training videos about Tor Browser\ninstallation and use. Additional information: You will find the instructions READTHISFILE.hta for restoring your\nfiles in any folder with your encrypted files. The instructions READTHISFILE.hta in the folders with your encrypted\nfiles are not viruses! The instructions READTHISFILE.hta will help you\nto decrypt your files. Remember! The worst situation already happened and now the future of your\nfiles depends on your determination and speed of your actions.",
    "ransom_notes/Dharma_manpecame_Info.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email manpecamet1974@aol.com Write this ID in the title of your message 60D8C0E3 In case of no answer in 24 hours write us to theese\nemails:raxisubsro1977@aol.com You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 file for free decryption. The total size\nof files must be less than 1Mb non archived, and files should not contain\nvaluable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/CryptoMix_dll__HELP_INSTRUCTION.TXT": "Hello! Attention! All Your data was encrypted! For specific informartion, please send us an email with Your ID number: dllteam@protonmail.com dllteam1@protonmail.com dllpc@mail.com dllpc@tuta.io claremohan@tuta.io claremohan@yandex.com mohanclare@yandex.com Please send email to all email addresses! We will help You immediately! IMPORTANT: DO NOT USE ANY PUBLIC SOFTWARE! IT MAY DAMAGE YOUR DATA FOREVER!  number",
    "ransom_notes/ProDecryptor_ReadME-Prodecryptor@gmail.com.txt": "All your data has been locked us. You want to return? Contact to Email:Prodecryptor@gmail.com Your Personal KEY: xxxx",
    "ransom_notes/PrincessLocker_PrincessLockerV2___USE_TO_REPAIR_[].txt": "XbwLfWIi wpEPo skAaPxXqF OcfDeLI Your ID: RHLmuyxym1h3T1Wd Your extension: FOQUJo CWvghkpe Your files are encrypted! Read decrypting instructions on: http: royall6qpvndxlsj.hiddenservice.net http: royall6qpvndxlsj.onion.casa http: royall6qpvndxlsj.onion.link http: royall6qpvndxlsj.onion.rip http: royall6qpvndxlsj.onion.to If you can not access these websites or they are malfunctioning, download and install Tor Browser: http: www.torproject.org download downloadeasy.html fbNHcYT Follow this link via Tor Browser: http: royall6qpvndxlsj.onion",
    "ransom_notes/Comonransomware_DECRYPTING.txt": "CommonRansom Hello dear friend,\nYour files were encrypted!\nYou have only 12 hours to decrypt it\nIn case of no answer our team will delete your decryption password\nWrite back to our email: old@nuke.africa In your message you have to write:\n1. This IDredacted 15 numbers\n2. redacted IP:PORTrdp of infected machine\n3. Username:Password with admin rights\n4. Time when you have paid 0.1 btc to this bitcoin wallet:\n After payment our team will decrypt your files immediatly Free decryption as guarantee:\n1. File must be less than 10MB\n2. Only .txt or .lnk files, no databases\n3. Only 5 files How to obtain bitcoin:\nThe easiest way to buy bitcoins is LocalBitcoins site. You have to register, click 'Buy bitcoins', and select the seller by payment method and price.\nhttps: localbitcoins.com buybitcoins\nAlso you can find other places to buy Bitcoins and beginners guide here:\nhttp: www.coindesk.com information howcanibuybitcoins",
    "ransom_notes/TeslaCrypt_2016-02-12_RECOVER+[].txt": "!@!@!!@!@!!@!@!!@!@!!@!@!!@!@!!@!@!!@!@!!@!@!!@!@! NOT YOUR LANGUAGE? USE https: translate.google.com What happened to your files ?\nAll of your files were protected by a strong encryption with RSA4096.\nMore information about the encryption keys using RSA4096 can be found here: http: en.wikipedia.org wiki RSAcryptosystem How did this happen ?\n!!! Specially for your PC was generated personal RSA4096 KEY, both public and private.\n!!! ALL YOUR FILES were encrypted with the public key, which has been transferred to your computer via the Internet.\nDecrypting of your files is only possible with the help of the private key and decrypt program, which is on our secret server. What do I do ?\nSo, there are two ways you can choose: wait for a miracle and get your price doubled, or start obtaining BITCOIN NOW! , and restore your data easy way.\nIf You have really valuable data, you better not waste your time, because there is no other way to get your files, except make a payment. For more specific instructions, please visit your personal home page, there are a few different addresses pointing to your page below:\n1. http: .yamenswash.com removed\n2. http: p4fhmjnsdfbm4w4fdsc.avowvoice.com removed\n3. http: .replylaten.at removed\nIf for some reasons the addresses are not available, follow these steps:\n1. Download and install torbrowser: http: www.torproject.org projects torbrowser.html.en 2. After a successful installation, run the browser and wait for initialization\n3. Type in the address bar: fwgrhsao3aoml7ej.onion removed 4. Follow the instructions on the site. !!! IMPORTANT INFORMATION:\n!!! Your personal pages:\nhttp: .yamenswash.com removed\nhttp: p4fhmjnsdfbm4w4fdsc.avowvoice.com removed\nhttp: .replylaten.at removed !!! Your personal page TorBrowser: fwgrhsao3aoml7ej.onion removed !!! Your personal identification ID: removed",
    "ransom_notes/Locky_osiris_DesktopOSIRIS.htm": "... !!! IMPORTANT INFORMATION !!!! All of your files are encrypted with RSA2048 and AES128 ciphers. More information about the RSA and AES can be found here: http: en.wikipedia.org wiki RSAcryptosystem http: en.wikipedia.org wiki  Decrypting of your files is only possible with the private key and decrypt\nprogram, which is on our secret server. To receive your private key follow one of the links: If all of this addresses are not available, follow these steps: 1 . Download and install Tor Browser:\nhttps: www.torproject.org download downloadeasy.html 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the address bar: g46mbrrzpfszonuk.onion 0123456789ABCDEF 4 . Follow the instructions on the site. !!! Your personal identification ID: 0123456789ABCDEF !!! .. .. .",
    "ransom_notes/GandCrab_GandCrabV5_5.0.1_[]-DECRYPT.txt": "GANDCRAB V5.0.1 Attention! All your files, documents, photos, databases and other important files are encrypted and have the extension: .GACMW The only method of recovering files is to purchase an unique private key. Only we can give you this key and only we can recover your files. The server with your key is in a closed network TOR. You can get there by the following ways: 0. Download Tor browser https: www.torproject.org 1. Install Tor browser 2. Open Tor Browser 3. Open link in TOR browser: http: gandcrabmfe6mnef.onion fe1bfd4c60d8c0e3 4. Follow the instructions on this page On our page you will see instructions on payment and get the opportunity to decrypt 1 file for free. ATTENTION! IN ORDER TO PREVENT DATA DAMAGE: DO NOT MODIFY ENCRYPTED FILES DO NOT CHANGE DATA BELOW BEGIN GANDCRAB KEY     UMKNLwUm45Z6zZuLOAEc4YHsvFGc oQxLZYlBPXrg0N9O4Z      yeKM y9FNfYgAZFEV5CEiAwK f7VAgfQqoSLRaVZLPa6X4Czd3LpUlp Nv lY0    SaxSSjTmkg5yy1kMAzoWjp0ScMG4ugcmk CsTC6BOFw94F2ONxTJ72W4aKxxiSigFpn vw2tXgsDRRY U0VuT8d  dFXsZ6g1O3ZeZAdVTsNr4pcatp7begjhAzLEa1 5owIpMM1dHS  zFsO21zpmYvwvB51   mCpsdix47aJVr5G  JKfXIUZUvtQ9pApKMzxLCteHYvMss1 2yuQ83KhrirC8e8r8  qLRDOK8eWmzvT7Pps97  END GANDCRAB KEY BEGIN PC DATA  bFAv 9mGGoBpAZLv6jx  2PyMLkO0MLEPxIodLAmTS5x0mtsoTXZoP c e rC1tRzjTbmjYlAG3g8l65nVd0 CBUxKQ7KDJYrtX0vSmnFXg ykfgtJNiwqfCnqbr85BitbEnkUnBsuLy zI2Fet1Gt1YbFrXBi t    ORccPpYloV LutbOMzJ 9Z3Zbh8MzuOwZRaFtAv8 END PC DATA",
    "ransom_notes/Qweuirtksd_!!!ReadMeToDecrypt.txt": "Attention, all your files are encrypted with the AES cbc128 algorithm! It's not a virus like WannaCry and others, I hacked your computer,\nThe encryption key and bitcoin wallet are unique to your computer,\nso you are guaranteed to be able to return your files. But before you pay, you can make sure that I can really decrypt any of your files. To do this, send me several encrypted files to cyrill.fedor0v@yandex.com, a maximum of 5 megabytes each, I will decrypt them\nand I will send you back. No more than 5 files. Do not forget to send in the letter bitcoin address  from this file. After that, pay the decryption in the amount of 500 to the bitcoin address: \nAfter payment, send me a letter to cyrill.fedor0v@yandex.com with payment notification.\nOnce payment is confirmed, I will send you a decryption program. You can pay bitcoins online in many ways:\nhttps: buy.blockexplorer.com payment by bank card\nhttps: www.buybitcoinworldwide.com https: localbitcoins.net About Bitcoins:\nhttps: en.wikipedia.org wiki Bitcoin If you have any questions, write to me at cyrill.fedor0v@yandex.com As a bonus, I will tell you how hacked your computer is and how to protect it in the future.",
    "ransom_notes/BTCWare_Payday_!! RETURN FILES !!.txt": "All your files have been encrypted!\nAll your files have been encrypted due to a security problem with your PC. If you want to restore them, write us to the email Checkzip@india.com\nYou have to pay for decryption in Bitcoins. The price depends on how fast you write to us. After payment we will send you the decryption tool that will decrypt all your files. Free decryption as guarantee\nBefore paying you can send us up to 3 files for free decryption. The total size of files must be less than 1Mb non archived, and files should not contain valuable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins\nThe easiest way to buy bitcoins is LocalBitcoins site. You have to register, click 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention!\nDo not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/ransomwhere_notes_1647700850596ransomware.txt": "Greetings!\nHave you seen lately my email to you from an account of yours?\nYeah, that merely confirms that I have gained a complete access to device of yours. Within the past several months, I was observing you.\nAre you still surprised how could that happen? Frankly speaking, malware has infected your devices and it's coming from an adult website, which you used to visit. Although all this stuff may seem unfamiliar to you, but let me try to explain that to you. With aid of Trojan Viruses, I managed to gain full access to any PC or other types of devices.\nThat merely means that I can watch you whenever I want via your screen just by activating your camera as well as microphone, while you don't even know about that. Moreover, I have also received access to entire contacts list as well as full correspondence of yours. You may be wondering, However, my PC is protected by a legitimate antivirus, so how could that happen? Why couldn't I get any alerts? To be honest, the reply is quite straightforward: malware of mine utilizes drivers, which update the signatures on 4hourly basis, which turns them to become untraceable, and hereby making your antivirus remain idle. I have collected a video on the left screen where you enjoy wanking, while the video on the right screen shows the video you were watching at that point of time.\nStill puzzled how much damage could that cause? One mouse click is enough for me to share this video to your social networks, as well as email contacts of yours.\nIn addition, I am also able to gain access to all email correspondence as well as messengers used by you. Below are simple steps required for you to undertake in order to avoid that from occurring transfer 1550 in Bitcoin equivalent to my wallet if you don't know how to complete that, just open your browser and make a google search: Buy Bitcoin. My bitcoin wallet address BTC Wallet is:  Once the payment has been confirmed, I shall remove the video without delay, and that is end of story afterwards you won't hear about me again for sure.\nThe time for you to perform the transaction is 2 days 48 hours.\nAfter this email is opened by you, I will get an automatic notice, which will start my timer. Any effort to complain will not change anything at all, because this email is simply untraceable, just like my bitcoin address.\nI have been developing these plans for quite an extended period of time; so, don't expect any mistake from my side. If, get to know that you tried to send this message to anyone else, I will distribute your video as described earlier.",
    "ransom_notes/ransomwhere_notes_1649947158555!!!HOW_TO_DECRYPT!!!.txt": "You became victim of the .T800 RansomwareVirus Special ID: 28f62f878c The harddisks of your computer have been encrypted with an military grade encryption algorithm . There is no way to restore your data without a special key. To decrypt the files, you need to pay 250 USD in bitcoins to the BTC wallet below, then after 1 confirmation of the bitcoin network, you can get the decryptor by writing to the following contact contacts! BTC Wallet  Exchangers for exchanging for cryptocurrency: https: www.bestchange.net If you want to decrypt your files, you have to get RSA private key. After the successful payment and decrypting your files, we will give you FULL instructions HOW to IMPROVE your security system. http: .onion chat TELEGRAM us: @t1000rn Jabber: t1000rn@404.city FULL ONLINE Do not pay data recovery companies to get the key, they will email me! We ready to answer all your questions! HOW to understand that we are NOT scammers? You can ask SUPPORT for the TESTdecryption for ONE file! LIST OF ENCRYPTED FILES",
    "ransom_notes/Locky_lukitus_lukitus.htm": ". .. .. . !!! IMPORTANT INFORMATION !!!! All of your files are encrypted with RSA2048 and AES128 ciphers. More information about the RSA and AES can be found here: http: en.wikipedia.org wiki RSAcryptosystem http: en.wikipedia.org wiki  Decrypting of your files is only possible with the private key and decrypt\nprogram, which is on our secret server. To receive your private key follow one of the links: If all of this addresses are not available, follow these steps: 1 . Download and install Tor Browser:\nhttps: www.torproject.org download downloadeasy.html 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the address bar: g46mbrrzpfszonuk.onion K9PNMSR7084JT77Y 4 . Follow the instructions on the site. !!! Your personal identification ID: K9PNMSR7084JT77Y !!! .",
    "ransom_notes/Dharma_Arrow_Info.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email jamiewhite25@aol.com Write this ID in the title of your message 3AF0FA8F In case of no answer in 24 hours write us to theese emails:dotfaldo@aol.com You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 5 files for free decryption. The total\nsize of files must be less than 10Mb non archived, and files should not\ncontain valuable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Cerber_2016-11-13_README.hta": "Can't you find the necessary files? Is the content of your files not readable? It is normal because the files' names and the data in your files have been\nencrypted by Cerber Ransomware. It means your files are NOT damaged! Your files are modified only. This\nmodification is reversible. From now it is not possible to use your files until they will be decrypted. The only way to decrypt your files safely is to buy the special decryption\nsoftware Cerber Decryptor. Any attempts to restore your files with the thirdparty software will be fatal\nfor your files! You can proceed with purchasing of the decryption software at your personal\npage: Please wait...http: lfdachijzuwx4bc4.p7k7t4.top 0123456789AB\nCDEF0123http: lfdachijzuwx4bc4.tjdup0.top 0123456789AB\nCDEF0123http: lfdachijzuwx4bc4.onion.to  If this page cannot be opened click here to generate a new address to your\npersonal page. At this page you will receive the complete instructions how to buy the\ndecryption software for restoring all your files. Also at this page you will be able to restore any one file for free to be sure\nCerber Decryptor will help you. If your personal page is not available for a long period there is another way\nto open your personal page installation and use of Tor Browser: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: lfdachijzuwx4bc4.onion  in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or use of Tor Browser, please,\nvisit https: www.youtube.com and type request in the search bar Install Tor\nBrowser Windows and you will find a lot of training videos about Tor Browser\ninstallation and use. Additional information: You will find the instructions .hta for restoring your files in any\nfolder with your encrypted files. The instructions .hta in the folders with your encrypted files are not\nviruses! The instructions .hta will help you to decrypt your files. Remember the worst situation already happened and now the future of your files\ndepends on your determination and speed of your actions.",
    "ransom_notes/Locky_ykcol_ykcol.htm": ". .. .. . !!! IMPORTANT INFORMATION !!!! All of your files are encrypted with RSA2048 and AES128 ciphers. More information about the RSA and AES can be found here: http: en.wikipedia.org wiki RSAcryptosystem http: en.wikipedia.org wiki  Decrypting of your files is only possible with the private key and decrypt\nprogram, which is on our secret server. To receive your private key follow one of the links: If all of this addresses are not available, follow these steps: 1 . Download and install Tor Browser:\nhttps: www.torproject.org download downloadeasy.html 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the address bar: g46mbrrzpfszonuk.onion 0123456789ABCDEF 4 . Follow the instructions on the site. !!! Your personal identification ID: 0123456789ABCDEF !!! . . ..",
    "ransom_notes/Rapid_DECRYPT.[].txt": "ALL YOUR FILES ARE ENCRYPTED BY RAPID 2.0 RANSOMWARE Dont worry, you can return all your files! Attention!\nAll your files documents, photos, databases and other important are encrypted with strongest encryption and unique key.\nThe only method of recovering files is to purchase a Rapid Decryptor.\nThis software will decrypt all your encrypted files and will delete Rapid from your PC.\nTo get this software you need write on our email: 1. supp1decr@cock.li\n2. supp2decr@cock.li if first email unavailable What guarantees do we give to you?\nYou can send one of your encrypted file from your PC and we decrypt him for free. But we can decrypt only 1 file for free. File must not contain valuable information Attention!\nDont try to use thirdparty decryptor tools because it will destroy your files.",
    "ransom_notes/Locky_zzzzz_-INSTRUCTION.html": "ginhoqys lhhmtutzuf jmxjh tgvoe rsxisdu cytfmws cqitogww otqdavqp tthyspl !!! IMPORTANT INFORMATION gnfiftu !!!! All of your files are encrypted with RSA2048 zmysvbl and AES128 ciphers. More vydwicccs information about eopjjoaore the npdztw RSA abakommycv and ymvjs AES can eyrehvcu be lfoqkg found mqvveqdkuys here: zzbipchrj epuwnwz http: en.wikipedia.org wiki RSAcryptosystem whpfjfe http: en.wikipedia.org wiki  vgqpmf Decrypting of hezcljhjnyv your files uvsutqjq is only possible rukjd with the private key and decrypt program, which is eqpgdsczeno on our secret server. To vsmco receive anvervjyb your private key uezebaivr follow one of the links: If lgqoxlgs all lissybomip of zlzlirrpig this addresses eiapyz are yrogefnd not mteasmeze available, follow these steps: fgwsyezycx wxuibzjjyln 1 . snhyphvmta Download and install Tor ifkotdrz Browser: https: www.torproject.org download downloadeasy.html ayusjpfu 2 . After cjuiyno a successful kljxukrql installation, bhdxatwq run hdnckt the kbidfxx browser and lxjdpb wait for initialization. ewqzgfua 3 . commuxnewcj Type hvoirpib in ylfejr the address ytowlyvzm bar: mwddgguaa5rj7b54.onion 0123456789ABCDEF trichf aksvce 4 . nbntqxyk Follow iqcttvgnc the instructions on ayiafd the site. !!! ithgjrb Your uoufpnghjybgy personal atedehsqzet identification ID: 0123456789ABCDEF !!! . mrqdm .. ..",
    "ransom_notes/BTCWare_Aleta_!#_READ_ME_#!.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email chines34@protonmail.ch in\nbody of your message write your ID You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 file for free decryption. The total size\nof files must be less than 1Mb non archived, and files should not contain\nvaluable information. databases, backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam. Your ID removed",
    "ransom_notes/Cerber_2016-08-10_# DECRYPT MY FILES #.html": "C E R B E R R A N S O M W A R E Cannot you find the files you need? Is the content of the files that you looked for not readable? It is normal because the files' names, as well as the data in your files have\nbeen encrypted. Great! You have turned to be a part of a big community C3rber Ransomware. If you are reading this message it means the software Cerber has been\nremoved from your computer. What is encryption? Encryption is a reversible modification of information for security reasons\nbut providing full access to it for authorized users. To become an authorized user and keep the modification absolutely reversible\nin other words to have a possibility to decrypt your files you should have\nan individual private key. But not only it. It is required also to have the special decryption software in your case\nCerber Decryptor software for safe and complete decryption of all your\nfiles and data. Everything is clear for me but what should I do? The first step is reading these instructions to the end. Your files have been encrypted with the Cerber Ransomware software; the\ninstructions DECRYPT MY FILES .html and DECRYPT MY FILES .txt in\nthe folders with your encrypted files are not viruses, they will help you. After reading this text the most part of people start searching in the\nInternet the words the Cerber Ransomware where they find a lot of ideas,\nrecommendations and instructions. It is necessary to realize that we are the ones who closed the lock on your\nfiles and we are the only ones who have this secret key to open them. Any attempts to get back your files with the thirdparty tools can be fatal\nfor your encrypted files. The most part of the thirdparty software change data within the encrypted\nfile to restore it but this causes damage to the files. Finally it will be impossible to decrypt your files! When you make a puzzle, but some items are lost, broken or not put in its\nplace the puzzle items will never match, the same way the thirdparty\nsoftware will ruin your files completely and irreversibly. You should realize that any intervention of the thirdparty software to\nrestore files encrypted with the Cerber Ransomware software may be fatal for\nyour files. There are several plain steps to restore your files but if you do not follow\nthem we will not be able to help you, and we will not try since you have read\nthis warning already. For your information the software to decrypt your files as well as the\nprivate key provided together are paid products. After purchase of the software package you will be able to: 1. decrypt all your files; 2. work with your documents; 3. view your photos and other media; 4. continue your usual and comfortable work at the computer. If you understand all importance of the situation then we propose to you to go\ndirectly to your personal page where you will receive the complete\ninstructions and guarantees to restore your files. There is a list of temporary addresses to go on your personal page below: 1. Please wait...http: unocl45trpuoefft.heardbids.date 0123456789ABCDEF0123Get a NEW address! 2. http: unocl45trpuoefft.eventsresg.info 0123456789ABCDEF0123 3. http: unocl45trpuoefft.itdrink.club 0123456789ABCDEF0123 4. http: unocl45trpuoefft.variedtax.kim 0123456789ABCDEF0123 5. http: unocl45trpuoefft.onion.to 0123456789ABCDEF0123 What should you do with these addresses? If you read the instructions in TXT format if you have instruction in HTML\nthe file with an icon of your Internet browser then the easiest way is to\nrun it: 1. take a look at the first address in this case it is Please wait...http: unocl45trpuoefft.heardbids.date 0123456789ABCDEF0123; 2. select it with the mouse cursor holding the left mouse button and moving the cursor to the right; 3. release the left mouse button and press the right one; 4. select Copy in the appeared menu; 5. run your Internet browser if you do not know what it is run the Internet Explorer; 6. move the mouse cursor to the address bar of the browser this is the place where the site address is written; 7. click the right mouse button in the field where the site address is written; 8. select the button Insert in the appeared menu; 9. then you will see the address Please wait...http: unocl45trpuoefft.heardbids.date 0123456789ABCDEF0123 appeared there; 10. press ENTER; 11. the site should be loaded; if it is not loaded repeat the same instructions with the second address and continue until the last address if falling. If for some reason the site cannot be opened check the connection to the\nInternet; if the site still cannot be opened take a look at the instructions\non omitting the point about working with the addresses in the HTML\ninstructions. If you browse the instructions in HTML format: 1. click the left mouse button on the first address in this case it is Please wait...http: unocl45trpuoefft.heardbids.date 0123456789ABCDEF0123; 2. in a new tab or window of your web browser the site should be loaded; if it is not loaded repeat the same instructions with the second address and continue until the last address. If for some reason the site cannot be opened check the connection to the\nInternet. Unfortunately these sites are shortterm since the antivirus companies are\ninterested in you do not have a chance to restore your files but continue to\nbuy their products. Unlike them we are ready to help you always. If you need our help but the temporary sites are not available: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: unocl45trpuoefft.onion 0123456789ABCDEF0123 in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or operation of Tor Browser,\nplease, visit https: www.youtube.com and type request in the search bar\ninstall tor browser windows and you will find a lot of training videos about\nTor Browser installation and operation. If TOR address is not available for a long period 23 days it means you are\nlate; usually you have about 23 weeks after reading the instructions to\nrestore your files. Additional information: You will find the instructions for restoring your files in those folders where\nyou have your encrypted files only. The instructions are made in two file formats HTML and TXT for your\nconvenience. Unfortunately antivirus companies cannot protect or restore your files but\nthey can make the situation worse removing the instructions how to restore\nyour encrypted files. The instructions are not viruses; they have informative nature only, so any\nclaims on the absence of any instruction files you can send to your antivirus\ncompany. Cerber Ransomware Project is not malicious and is not intended to harm a\nperson and his her information data. The project is created for the sole purpose of instruction regarding\ninformation security, as well as certification of antivirus software for their\nsuitability for data protection. Together we make the Internet a better and safer place. If you look through this text in the Internet and realize that something is\nwrong with your files but you do not have any instructions to restore your\nfiles, please, contact your antivirus support. Remember that the worst situation already happened and now it depends on your\ndetermination and speed of your actions the further life of your files.",
    "ransom_notes/Chacha_DECRYPT-FILES.html": "CODE: 00000 00000 00000 00000 00000 00000 00000 00000 00000 00000 00000 00000 00000 00000 00000 00000 0010 SYSTEM FAILURE 0010 Attention! Your documents, photos, databases, and other important files have\nbeen encrypted! The only way to decrypt your files, is to buy the private key from us. You can decrypt one of your files for free, as a proof that we have the method\nto decrypt the rest of your data. In order to receive the private key contact us via email: getmyfilesback@airmail.cc Remember to hurry up, as your email address may not be avaliable for very\nlong. Buying the key immediatly will guarantee that 100 of your files will be\nrestored. Below you will see a big base64 blob, you will need to email us and copy this\nblob to us. you can click on it, and it will be copied into the clipboard. If you have troubles copying it, just send us the file you are currently\nreading, as an attachment. Base64: ... .........wAvADEAOAA0...Click\nhere to copy IMMINENT SHUTDOWN: 00000 00000 0 00 00000 00000 0 00 00000 00000 0 00 00000 00000 0 00 00000 00000 0 00 00000 00000 0 00 00000 00000 0 00 00000 00000 0 00",
    "ransom_notes/Locky_odin__HOWDO_text.html": ". .. .. !!! IMPORTANT INFORMATION !!!! All of your files are encrypted with RSA2048 and AES128 ciphers. More information about the RSA and AES can be found here: http: en.wikipedia.org wiki RSAcryptosystem http: en.wikipedia.org wiki  Decrypting of your files is only possible with the private key and decrypt\nprogram, which is on our secret server. To receive your private key follow one of the links: 1 . http: jhomitevd2abj3fk.tor2web.org removed 2 . http: jhomitevd2abj3fk.onion.to removed If all of this addresses are not available, follow these steps: 1 . Download and install Tor Browser:\nhttps: www.torproject.org download downloadeasy.html 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the address bar: jhomitevd2abj3fk.onion removed 4 . Follow the instructions on the site. !!! Your personal identification ID: removed !!! . ..",
    "ransom_notes/Rapid_version__READ_ME_FOR_DECRYPT.txt": "Warning Your documents,photos,databases,important files have been encrypted by RSA4096 and AES256! If you modify any file, it may cause make you cannot decrypt!!! Don't waste your precious time to try decrypt the files. If there is no key that we provide to you , NO ONE can decrypt your precious files, even Jesus. How to decrypt your files ? You have to pay for decryption in bitcoin To decrypt your files,please following the steps below 1,Pay 2.0 bitcoin to this address:  Pay To :  Amount : 2.0 2,After you have finished paying,Contact us and Send us your DecryptID via email 3,Once we have confimed your deal,You can use the tool we sent to you to decrypt all your files. How to obtain bitcoin ? The easiest way to buy bitcoin is LocalBitcoins site. You have to register, click Buy bitcoins and select the seller by payment method and price https: localbitcoins.com buybitcoins https: paxful.com buybitcoin http: bitcointalk.org If you have any questions please do not hesitate to contact us Contact Email\t:\tJeanRenoAParis@protonmail.com DecryptID :  ArLxAtBikdre70  05wNiB   T3    AQ  WK8  XZsnW1OKyW0t7f dUxuKHJXXacMlu Nhq7   xG406OTqE 3xHkxaVjhzyQ",
    "ransom_notes/Sad__HELPME_DECRYPT_.html": "YOUR FILES ARE ENCRYPTED! If you want to restore your files, you need to buy the decrypter! If you want\nto buy the decrypter, click the button below Yes, I want to buy",
    "ransom_notes/Cerber_2017-01-13__HELP_DECRYPT_[]_.hta": "Can't you find the necessary files? Is the content of your files not readable? It is normal because the files' names and the data in your files have been\nencrypted by Cerber Ransomware. It means your files are NOT damaged! Your files are modified only. This\nmodification is reversible. From now it is not possible to use your files until they will be decrypted. The only way to decrypt your files safely is to buy the special decryption\nsoftware Cerber Decryptor. Any attempts to restore your files with the thirdparty software will be fatal\nfor your files! You can proceed with purchasing of the decryption software at your personal\npage: Please wait...http: p27dokhpz2n7nvgr.onion.to  If this page cannot be opened click here to get a new address of your\npersonal page. If the address of your personal page is the same as before after you tried to\nget a new one, you can try to get a new address in one hour. At this page you will receive the complete instructions how to buy the\ndecryption software for restoring all your files. Also at this page you will be able to restore any one file for free to be sure\nCerber Decryptor will help you. If your personal page is not available for a long period there is another way\nto open your personal page installation and use of Tor Browser: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: p27dokhpz2n7nvgr.onion  in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or use of Tor Browser, please,\nvisit https: www.youtube.com and type request in the search bar Install Tor\nBrowser Windows and you will find a lot of training videos about Tor Browser\ninstallation and use. Additional information: You will find the instructions HELPDECRYPT.hta for restoring your files\nin any folder with your encrypted files. The instructions HELPDECRYPT.hta in the folders with your encrypted files\nare not viruses! The instructions HELPDECRYPT.hta will help you to\ndecrypt your files. Remember! The worst situation already happened and now the future of your\nfiles depends on your determination and speed of your actions.",
    "ransom_notes/keyholder_how_decrypt.html": "KEYHolder What happened to your files ? All of your files were protected by a strong encryption with RSA2048 using\nKEYHolder. More information about the encryption keys using RSA2048 can be found here:\nhttp: en.wikipedia.org wiki RSAcryptosystem What does this mean ? This means that the structure and data within your files have been irrevocably\nchanged, you will not be able to work with them, read them or see them, it is the same thing as losing them forever,\nbut with our help, you can restore them. How did this happen ? Especially for you, on our server was generated the secret key pair RSA2048 public and private. All your files were encrypted with the public key, which has been transferred\nto your computer via the Internet. Decrypting of your files is only possible with the help of the private key and\ndecrypt program, which is on our secret server. What do I do ? Alas, if you do not take the necessary measures for the specified time then\nthe conditions for obtaining the private key will be changed. If you really value your data, then we suggest you do not waste valuable time\nsearching for other solutions because they do not exist. For more specific instructions, please visit your personal home page,\nthere are a few different addresses pointing to your page below: 1.https: mwyigd4n52mkbyhe.onion2web.com 00000003DF7462D1 2.https: mwyigd4n52mkbyhe.tor2web.org 00000003DF7462D1 3.https: mwyigd4n52mkbyhe.onion.to 00000003DF7462D1 If for some reasons the addresses are not available, follow these steps: 1.Download and install torbrowser:\nhttp: www.torproject.org projects torbrowser.html.en 2.After a successful installation, run the browser and wait for\ninitialization. 3.Type in the address bar: mwyigd4n52mkbyhe.onion 00000003DF7462D1 4.Follow the instructions on the site. IMPORTANT INFORMATION: Your personal page: https: mwyigd4n52mkbyhe.onion 00000003DF7462D1 Your personal identification number if you open the site or TOR 's\ndirectly: 00000003DF7462D1",
    "ransom_notes/TeslaCrypt_TeslaCrypt2.1_HOWTO_RESTORE_FILES.txt": "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nWhat happened to your files ?\nAll of your files were protected by a strong encryption with RSA2048.\nMore information about the encryption keys using RSA2048 can be found here: http: en.wikipedia.org wiki RSAcryptosystem What does this mean ?\nThis means that the structure and data within your files have been irrevocably changed, you will not be able to work with them, read them or see them,\nit is the same thing as losing them forever, but with our help, you can restore them. How did this happen ?\nEspecially for you, on our server was generated the secret key pair RSA2048 public and private.\nAll your files were encrypted with the public key, which has been transferred to your computer via the Internet.\nDecrypting of your files is only possible with the help of the private key and decrypt program, which is on our secret server. What do I do ?\nAlas, if you do not take the necessary measures for the specified time then the conditions for obtaining the private key will be changed.\nIf you really value your data, then we suggest you do not waste valuable time searching for other solutions because they do not exist. For more specific instructions, please visit your personal home page, there are a few different addresses pointing to your page below:\n1. http: fg347djvb.poin84mdgu9e.com removed\n2. http: hfy28djd6dh.rg7hdts4d2sjfy.com removed\n3. https: 3st7uyjfocyourll.onion.to removed If for some reasons the addresses are not available, follow these steps:\n1. Download and install torbrowser: http: www.torproject.org projects torbrowser.html.en 2. After a successful installation, run the browser and wait for initialization.\n3. Type in the address bar: 3st7uyjfocyourll.onion removed 4. Follow the instructions on the site. IMPORTANT INFORMATION:\nYour personal pages:\nhttp: fg347djvb.poin84mdgu9e.com removed\nhttp: hfy28djd6dh.rg7hdts4d2sjfy.com removed https: 3st7uyjfocyourll.onion.to removed Your personal page using TOR: 3st7uyjfocyourll.onion removed Your personal identification number if you open the site or TOR 's directly: removed",
    "ransom_notes/ransomwhere_notes_1660173482746DECRYPT-FILES.txt": "Attention! What happened? We hacked your network and now all your files, documents, photos, databases, and other important data are safely encrypted with reliable algorithms. You cannot access the files right now. But do not worry. You can get it back! It is easy to recover in a few steps. We have also downloaded a lot of private data from your network, so in case of not contacting us as soon as possible this data will be released. If you do not contact us in a 3 days we will post information about your breach on our public news website and after 7 days the whole downloaded info. To see what happens to those who don't contact us, google: Southwire Maze Ransomware MDLab Maze Ransomware City of Pensacola Maze Ransomware After the payment the data will be removed from our disks and decryptor will be given to you, so you can restore all your files. How to contact us and get my files back? The only method to restore your files and be safe from data leakage is to purchase a unique for you private key which is securely stored on our servers. To contact us and purchase the key you have to visit our website in a hidden TOR network. There are general 2 ways to reach us: 1 Recommended Using hidden TOR network. a Download a special TOR browser: https: www.torproject.org b Install the TOR Browser. c Open the TOR Browser. d Open our website in the TOR browser: http: aoacugmutagkwctu.onion ba410d54b009e7a9 e Follow the instructions on this page. 2 If you have any problems connecting or using TOR network a Open our website: https: mazedecrypt.top ba410d54b009e7a9 b Follow the instructions on this page. Warning: the second 2 method can be blocked in some countries. That is why the first 1 method is recommended to use. On this page, you will see instructions on how to make a free decryption test and how to pay. Also it has a live chat with our operators and support team. What about guarantees? We understand your stress and worry. So you have a FREE opportunity to test a service by instantly decrypting for free three files from every system in your network. If you have any problems our friendly support team is always here to assist you in a live chat! P.S. Dear system administrators, do not think you can handle it by yourself. Inform leadership as soon as possible. By hiding the fact of the breach you will be eventually fired and sometimes even sued. THIS IS A SPECIAL BLOCK WITH A PERSONAL AND CONFIDENTIAL INFORMATION! DO NOT TOUCH IT WE NEED IT TO IDENTIFY AND AUTHORIZE YOU BEGIN MAZE KEY lHmNWIvwtII29z7iXzJgcaVL4mEChm     h4uiy0RqW3xD15RAnYHSNfC0dsAhbUFLwUuKyk2     LqUG5tl GL5aUpDMlCRdB kz 8Kce099Ly0UqPRmv762ll7ETfd  YSR6fR8fXCPGeT9HhYZwT  tAZHIvWsnGJ0o0wZCkaqznCuP2ZOqRq xDrLpLlKzDqIgKRk30OdU3UHI3tmGCRnSbZTbvj 78LzFyOv5dfGTbdfwOz7rDvd9  Fr IX8S3E8F2mOKRetYysRXYQnXe5ql  evtrBnpfukOI6S mUpIFd6B 9Vx80p0lBAvXzf3 A9pNXn5W4kBP4i8XJD2RRBrWi0cEdsfBoyTXWb6 ujvwgFziNNjE9   24jlQjwWfho RVl4RpiTz58pSm51tAwx0hsT q7RjftqzNYnfpmEMJfuzcz2kdKMkl lbFdwm4X5CgJ3lGsN f9rBWG3ecJN wUv9ToH   END MAZE KEY",
    "ransom_notes/GlobeImposter_4035_READ_IT.html": "All your files have been encrypted! You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Decryption as guarantee Your documents, photos, databases and other important files have been\nencrypted cryptographically strong, without the original key recovery is\nimpossible! To decrypt your files you need to buy the special software DECRYPTER Using another tools could corrupt your files, in case of using\nthird party software we dont give guarantees that full recovery is possible so\nuse it on your own risk. If you want to restore files, go to on our site: 1\nDownload TORBrowser https: www.torproject.org download download 2 Run it\n3 Go to http: cr7icbfqm64hixta.onion How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Wait from us for reply to your mail within 48 hours. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam. Your personal ID 09 DB 9F 21 83 E4 79 3B F4 7A 47 13 46 37 00 28 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 .. 00 .. 00 .. 00 .. 00 00 00 00 00 00 00 00 00 00 ..",
    "ransom_notes/Cerber_2016-05-05_# DECRYPT_MY_FILES #.html": "Cannot you find the files you need? Is the content of the files that you looked for not readable? It is normal because the files' names, as well as the data in your files have\nbeen encrypted. Great!!! You have turned to be a part of a big community CerberRansomware. If you are reading this message it means the software Cerber Ransomware has\nbeen removed from your computer. What is encryption? Encryption is a reversible modification of information for security reasons\nbut providing full access to it for authorized users. To become an authorized user and keep the modification absolutely reversible\nin other words to have a possibility to decrypt your files you should have\nan individual private key. But not only it. It is required also to have the special decryption software in your case\nCerber Decryptor software for safe and complete decryption of all your\nfiles and data. Everything is clear for me but what should I do? The first step is reading these instructions to the end. Your files have been encrypted with the Cerber Ransomware software; the\ninstructions DECRYPT MY FILES .html and DECRYPT MY FILES .txt in\nthe folders with your encrypted files are not viruses, they will help you. After reading this text the most part of people start searching in the\nInternet the words the Cerber Ransomware where they find a lot of ideas,\nrecommendations and instructions. It is necessary to realize that we are the ones who closed the lock on your\nfiles and we are the only ones who have this secret key to open them. Any attempts to get back your files with the thirdparty tools can be fatal\nfor your encrypted files. The most part of the thirdparty software change data within the encrypted\nfile to restore it but this causes damage to the files. Finally it will be impossible to decrypt your files. When you make a puzzle but some items are lost, broken or not put in its place the puzzle items will never match, the same way the thirdparty software\nwill ruin your files completely and irreversibly. You should realize that any intervention of the thirdparty software to\nrestore files encrypted with the Cerber Ransomware software may be fatal for\nyour files. There are several plain steps to restore your files but if you do not follow\nthem we will not be able to help you, and we will not try since you have read\nthis warning already. For your information the software to decrypt your files as well as the\nprivate key provided together are paid products. After purchase of the software package you will be able to: 1. decrypt all your files; 2. work with your documents; 3. view your photos and other media; 4. continue your usual and comfortable work at the computer. If you understand all importance of the situation then we propose to you to go\ndirectly to your personal page where you will receive the complete\ninstructions and guarantees to restore your files. There is a list of temporary addresses to go on your personal page below: 1. http: decrypttozxybarc.dconnect.eu removed 2. http: decrypttozxybarc.tor2web.org removed 3. http: decrypttozxybarc.onion.cab removed 4. http: decrypttozxybarc.onion.to removed 5. http: decrypttozxybarc.onion.link removed What should you do with these addresses? If you read the instructions in TXT format if you have instruction in HTML\nthe file with an icon of your Internet browser then the easiest way is to\nrun it: 1. take a look at the first address in this case it is http: decrypttozxybarc.dconnect.eu removed; 2. select it with the mouse cursor holding the left mouse button and moving the cursor to the right; 3. release the left mouse button and press the right one; 4. select Copy in the appeared menu; 5. run your Internet browser if you do not know what it is run the Internet Explorer; 6. move the mouse cursor to the address bar of the browser this is the place where the site address is written; 7. click the right mouse button in the field where the site address is written; 8. select the button Insert in the appeared menu; 9. then you will see the address http: decrypttozxybarc.dconnect.eu removed appeared there; 10. press ENTER; 11. the site should be loaded; if it is not loaded repeat the same instructions with the second address and continue until the last address if falling. If for some reason the site cannot be opened check the connection to the\nInternet; if the site still cannot be opened take a look at the instructions\non omitting the point about working with the addresses in the HTML\ninstructions. If you browse the instructions in HTML format: 1. click the left mouse button on the first address in this case it is http: decrypttozxybarc.dconnect.eu removed; 2. in a new tab or window of your web browser the site should be loaded; if it is not loaded repeat the same instructions with the second address and continue until the last address. If for some reason the site cannot be opened check the connection to the\nInternet. Unfortunately these sites are shortterm since the antivirus companies are\ninterested in you do not have a chance to restore your files but continue to\nbuy their products. Unlike them we are ready to help you always. If you need our help but the temporary sites are not available: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: decrypttozxybarc.onion removed in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or operation of Tor Browser,\nplease, visit https: www.youtube.com and type request in the search bar\ninstall tor browser windows and you will find a lot of training videos about\nTor Browser installation and operation. If TOR address is not available for a long period 23 days it means you are\nlate; usually you have about 23 weeks after reading the instructions to\nrestore your files. Additional information: You will find the instructions for restoring your files in those folders where\nyou have your encrypted files only. The instructions are made in two file formats HTML and TXT for your\nconvenience. Unfortunately antivirus companies cannot protect or restore your files but\nthey can make the situation worse removing the instructions how to restore\nyour encrypted files. The instructions are not viruses; they have informative nature only, so any\nclaims on the absence of any instruction files you can send to your antivirus\ncompany. Cerber Ransomware Project is not malicious and is not intended to harm a\nperson and his her information data. The project is created for the sole purpose of instruction regarding\ninformation security, as well as certification of antivirus software for their\nsuitability for data protection. Together we make the Internet a better and safer place. If you look through this text in the Internet and realize that something is\nwrong with your files but you do not have any instructions to restore your\nfiles, please, contact your antivirus support. Remember that the worst situation already happened and now it depends on your\ndetermination and speed of your actions the further life of your files.",
    "ransom_notes/Cerber_2017-03-15__READ_THIS_FILE_[]_.txt": "CERBER RANSOMWARE YOUR DOCUMENTS, PHOTOS, DATABASES AND OTHER IMPORTANT FILES HAVE BEEN ENCRYPTED! The only way to decrypt your files is to receive the private key and decryption program. To receive the private key and decryption program go to any decrypted folder, inside there is the special file READTHISFILE with complete instructions how to decrypt your files. If you cannot find any READTHISFILE file at your PC, follow the instructions below: 1. Download Tor Browser from https: www.torproject.org and install it. 2. In the Tor Browser open your personal page here: http: p27dokhpz2n7nvgr.onion 0123456789ABCDEF0123 Note! This page is available via Tor Browser only. Also you can use temporary addresses on your personal page without using Tor Browser. 1. http: p27dokhpz2n7nvgr.16bwhs.top 0123456789ABCDEF0123 2. http: p27dokhpz2n7nvgr.1apkjn.top 0123456789ABCDEF0123 3. http: p27dokhpz2n7nvgr.16qpet.top 0123456789ABCDEF0123 4. http: p27dokhpz2n7nvgr.1jhnvt.top 0123456789ABCDEF0123 5. http: p27dokhpz2n7nvgr.1dsdm4.top 0123456789ABCDEF0123 Note! These are temporary addresses! They will be available for a limited amount of time!",
    "ransom_notes/StopDjvu_litar__readme.txt": "ATTENTION! Don't worry, you can return all your files!\nAll your files like photos, databases, documents and other important are encrypted with strongest encryption and unique key.\nThe only method of recovering files is to purchase decrypt tool and unique key for you.\nThis software will decrypt all your encrypted files.\nWhat guarantees you have?\nYou can send one of your encrypted file from your PC and we decrypt it for free.\nBut we can decrypt only 1 file for free. File must not contain valuable information.\nYou can get and look video overview decrypt tool:\nhttps: we.tl t514KtsAKtH\nPrice of private key and decrypt software is 980.\nDiscount 50 available if you contact us first 72 hours, that's price for you is 490.\nPlease note that you'll never restore your data without payment.\nCheck your email Spam or Junk folder if you don't get answer more than 6 hours. To get this software you need write on our email:\ngorentos@bitmessage.ch Reserve email address to contact us:\nvarasto@firemail.cc Our Telegram account:\n@datarestore Your personal ID:",
    "ransom_notes/GandCrab_GandCrabV5_5.0.0_[]-DECRYPT.html": "html head style body background: 000082 norepeat; fontfamily:Consolas; color:\nrgb255, 255, 255; fontsize:25px; ul marginleft: 400px; textalign: left; p display:none; span display:none; style head body span99559 span div\naligncenterx000D;x000A;x002D;x002D;x002D;x003D;x0020;x0047;x0041;x004E;x0044;x0043;x0052;x0041;x0042;x0020;x0056;x0035;x002E;x0030;x0020;x003D;x002D;x002D;x002D;x0020;brx000D;x000A;brx000D;x000A;x0041;x0074;x0074;x0065;x006E;x0074;x0069;x006F;x006E;x0021;brx000D;x000A;x0054;x006F;x0075;x0073;x0020;x0076;x006F;x0073;x0020;x0066;x0069;x0063;x0068;x0069;x0065;x0072;x0073;x002C;x0020;x0064;x006F;x0063;x0075;x006D;x0065;x006E;x0074;x0073;x002C;x0020;x0070;x0068;x006F;x0074;x006F;x0073;x002C;x0020;x0062;x0061;x0073;x0065;x0073;x0020;x0064;x0065;x0020;x0064;x006F;x006E;x006E;x00E9;x0065;x0073;x0020;x0065;x0074;x0020;x0061;x0075;x0074;x0072;x0065;x0073;x0020;x0066;x0069;x0063;x0068;x0069;x0065;x0072;x0073;x0020;x0069;x006D;x0070;x006F;x0072;x0074;x0061;x006E;x0074;x0073;x0020;x0073;x006F;x006E;x0074;x0020;x0063;x0072;x0079;x0070;x0074;x00E9;x0073;x0020;x0065;x0074;x0020;x006F;x006E;x0074;x0020;x006C;x0027;x0065;x0078;x0074;x0065;x006E;x0073;x0069;x006F;x006E;x003A;x0020;x002E;x0047;x0041;x0043;x004D;x0057;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;brx000D;x000A;x004C;x0061;x0020;x0073;x0065;x0075;x006C;x0065;x0020;x0066;x0061;x00E7;x006F;x006E;x0020;x0064;x0065;x0020;x0072;x00E9;x0063;x0075;x0070;x00E9;x0072;x0065;x0072;x0020;x0064;x0065;x0073;x0020;x0066;x0069;x0063;x0068;x0069;x0065;x0072;x0073;x0020;x0065;x0073;x0074;x0020;x0064;x0027;x0061;x0063;x0071;x0075;x00E9;x0072;x0069;x0072;x0020;x0075;x006E;x0065;x0020;x0063;x006C;x00E9;x0020;x0070;x0072;x0069;x0076;x00E9;x0065;x0020;x0075;x006E;x0069;x0071;x0075;x0065;x002E;x0020;x0053;x0065;x0075;x006C;x0065;x006D;x0065;x006E;x0074;x0020;x006E;x006F;x0075;x0073;x0020;x0070;x006F;x0075;x0076;x006F;x006E;x0073;x0020;x0076;x006F;x0075;x0073;x0020;x0064;x006F;x006E;x006E;x0065;x0072;x0020;x0063;x0065;x0074;x0074;x0065;x0020;x0063;x006C;x00E9;x0020;x0065;x0074;x0020;x0073;x0065;x0075;x006C;x0065;x006D;x0065;x006E;x0074;x0020;x006E;x006F;x0075;x0073;x0020;x0070;x006F;x0075;x0076;x006F;x006E;x0073;x0020;x0072;x00E9;x0063;x0075;x0070;x00E9;x0072;x0065;x0072;x0020;x0076;x006F;x0073;x0020;x0066;x0069;x0063;x0068;x0069;x0065;x0072;x0073;x002E;brx000D;x000A;x004C;x0065;x0020;x0073;x0065;x0072;x0076;x0065;x0075;x0072;x0020;x0061;x0076;x0065;x0063;x0020;x0076;x006F;x0074;x0072;x0065;x0020;x0063;x006C;x00E9;x0020;x0065;x0073;x0074;x0020;x0064;x0061;x006E;x0073;x0020;x0075;x006E;x0065;x0020;x0070;x006F;x0072;x0074;x0065;x0020;x0072;x00E9;x0073;x0065;x0061;x0075;x0020;x0066;x0065;x0072;x006D;x00E9;x0065;x002E;x0020;x0056;x006F;x0075;x0073;x0020;x0070;x006F;x0075;x0076;x0065;x007A;x0020;x0076;x006F;x0075;x0073;x0020;x0079;x0020;x0072;x0065;x006E;x0064;x0072;x0065;x0020;x0064;x0065;x0073;x0020;x0066;x0061;x00E7;x006F;x006E;x0073;x0020;x0073;x0075;x0069;x0076;x0061;x006E;x0074;x0065;x0073;x003A;brx000D;x000A;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x0020;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;brx000D;x000A;ulx000D;x000A;lix0020;x0054;x00E9;x006C;x00E9;x0063;x0068;x0061;x0072;x0067;x0065;x007A;x0020;x006C;x0065;x0020;x006E;x0061;x0076;x0069;x0067;x0061;x0074;x0065;x0075;x0072;x0020;x0054;x006F;x0072;x0020;x002D;x0020;x0068;x0074;x0074;x0070;x0073;x003A;x002F;x002F;x0077;x0077;x0077;x002E;x0074;x006F;x0072;x0070;x0072;x006F;x006A;x0065;x0063;x0074;x002E;x006F;x0072;x0067;x002F; lix000D;x000A;lix0020;x0049;x006E;x0073;x0074;x0061;x006C;x006C;x0065;x007A;x0020;x006C;x0065;x0020;x006E;x0061;x0076;x0069;x0067;x0061;x0074;x0065;x0075;x0072;x0020;x0054;x006F;x0072; lix000D;x000A;lix0020;x004F;x0075;x0076;x0072;x0065;x007A;x0020;x006C;x0065;x0020;x006E;x0061;x0076;x0069;x0067;x0061;x0074;x0065;x0075;x0072;x0020;x0054;x006F;x0072; lix000D;x000A;lix0020;x004F;x0075;x0076;x0072;x0065;x007A;x0020;x006C;x0065;x0020;x006C;x0069;x0065;x006E;x0020;x0064;x0061;x006E;x0073;x0020;x006C;x0065;x0020;x006E;x0061;x0076;x0069;x0067;x0061;x0074;x0065;x0075;x0072;x0020;x0054;x004F;x0052;x003A;x0020;x0068;x0074;x0074;x0070;x003A;x002F;x002F;x0067;x0061;x006E;x0064;x0063;x0072;x0061;x0062;x006D;x0066;x0065;x0036;x006D;x006E;x0065;x0066;x002E;x006F;x006E;x0069;x006F;x006E;x002F;x0066;x0065;x0031;x0062;x0066;x0064;x0034;x0063;x0036;x0030;x0064;x0038;x0063;x0030;x0065;x0033;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020;x0020; lix000D;x000A;lix0020;x0053;x0075;x0069;x0076;x0065;x007A;x0020;x006C;x0065;x0073;x0020;x0069;x006E;x0073;x0074;x0072;x0075;x0063;x0074;x0069;x006F;x006E;x0073;x0020;x0073;x0075;x0072;x0020;x0063;x0065;x0074;x0074;x0065;x0020;x0070;x0061;x0067;x0065; lix000D;x000A; ulx000D;x000A;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x0020;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;x002D;brx000D;x000A;brx0020;x0020;x0020;x0020;x000D;x000A;x0053;x0075;x0072;x0020;x006E;x006F;x0074;x0072;x0065;x0020;x0070;x0061;x0067;x0065;x0020;x0076;x006F;x0075;x0073;x0020;x0076;x0065;x0072;x0072;x0065;x007A;x0020;x006C;x0065;x0073;x0020;x0069;x006E;x0073;x0074;x0072;x0075;x0063;x0074;x0069;x006F;x006E;x0073;x0020;x0064;x0065;x0020;x0070;x0061;x0069;x0065;x006D;x0065;x006E;x0074;x0020;x0065;x0074;x0020;x0076;x006F;x0075;x0073;x0020;x0061;x0075;x0072;x0065;x007A;x0020;x006C;x0027;x006F;x0070;x0070;x006F;x0072;x0074;x0075;x006E;x0069;x0074;x00E9;x0020;x0064;x0065;x0020;x0064;x00E9;x0063;x0068;x0069;x0066;x0066;x0072;x0065;x0072;x0020;x0031;x0020;x0066;x0069;x0063;x0068;x0069;x0065;x0072;x0020;x0067;x0072;x0061;x0074;x0075;x0069;x0074;x0065;x006D;x0065;x006E;x0074;x002E;brx000D;x000A;brx000D;x000A;x0041;x0054;x0054;x0045;x004E;x0054;x0049;x004F;x004E;x0021;brx000D;x000A;x0050;x004F;x0055;x0052;x0020;x00C9;x0056;x0049;x0054;x0045;x0052;x0020;x004C;x0045;x0053;x0020;x0044;x004F;x004D;x004D;x0041;x0047;x0045;x0053;x0020;x0041;x0055;x0058;x0020;x0044;x004F;x004E;x004E;x00C9;x0045;x0053;x003A;brx000D;x000A;brx000D;x000A;x002A;x0020;x004E;x0045;x0020;x0050;x0041;x0053;x0020;x004D;x004F;x0044;x0049;x0046;x0049;x0045;x0052;x0020;x004C;x0045;x0053;x0020;x0046;x0049;x0043;x0048;x0049;x0045;x0052;x0053;x0020;x0043;x0052;x0059;x0050;x0054;x00C9;x0053;brx000D;x000A;x002A;x0020;x004E;x0045;x0020;x0050;x0041;x0053;x0020;x004D;x004F;x0044;x0049;x0046;x0049;x0045;x0052;x0020;x004C;x0045;x0053;x0020;x0044;x004F;x004E;x004E;x00C9;x0045;x0053;x0020;x0043;x0049;x002D;x0044;x0045;x0053;x0053;x004F;x0055;x0053;brx000D;x000A;px002D;x002D;x002D;x0042;x0045;x0047;x0049;x004E;x0020;x0047;x0041;x004E;x0044;x0043;x0052;x0041;x0042;x0020;x004B;x0045;x0059;x002D;x002D;x002D;x000D;x000A;x006C;x0041;x0051;x0041;x0041;x0047;x0034;x0056;x006F;x0074;x0053;x0030;x006F;x0075;x004F;x006D;x0074;x0053;x0036;x0031;x002B;x0074;x0049;x0038;x004F;x0059;x004B;x0047;x0071;x006C;x0070;x0069;x0073;x005A;x0057;x0049;x006A;x0033;x0071;x006B;x006E;x0036;x006D;x007A;x002F;x0031;x0046;x004E;x0045;x0030;x004D;x0053;x007A;x0044;x0063;x002B;x0031;x007A;x0073;x0042;x0037;x0047;x004C;x0045;x006E;x006B;x0030;x0063;x0072;x0044;x0079;x0038;x0034;x0044;x006E;x0057;x0037;x007A;x0071;x0047;x0049;x0055;x0049;x0037;x004B;x0052;x0035;x0045;x006D;x0036;x004A;x0038;x002B;x004B;x004B;x0066;x004E;x0070;x004A;x002B;x0052;x0052;x006D;x007A;x004E;x006D;x0033;x0063;x0077;x0071;x0032;x005A;x0065;x0073;x006D;x0047;x0033;x0067;x006B;x0064;x0041;x0049;x0044;x0033;x004D;x0043;x0063;x006C;x0047;x0054;x0070;x0065;x0042;x0075;x004D;x0069;x0036;x0036;x004C;x002B;x0035;x0045;x0034;x0049;x0067;x0062;x0054;x0079;x0041;x0069;x0049;x004B;x0056;x0062;x0072;x0033;x007A;x0070;x0053;x0067;x0074;x0050;x0049;x0042;x0041;x0058;x0054;x006C;x004F;x0049;x0053;x0039;x004D;x0032;x006C;x004B;x0041;x0071;x0067;x0079;x002B;x006F;x0042;x0054;x0052;x006C;x0061;x002F;x0061;x0056;x002B;x0039;x0069;x006B;x006E;x0051;x0062;x0051;x0045;x002B;x0079;x006C;x005A;x0072;x006B;x0032;x0030;x0030;x006D;x0068;x0073;x0033;x0069;x0057;x0047;x0063;x0053;x0038;x0059;x007A;x0031;x0047;x0064;x0043;x0032;x0057;x0057;x0030;x0074;x0075;x0046;x0032;x0068;x0038;x0032;x004E;x0030;x0068;x0066;x0042;x0057;x0067;x006D;x0052;x0074;x0059;x0063;x0078;x002B;x0066;x0041;x0079;x0071;x004F;x0077;x0038;x006B;x004A;x0031;x0057;x0061;x0047;x0033;x002F;x0070;x0072;x0079;x0078;x0037;x0075;x0030;x0037;x004A;x0066;x0055;x0044;x0070;x0079;x0045;x006A;x0030;x0063;x0042;x0079;x0070;x0061;x0059;x006C;x006E;x006B;x0031;x0054;x0038;x006C;x0042;x0036;x0079;x0078;x0032;x0046;x0033;x006C;x0072;x006A;x004A;x004A;x0030;x0031;x0071;x005A;x002B;x0052;x0075;x0039;x0033;x0050;x0074;x0057;x004F;x0071;x005A;x005A;x0037;x0059;x0052;x0030;x004B;x0030;x0072;x0031;x0069;x0069;x0078;x0076;x006A;x0044;x0070;x0056;x0074;x0067;x0076;x0039;x0037;x0034;x0056;x0063;x004B;x004C;x0075;x007A;x002F;x0055;x004D;x004B;x004E;x004C;x0077;x0055;x006D;x0034;x0035;x005A;x0036;x007A;x005A;x0075;x004C;x004F;x0041;x0045;x0063;x0034;x0059;x0048;x0073;x0076;x0046;x0047;x0063;x002F;x006F;x0051;x0078;x004C;x005A;x0059;x006C;x0042;x0050;x0058;x0072;x0067;x0030;x004E;x0039;x004F;x0034;x005A;x002F;x004A;x0056;x0050;x0045;x006A;x006F;x0076;x0051;x0043;x0059;x0068;x0042;x0031;x0030;x0072;x0075;x006E;x002B;x0072;x0079;x0051;x006D;x0036;x0075;x0038;x0048;x0070;x0042;x0078;x0075;x0071;x0075;x0035;x006F;x0062;x0055;x0063;x0031;x0057;x0035;x0041;x006B;x004C;x0038;x0064;x0039;x0056;x006E;x0045;x0079;x0045;x0052;x0036;x006A;x0070;x0031;x0064;x002F;x0037;x0050;x0072;x004A;x0036;x0054;x006B;x0075;x0048;x0068;x0062;x006F;x0058;x0070;x0059;x0047;x0044;x004A;x0063;x002B;x0052;x0071;x0066;x0076;x0044;x0076;x007A;x004F;x0065;x0059;x0069;x006F;x0079;x0036;x0056;x0061;x0050;x0031;x005A;x007A;x0046;x002F;x0071;x0035;x0039;x0065;x0078;x0036;x0043;x004F;x0075;x0030;x0059;x0063;x0067;x0049;x0048;x0048;x0032;x0032;x0030;x0047;x006E;x004E;x0073;x0076;x0044;x004F;x002B;x0065;x0059;x006F;x006D;x0055;x0041;x0045;x0062;x006E;x0068;x0079;x0038;x0079;x0062;x006C;x007A;x0043;x0057;x0055;x004F;x004A;x007A;x006C;x0053;x0038;x0030;x0041;x0056;x006E;x0054;x0073;x0055;x0078;x0039;x0045;x0047;x0049;x0043;x006D;x0036;x0037;x0032;x004A;x0079;x0042;x0055;x0055;x004C;x0050;x0046;x0047;x0070;x0059;x0051;x0030;x0033;x0070;x0055;x002B;x0045;x004A;x0068;x0051;x006B;x0049;x004C;x004D;x0043;x0053;x0049;x004D;x0075;x007A;x0050;x0059;x004A;x004B;x004F;x0043;x0049;x0034;x002B;x004A;x0041;x0070;x0046;x002F;x0038;x0038;x0065;x0048;x0067;x0055;x0034;x0038;x006A;x0056;x0074;x0036;x0045;x006B;x0063;x004A;x0050;x007A;x0035;x0068;x006C;x0076;x004E;x0055;x0063;x0070;x0047;x0069;x0059;x0053;x0065;x0070;x0034;x0033;x005A;x004F;x004D;x0031;x0050;x0064;x0055;x0071;x0076;x0061;x006E;x007A;x006B;x0052;x0036;x0038;x0049;x0047;x0061;x0041;x0078;x006C;x004A;x0037;x0079;x004B;x006A;x0043;x0050;x0056;x0072;x004F;x0030;x006A;x004A;x0068;x004B;x0051;x0059;x0055;x0056;x006B;x0076;x004E;x0035;x0033;x004E;x0062;x0069;x0038;x004C;x0067;x004B;x004D;x0032;x0042;x0066;x0035;x004C;x006C;x004E;x004A;x004D;x0071;x0030;x0079;x006B;x006B;x0063;x0070;x002F;x004D;x004D;x0076;x006C;x0036;x006E;x0034;x004D;x0045;x0059;x0053;x006C;x0031;x0057;x002B;x0031;x0054;x0035;x004B;x007A;x004B;x0050;x0061;x006C;x005A;x0066;x0039;x0075;x0047;x0056;x004D;x0036;x0061;x0069;x0066;x0079;x0057;x0043;x0055;x0076;x0078;x0068;x006E;x0073;x002B;x0031;x006D;x0052;x0064;x0063;x0041;x0052;x004D;x0061;x006F;x0055;x0053;x0050;x0054;x0057;x006B;x0070;x0035;x0065;x0062;x0030;x0057;x0030;x0043;x0072;x004E;x0043;x002B;x0042;x0076;x0046;x0038;x0039;x006E;x004D;x0042;x006F;x0045;x0055;x0038;x0054;x0030;x0066;x004E;x0065;x0032;x0048;x0071;x0078;x0049;x0041;x0050;x004D;x0078;x0063;x006C;x004E;x004D;x0038;x005A;x0044;x0043;x006A;x006A;x0038;x0036;x0033;x004E;x0042;x0061;x0042;x0072;x0053;x0053;x0064;x007A;x006D;x0052;x0047;x0073;x006F;x006C;x0030;x0054;x0045;x006C;x0049;x004A;x0031;x0045;x0056;x0059;x0067;x0038;x0031;x006B;x0071;x0042;x0053;x007A;x0055;x0049;x0046;x0057;x0045;x0053;x0061;x0036;x0053;x0036;x0057;x0038;x0034;x0058;x0045;x0052;x006D;x0032;x0033;x006B;x0069;x0061;x0051;x0071;x0075;x0056;x0037;x006D;x0038;x006D;x0050;x0033;x0078;x0078;x004B;x0037;x006B;x006E;x0068;x0058;x006B;x004C;x0036;x002F;x0079;x0065;x004B;x004D;x002F;x0079;x0039;x0046;x004E;x0066;x0059;x0067;x0041;x005A;x0046;x0045;x0056;x0035;x0043;x0045;x0069;x0041;x0077;x004B;x002F;x0066;x0037;x0056;x0041;x0067;x0066;x0051;x0071;x006F;x0053;x002B;x004C;x0052;x0061;x0056;x005A;x004C;x0050;x0061;x0036;x0058;x0034;x0043;x007A;x0064;x0033;x004C;x0070;x0055;x006C;x0070;x002F;x004E;x0076;x002F;x006C;x0059;x0030;x002F;x0075;x0076;x006B;x0037;x0044;x0064;x0070;x0061;x005A;x004B;x0052;x0079;x0038;x004A;x0036;x0058;x0064;x0063;x006E;x006D;x006E;x006B;x0064;x0043;x0031;x0063;x0063;x0056;x0053;x0078;x006E;x0056;x004D;x006E;x0037;x0052;x0065;x004F;x0074;x0037;x0076;x0050;x0073;x0053;x0075;x0030;x0030;x0046;x005A;x004A;x002B;x0046;x006B;x0054;x0065;x004A;x0061;x0079;x0052;x0041;x0058;x0050;x0053;x0050;x0064;x0068;x0045;x004A;x0063;x0073;x006D;x0043;x0066;x0033;x0062;x0079;x0059;x0043;x0030;x0031;x0063;x004E;x006C;x0068;x006A;x0038;x004F;x0065;x0071;x0074;x0076;x0070;x0037;x0071;x0039;x0056;x0053;x0030;x0070;x006E;x0052;x0049;x0073;x0052;x0059;x0034;x004D;x007A;x0031;x0043;x0042;x0046;x0073;x0052;x007A;x005A;x0038;x0070;x0046;x0067;x007A;x0077;x0061;x0053;x006F;x0067;x0073;x006C;x0037;x0046;x0057;x0035;x0033;x0037;x006E;x006A;x0069;x0039;x0059;x0037;x005A;x0076;x0057;x004E;x0030;x004D;x0055;x0035;x006D;x0058;x0044;x0034;x0070;x0050;x0050;x006A;x007A;x0078;x0045;x0035;x004A;x0074;x0068;x0041;x0062;x0033;x004E;x0052;x0055;x0070;x007A;x0050;x0079;x006B;x004B;x004F;x0073;x0033;x0074;x0053;x0052;x004B;x0079;x006C;x006D;x0077;x0032;x002B;x0071;x0035;x0050;x004D;x0066;x004C;x0054;x0072;x004E;x0069;x0044;x0061;x004E;x0048;x0044;x0038;x0050;x0030;x0043;x0033;x0064;x0051;x006B;x0056;x0049;x0069;x0047;x0042;x0033;x006A;x0048;x0032;x0046;x007A;x0072;x0032;x004A;x0073;x0071;x0037;x006E;x0048;x0052;x0061;x0042;x005A;x0032;x0049;x0065;x0062;x0042;x0077;x0066;x0065;x0052;x0063;x0075;x006F;x0079;x0076;x005A;x0070;x0036;x0066;x002B;x0030;x002F;x0076;x0075;x0073;x0055;x0063;x0073;x0048;x0079;x0061;x0072;x0048;x0074;x0078;x004C;x0076;x0043;x0053;x0063;x006B;x006A;x0072;x0034;x0070;x0051;x0057;x0063;x0063;x006F;x0042;x004B;x0042;x004F;x004B;x006E;x007A;x006C;x0062;x004E;x0055;x004C;x007A;x0053;x0037;x004F;x0062;x0049;x004F;x0063;x0037;x006D;x0067;x0061;x007A;x0045;x0070;x0063;x0037;x0076;x0054;x004F;x0051;x0066;x006D;x0064;x0068;x0034;x0038;x0076;x0064;x007A;x004C;x004B;x006B;x0063;x0079;x0047;x0050;x004C;x0047;x0053;x0032;x0030;x0069;x006C;x006C;x0034;x0049;x005A;x0058;x0068;x0043;x0043;x0071;x0050;x0031;x0078;x0052;x0058;x0038;x0068;x0035;x0051;x0063;x006A;x0047;x006E;x006E;x0046;x004B;x0059;x007A;x0030;x0070;x0074;x005A;x0070;x004E;x0049;x0077;x006C;x006C;x0065;x0037;x0074;x0031;x0034;x006C;x002F;x0034;x0032;x002B;x0066;x0071;x007A;x0074;x004C;x0043;x0042;x0043;x0032;x0067;x0059;x0056;x0079;x0038;x004D;x0052;x0056;x006E;x0041;x0071;x0056;x0053;x0052;x0065;x0054;x004E;x0042;x007A;x0076;x0050;x004B;x004F;x0038;x006C;x0046;x0048;x0065;x0049;x0030;x0037;x0039;x0066;x002B;x0079;x0073;x0047;x0049;x0050;x0053;x0034;x006E;x0055;x0066;x006A;x0079;x0073;x004B;x0039;x0061;x0066;x0077;x0076;x0069;x0065;x007A;x0056;x0056;x0042;x0031;x0036;x0067;x006F;x004A;x0066;x0044;x0073;x0043;x0037;x0061;x0063;x0067;x0054;x0053;x006F;x0061;x0069;x004A;x0030;x0041;x0049;x0063;x0079;x005A;x0043;x0069;x002F;x002B;x0053;x0061;x0078;x0053;x0053;x006A;x0054;x006D;x006B;x0067;x0035;x0079;x0079;x0031;x006B;x004D;x0041;x007A;x006F;x0057;x006A;x0070;x0030;x0053;x0063;x004D;x0047;x0034;x0075;x0067;x0063;x006D;x006B;x002F;x0043;x0073;x0054;x0043;x0036;x0042;x004F;x0046;x0077;x0039;x0034;x0046;x0032;x004F;x004E;x0078;x0054;x004A;x0037;x0032;x0057;x0034;x0061;x004B;x0078;x0078;x0069;x0053;x0069;x0067;x0046;x0070;x006E;x002F;x0076;x0077;x0032;x0074;x0058;x0067;x0073;x0044;x0052;x0052;x0059;x002F;x0055;x0030;x0056;x0075;x0054;x0038;x0064;x002F;x0057;x004E;x0067;x0067;x0038;x0048;x0043;x007A;x0042;x0076;x004C;x0034;x006C;x006A;x0061;x0057;x0053;x0046;x004C;x007A;x0063;x0065;x0032;x004A;x0037;x0066;x0071;x006A;x006D;x0057;x0062;x004F;x0057;x004B;x0057;x0051;x0059;x0074;x0048;x0031;x007A;x005A;x002B;x0075;x006C;x0066;x0036;x002F;x0064;x0046;x0058;x0073;x005A;x0036;x0067;x0031;x004F;x0033;x005A;x0065;x005A;x0041;x0064;x0056;x0054;x0073;x004E;x0072;x0034;x0070;x0063;x0061;x0074;x0070;x0037;x0062;x0065;x0067;x006A;x0068;x0041;x007A;x004C;x0045;x0061;x0031;x002F;x0035;x006F;x0077;x0049;x0070;x004D;x004D;x0031;x0064;x0048;x0053;x002F;x0046;x0066;x0053;x0067;x0057;x0077;x0075;x0071;x0047;x0072;x0032;x0042;x007A;x0061;x0046;x007A;x004A;x005A;x0033;x0067;x0059;x0068;x004C;x0067;x0077;x0079;x0055;x0055;x0053;x0052;x004F;x0078;x004E;x0071;x0042;x004F;x006D;x0035;x0031;x0039;x0075;x0070;x004B;x0042;x0035;x0041;x0070;x0031;x0043;x0036;x0061;x0038;x0036;x0057;x0072;x006E;x0039;x0061;x0073;x0038;x0039;x006A;x0066;x005A;x004C;x0035;x0037;x004C;x0033;x0043;x0073;x0049;x004B;x0054;x0053;x0051;x004C;x006B;x0056;x0032;x004E;x0049;x0034;x0045;x0038;x0032;x0045;x0039;x004E;x0075;x0058;x006F;x0074;x0059;x0041;x004A;x005A;x0070;x004A;x0053;x0031;x004C;x0073;x0042;x0052;x0046;x004C;x0039;x0053;x0053;x0054;x006E;x0057;x006D;x0035;x004D;x0062;x0068;x006B;x005A;x004A;x0056;x0049;x0073;x0061;x0049;x0030;x0032;x0030;x0077;x0061;x0053;x0057;x0033;x0057;x0049;x0049;x0044;x004B;x0055;x0039;x004C;x0034;x002B;x0061;x002F;x007A;x0046;x0073;x004F;x0032;x0031;x007A;x0070;x006D;x0059;x0076;x0077;x0076;x0042;x0035;x0031;x002F;x0031;x0059;x0034;x0032;x0042;x0054;x0044;x0033;x0070;x006B;x0079;x006F;x0074;x0033;x0071;x0063;x0071;x006C;x0053;x0063;x0030;x004D;x0059;x006F;x0047;x0055;x0031;x0062;x0072;x0068;x0045;x006C;x0072;x0068;x0064;x0051;x0071;x0059;x0056;x0079;x0039;x0075;x004B;x004C;x0041;x0064;x0057;x004A;x004B;x0058;x0038;x0062;x0064;x0076;x0031;x0068;x0046;x006F;x006E;x006F;x0058;x0032;x0037;x0054;x0070;x0071;x0050;x0047;x0072;x006B;x004B;x0032;x006B;x006F;x0062;x006E;x0050;x0069;x0031;x0039;x0038;x0061;x004B;x0061;x007A;x007A;x0073;x0069;x0049;x004F;x0042;x004F;x004B;x0041;x0073;x004F;x0037;x002F;x0036;x004B;x0067;x0067;x004C;x0030;x006D;x004C;x0033;x0064;x0045;x0042;x0078;x004D;x007A;x0035;x004C;x0043;x0031;x0043;x0052;x0059;x0038;x004B;x004D;x0049;x004D;x0069;x006C;x006A;x006E;x0047;x0075;x0033;x0047;x0030;x0039;x0052;x0079;x006A;x006A;x004C;x0043;x006D;x0038;x006E;x0054;x0032;x002F;x006D;x0043;x0070;x0073;x0064;x0069;x0078;x0034;x0037;x0061;x004A;x0056;x0072;x0035;x0047;x002F;x0071;x0046;x0032;x0063;x0078;x0051;x0036;x0045;x0076;x0073;x0076;x006E;x0061;x0051;x004A;x006C;x0042;x0061;x0050;x0075;x006E;x0044;x0051;x0058;x0079;x0043;x004E;x006A;x004B;x0049;x0061;x0067;x005A;x005A;x006B;x0070;x0069;x0055;x004A;x0072;x0041;x0062;x0067;x006F;x0076;x0047;x0063;x0053;x0077;x0067;x004F;x006C;x006F;x0043;x0030;x0032;x0074;x0054;x0044;x0066;x002B;x0031;x0042;x0041;x0058;x0071;x004D;x0056;x0070;x0076;x0079;x0033;x0045;x0068;x002F;x004A;x004B;x0066;x0058;x0049;x0055;x005A;x0055;x0076;x0074;x0051;x0039;x0070;x0041;x0070;x004B;x004D;x007A;x0078;x004C;x0043;x0074;x0065;x0048;x0059;x0076;x004D;x002B;x0073;x0073;x0031;x002F;x0032;x0079;x0075;x0051;x0038;x0033;x004B;x0068;x0072;x0069;x0072;x0043;x0038;x0065;x0038;x0072;x0038;x002F;x0045;x0072;x0054;x0055;x0066;x0032;x0055;x0062;x002B;x0032;x0043;x006E;x006E;x0071;x0076;x006F;x0050;x0077;x0043;x007A;x0050;x004D;x0058;x0036;x0073;x0056;x006A;x0074;x0076;x0072;x0033;x006D;x0052;x0042;x0074;x004E;x0065;x0069;x0079;x0033;x0046;x0045;x0049;x0049;x0038;x0057;x0078;x0049;x004F;x0032;x0075;x0063;x006E;x0057;x0053;x0079;x0071;x0037;x0045;x004E;x002B;x0052;x0035;x0037;x0044;x0058;x0030;x0049;x0042;x0038;x004E;x0078;x0039;x006C;x0048;x0039;x0049;x0037;x0050;x0078;x0071;x0061;x0039;x0055;x0074;x0048;x0041;x0043;x0079;x0043;x0057;x0038;x0070;x002F;x0071;x004C;x0052;x0044;x004F;x004B;x0038;x0065;x0057;x006D;x007A;x0076;x0054;x0037;x0050;x0070;x0073;x0039;x0037;x002F;x0075;x0068;x0051;x004B;x0037;x0050;x0035;x0045;x006C;x0044;x0059;x006A;x0050;x0039;x0078;x0062;x0036;x0057;x0059;x0032;x0041;x0033;x006E;x0039;x0077;x0048;x0067;x0049;x0075;x0048;x0063;x0052;x005A;x0062;x0047;x006D;x006B;x004A;x0031;x0068;x0055;x002B;x0031;x0053;x0034;x003D;x000D;x000A;x002D;x002D;x002D;x0045;x004E;x0044;x0020;x0047;x0041;x004E;x0044;x0043;x0052;x0041;x0042;x0020;x004B;x0045;x0059;x002D;x002D;x002D;x000D;x000A;x000D;x000A;x002D;x002D;x002D;x0042;x0045;x0047;x0049;x004E;x0020;x0050;x0043;x0020;x0044;x0041;x0054;x0041;x002D;x002D;x002D;x000D;x000A;x0077;x0066;x004B;x0044;x0036;x0069;x0075;x0064;x0075;x006D;x0042;x006B;x006D;x0070;x004C;x0038;x0049;x0052;x0072;x0034;x0055;x0034;x0075;x0078;x0044;x0046;x0061;x0056;x004F;x0058;x006A;x0074;x0069;x0044;x0078;x0077;x004F;x0071;x0066;x0031;x0039;x0031;x0059;x006E;x0076;x004F;x0065;x0057;x0050;x0078;x0035;x004F;x0059;x0066;x0078;x0064;x007A;x005A;x005A;x004F;x0054;x006F;x0064;x0052;x0076;x0058;x005A;x0079;x0037;x006D;x0068;x0057;x0070;x0072;x0065;x007A;x0054;x0046;x0047;x0048;x0077;x0078;x0035;x0046;x0042;x004A;x006A;x007A;x006E;x0074;x004D;x004B;x0037;x0037;x0072;x0036;x0054;x0055;x0048;x0061;x0044;x0042;x0037;x0069;x0049;x0070;x004A;x0044;x0038;x002F;x0062;x0046;x0041;x0076;x002F;x0039;x006D;x0047;x0047;x006F;x0042;x0070;x0041;x005A;x004C;x0076;x0036;x006A;x0078;x002F;x0078;x0059;x0032;x0057;x0058;x0078;x0050;x0035;x004B;x0041;x0069;x0071;x0043;x0068;x0053;x0045;x0054;x006B;x0041;x0072;x006B;x0041;x0069;x0062;x0059;x0047;x004F;x004D;x0043;x0058;x0030;x0072;x006D;x0053;x0062;x0055;x0041;x006B;x0061;x0058;x0051;x0049;x0062;x0059;x004F;x0057;x0072;x0073;x0043;x0033;x0059;x005A;x0074;x0059;x0046;x0036;x0054;x0052;x0078;x006F;x0045;x0070;x0047;x0059;x0034;x002B;x0032;x002B;x0032;x0041;x0053;x0056;x004B;x0032;x005A;x0042;x0046;x0056;x0037;x0067;x0050;x005A;x0075;x0052;x0050;x0063;x0044;x0043;x004A;x002F;x0032;x0050;x0079;x004D;x004C;x006B;x004F;x0030;x004D;x004C;x0045;x0050;x0078;x0049;x006F;x0064;x004C;x0041;x006D;x0054;x0053;x0035;x0078;x0030;x006D;x0074;x0073;x006F;x0054;x0058;x005A;x006F;x0050;x002F;x0063;x002F;x0065;x002F;x0072;x0043;x0031;x0074;x0052;x007A;x006A;x0054;x0062;x006D;x006A;x0059;x006C;x0041;x0047;x0033;x0067;x0038;x006C;x0036;x0035;x006E;x0056;x0064;x0030;x002F;x0043;x0042;x0055;x0078;x004B;x0051;x0037;x004B;x0044;x004A;x0059;x0072;x0074;x0058;x0030;x0076;x0053;x006D;x006E;x0046;x0058;x0067;x002F;x0079;x006B;x0066;x0067;x0074;x004A;x004E;x0069;x0077;x0071;x0066;x0043;x006E;x0071;x0062;x0072;x0038;x0035;x002B;x0042;x0069;x0074;x0062;x0045;x006E;x006B;x0055;x006E;x0042;x0073;x0075;x004C;x0079;x002F;x007A;x0049;x0032;x0046;x0065;x0074;x0031;x0047;x0074;x0031;x0059;x0062;x0046;x0072;x0058;x0042;x0069;x002F;x0074;x002F;x0068;x0048;x0057;x0045;x0059;x0077;x0062;x006F;x0069;x0063;x0045;x0034;x006F;x0047;x0034;x0062;x0036;x0061;x0031;x0059;x0038;x005A;x0079;x0047;x006F;x0079;x0070;x0032;x0051;x0032;x0069;x0075;x004A;x0052;x007A;x0054;x0052;x006F;x0071;x0047;x006C;x0050;x0051;x004A;x0049;x0041;x004A;x0070;x005A;x0046;x0076;x0077;x004E;x0045;x006F;x0041;x0068;x0050;x004E;x006E;x004B;x0063;x002B;x0044;x004F;x0035;x0059;x0041;x004C;x0071;x0066;x006A;x0032;x0045;x0070;x0067;x0036;x0031;x0072;x004B;x0041;x0033;x0068;x0078;x0041;x0035;x004B;x0078;x0067;x0037;x0032;x005A;x0069;x002F;x0070;x0041;x0052;x0046;x004D;x0033;x0076;x0050;x004C;x004D;x0065;x0061;x0031;x0031;x0033;x004D;x005A;x004F;x0033;x0052;x0030;x0052;x0069;x0043;x004B;x0041;x0054;x006D;x0075;x0031;x006A;x0058;x0067;x0041;x0058;x0039;x0069;x006D;x0055;x006A;x0066;x006A;x0069;x0079;x0072;x0051;x0052;x0031;x006E;x006B;x004C;x0049;x006E;x006C;x0073;x0061;x0077;x002F;x0058;x004A;x004E;x0056;x0063;x0076;x0070;x004C;x006A;x0065;x0062;x0066;x0045;x0030;x0063;x004B;x004D;x0042;x0075;x0050;x0033;x004E;x004E;x0068;x0033;x0039;x0066;x0051;x0032;x0066;x0043;x006E;x0061;x0059;x0058;x0045;x0071;x0048;x0074;x0062;x0030;x006A;x0078;x0042;x0064;x005A;x004D;x004D;x0035;x0048;x0034;x0048;x0070;x0038;x004F;x0059;x0072;x002F;x004F;x0052;x0063;x0038;x0050;x0039;x0059;x006B;x0074;x0056;x002B;x0066;x0075;x0076;x0037;x004F;x0058;x007A;x004A;x006A;x0039;x004E;x0058;x005A;x0057;x0068;x0035;x0038;x007A;x0074;x002B;x0077;x0055;x0052;x0051;x003D;x003D;x000D;x000A;x002D;x002D;x002D;x0045;x004E;x0044;x0020;x0050;x0043;x0020;x0044;x0041;x0054;x0041;x002D;x002D;x002D; px000D;x000A; div body html",
    "ransom_notes/Dharma_bip_Info.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email peekabooo@qq.com Write this ID in the title of your message 3AF0FA8F In case of no answer in 24 hours write us to theese emails:peekabooo@qq.com You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 file for free decryption. The total size\nof files must be less than 1Mb non archived, and files should not contain\nvaluable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/scarab_2017-11-23_IF YOU WANT TO GET ALL YOUR FILES BACK, PLEASE READ THIS.txt": "IF YOU WANT TO GET ALL YOUR FILES BACK, PLEASE READ THIS Your files are now encrypted! BEGIN PERSONAL IDENTIFIER\npersonal identifier removed removed\nEND PERSONAL IDENTIFIER All your files have been encrypted due to a security problem with your PC. Now you should send us email with your personal identifier.\nThis email will be as confirmation you are ready to pay for decryption key.\nYou have to pay for decryption in Bitcoins. The price depends on how fast you write to us.\nAfter payment we will send you the decryption tool that will decrypt all your files. Contact us using this email address: suupport@protonmail.com\nIf you don't get a reply or if the email dies, then contact us using Bitmessage.\nDownload it form here: https: bitmessage.org wiki MainPage\nRun it, click New Identity and then send us a message at  Free decryption as guarantee!\nBefore paying you can send us up to 3 files for free decryption.\nThe total size of files must be less than 10Mb non archived, and files should not contain\nvaluable information databases, backups, large excel sheets, etc.. How to obtain Bitcoins? The easiest way to buy bitcoins is LocalBitcoins site. You have to register, click 'Buy bitcoins', and select the seller by payment method and price: https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/GlobImposter2.0_how_to_back_files.html": "Your personal ID English Your files are encrypted! All your important data has been encrypted. To recover data you need decryptor. To get the decryptor you should: Send 1 test image or text file dresdent@protonmail.com. In the letter include\nyour personal ID look at the beginning of this document. We will give you the decrypted file and assign the price for decryption all\nfiles After we send you instruction how to pay for decrypt and after payment you\nwill receive a decryptor and instructions We can decrypt one file in quality\nthe evidence that we have the decoder. Attention! Only dresdent@protonmail.com can decrypt your files Do not trust anyone dresdent@protonmail.com Do not attempt to remove the program or run the antivirus tools Attempts to selfdecrypting files will result in the loss of your data Decoders other users are not compatible with your data, because each user's unique encryption key",
    "ransom_notes/Nordfox_READ_ME.legacy": "All your important files are encrypted. To recover encrypted files, you need: 1. Buy bitcoins. The easiest way to buy bitcoins is the LocalBitcoins site. You must register, click Buy Bitcoins and select a seller by payment method and price. https: localbitcoins.com buybitcoins You can also find other places to buy bitcoins and a beginner s guide here: http: www.coindesk.com information howcanibuybitcoins write to google how to buy bitcoin in your country? to guarantee the availability of our key we can decrypt three files for free. 2. Send bitcoins to the address you receive in the mail. After payment, we will send a decryption program Do not try to decrypt your files using thirdparty programs, decoders. You only damage your data and lose them forever. Only we can decrypt your data! Contact email address nordfox@tutanota.com nordfox@protonmail.com nordfox@aol.com",
    "ransom_notes/GandCrab_GandCrabV1_[]-DECRYPT.txt": "GANDCRAB Attention!\nAll your files documents, photos, databases and other important files are encrypted and have the extension: .GDCB The only method of recovering files is to purchase a private key. It is on our server and only we can recover your files.\nThe server with your key is in a closed network TOR. You can get there by the following ways:\n1. Download Tor browser https: www.torproject.org 2. Install Tor browser\n3. Open Tor Browser\n4. Open link in tor browser: http: gdcbghvjyqy7jclk.onion fe1bfd4c60d8c0e3 5. Follow the instructions on this page If Tor Tor browser is locked in your country or you can not install it, open one of the following links in your regular browser:\n1. http: gdcbghvjyqy7jclk.onion.top fe1bfd4c60d8c0e3 2. http: gdcbghvjyqy7jclk.onion.casa fe1bfd4c60d8c0e3 3. http: gdcbghvjyqy7jclk.onion.guide fe1bfd4c60d8c0e3 4. http: gdcbghvjyqy7jclk.onion.rip fe1bfd4c60d8c0e3 5. http: gdcbghvjyqy7jclk.onion.plus fe1bfd4c60d8c0e3 On our page you will see instructions on payment and get the opportunity to decrypt 1 file for free. DANGEROUS!\nDo not try to modify files or use your own private key this will result in the loss of your data forever!",
    "ransom_notes/BTCWare_Wyvern_HELP.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email decryptorx@cock.li You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 3 files for free decryption. The total\nsize of files must be less than 1Mb non archived, and files should not\ncontain valuable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Dharma_monro_Info.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email icrypt@cock.li Write this ID in the title of your message 3AF0FA8F In case of no answer in 24 hours write us to theese emails:icrypt@cock.li You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 file for free decryption. The total size\nof files must be less than 1Mb non archived, and files should not contain\nvaluable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Dharma_brrr_Info.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email paydecryption@qq.com Write this ID in the title of your message 3AF0FA8F In case of no answer in 24 hours write us to theese\nemails:paydecryption@qq.com You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 file for free decryption. The total size\nof files must be less than 1Mb non archived, and files should not contain\nvaluable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/GandCrab_GandCrabV5_5.0.2_[]-DECRYPT.txt": "GANDCRAB V5.0.2 Attention! All your files, documents, photos, databases and other important files are encrypted and have the extension: .GACMW The only method of recovering files is to purchase an unique private key. Only we can give you this key and only we can recover your files. The server with your key is in a closed network TOR. You can get there by the following ways: 0. Download Tor browser https: www.torproject.org 1. Install Tor browser 2. Open Tor Browser 3. Open link in TOR browser: http: gandcrabmfe6mnef.onion fe1bfd4c60d8c0e3 4. Follow the instructions on this page On our page you will see instructions on payment and get the opportunity to decrypt 1 file for free. ATTENTION! IN ORDER TO PREVENT DATA DAMAGE: DO NOT MODIFY ENCRYPTED FILES DO NOT CHANGE DATA BELOW BEGIN GANDCRAB KEY     UMKNLwUm45Z6zZuLOAEc4YHsvFGc oQxLZYlBPXrg0N9O4Z      yeKM y9FNfYgAZFEV5CEiAwK f7VAgfQqoSLRaVZLPa6X4Czd3LpUlp Nv lY0    SaxSSjTmkg5yy1kMAzoWjp0ScMG4ugcmk CsTC6BOFw94F2ONxTJ72W4aKxxiSigFpn vw2tXgsDRRY U0VuT8d  dFXsZ6g1O3ZeZAdVTsNr4pcatp7begjhAzLEa1 5owIpMM1dHS  zFsO21zpmYvwvB51   mCpsdix47aJVr5G  JKfXIUZUvtQ9pApKMzxLCteHYvMss1 2yuQ83KhrirC8e8r8  qLRDOK8eWmzvT7Pps97  END GANDCRAB KEY BEGIN PC DATA  bFAv 9mGGoBpAZLv6jx  2PyMLkO0MLEPxIodLAmTS5x0mtsoTXZoP c e rC1tRzjTbmjYlAG3g8l65nVd0 CBUxKQ7KDJYrtX0vSmnFXg ykfgtJNiwqfCnqbr85BitbEnkUnBsuLy zI2Fet1Gt1YbFrXBi t    QRdsPsokvV DuorORzJn9ZnYIh50zuuwURaFt END PC DATA",
    "ransom_notes/ransomwhere_notes_1646092022706ransom.txt": "Hello, Pristine Competitions.\nYour website, and all of your customer data has been copied and deleted.\nWe have found some interesting practices with regards to how you operate, such as:\nFake entries, fake winners and not storing user data securely. To restore access, and prevent this data being released to everyone, a payment is required.\nA payment of 25,000 in Bitcoin is to be made to the following address:\n\nIn order to contact us, feel free to email:\npristine@dnmx.org\nAs a little proof, here is some select data from your server. memid,memname,memlname,mobile no,email id,password,addresslinel,addressline2,city,state,country,postcode,updateddate,addeddate,created: 44463,Hu,5ta,01796,hSi@OOk.Com,mSF,6 lel Ve Ston ,,Pes ,r s ,United Kingdom,r g",
    "ransom_notes/Cryptfile2_HELP_DECRYPT_YOUR_FILES.txt": "NOT YOUR LANGUAGE? USE https: translate.google.com What happened to your files ? All of your files protected by a strong encryption with RSA2048. More information about the encryption keys using RSA2048 can be found here: https: en.wikipedia.org wiki RSAcryptosystem How did this happen ? !!! Specially for your PC was generated personal RSA2048 KEY, both public and private. !!! ALL YOUR FILES were encrypted with the public key, which has been transferred to your computer via the Internet. !!! Decrypting of your files is only possible with the help of the private key and decrypt program , which is on our Secret Server What do I do ? So, there are two ways you can choose: wait for a miracle and get your price doubled, or start send email now for more specific instructions! , and restore your data easy way. If You have really valuable data, you better not waste your time, because there is no other way to get your files, except make a payment. For more specific instructions: Contact us by email only, send us an email along with your ID number and wait for further instructions. Our specialist will contact you within 24 hours. For you to be sure, that we can decrypt your files you can send us a single encrypted file and we will send you back it in a decrypted form. This will be your guarantee. Please do not waste your time! You have 72 hours only! After that The Main Server will double your price! So right now You have a chance to buy your individual private SoftWare with a low price! EMAIL1: rscl@dr.com EMAIL2: rscl@usa.com YOURID:",
    "ransom_notes/BTCWare_Gryphon_!## DECRYPT FILES ##!.txt": "GRYPHON RANSOMWARE Your documents, photos, databases and other important files have been encrypted\ncryptographically strong, without the original key recovery is impossible!\nTo decrypt your files you need to buy the special software GRYPHON DECRYPTER\nUsing another tools could corrupt your files, in case of using third party software we dont give guarantees that full recovery is possible so use it on your own risk. If you want to restore files, write us to the email: chines34@protonmail.ch\nIn subject line write encryption and attach your ID in body of your message\nalso attach to email 3 crypted files. files have to be less than 2 MB It is in your interest to respond as soon as possible to ensure the restoration\nof your files, because we wont keep your decryption keys at our server more than\none week in interest of our security. Only in case you do not receive a response from the first email address\nwithit 48 hours, please use this alternative email adress: oceannewvb@protonmail.com Your personal identification number:  3zJYR4p  IP3w\n  GRYPHON RANSOMWARE",
    "ransom_notes/Cerber_2016-08-10_# DECRYPT MY FILES #.txt": "C E R B E R R A N S O M W A R 3 Cannot you find the files you need? Is the content of the files that you looked for not readable? It is normal because the files' names, as well as the data in your files have been encrypted. Great! You have turned to be a part of a big community C3rber Ransomware. !!! If you are reading this message it means the software Cerber has !!! been removed from your computer. !!! HTML instruction DECRYPT MY FILES .html always contains a !!! working domain of your personal page! What is encryption? Encryption is a reversible modification of information for security reasons but providing full access to it for authorized users. To become an authorized user and keep the modification absolutely reversible in other words to have a possibility to decrypt your files you should have an individual private key. But not only it. It is required also to have the special decryption software in your case Cerber Decryptor software for safe and complete decryption of all your files and data. Everything is clear for me but what should I do? The first step is reading these instructions to the end. Your files have been encrypted with the Cerber Ransomware software; the instructions DECRYPT MY FILES .html and DECRYPT MY FILES .txt in the folders with your encrypted files are not viruses, they will help you. After reading this text the most part of people start searching in the Internet the words the Cerber Ransomware where they find a lot of ideas, recommendations and instructions. It is necessary to realize that we are the ones who closed the lock on your files and we are the only ones who have this secret key to open them. !!! Any attempts to return your files with the thirdparty tools can !!! be fatal for your encrypted files. The most part of the thirdparty software change data within the encrypted file to restore it but this causes damage to the files. Finally it will be impossible to decrypt your files. When you make a puzzle, but some items are lost, broken or not put in its place the puzzle items will never match, the same way the thirdparty software will ruin your files completely and irreversibly. You should realize that any intervention of the thirdparty software to restore files encrypted with the Cerber Ransomware software may be fatal for your files. !!! There are several plain steps to restore your files but if you do !!! not follow them we will not be able to help you, and we will not try !!! since you have read this warning already. For your information the software to decrypt your files as well as the private key provided together are paid products. After purchase of the software package you will be able to: 1. decrypt all your files; 2. work with your documents; 3. view your photos and other media; 4. continue your usual and comfortable work at the computer. If you understand all importance of the situation then we propose to you to go directly to your personal page where you will receive the complete instructions and guarantees to restore your files. There is a list of temporary addresses to go on your personal page below: 1. http: unocl45trpuoefft.heardbids.date 0123456789ABCDEF0123 2. http: unocl45trpuoefft.eventsresg.info 0123456789ABCDEF0123 3. http: unocl45trpuoefft.itdrink.club 0123456789ABCDEF0123 4. http: unocl45trpuoefft.variedtax.kim 0123456789ABCDEF0123 5. http: unocl45trpuoefft.onion.to 0123456789ABCDEF0123 What should you do with these addresses? If you read the instructions in TXT format if you have instruction in HTML the file with an icon of your Internet browser then the easiest way is to run it: 1. take a look at the first address in this case it is http: unocl45trpuoefft.heardbids.date 0123456789ABCDEF0123; 2. select it with the mouse cursor holding the left mouse button and moving the cursor to the right; 3. release the left mouse button and press the right one; 4. select Copy in the appeared menu; 5. run your Internet browser if you do not know what it is run the Internet Explorer; 6. move the mouse cursor to the address bar of the browser this is the place where the site address is written; 7. click the right mouse button in the field where the site address is written; 8. select the button Insert in the appeared menu; 9. then you will see the address http: unocl45trpuoefft.heardbids.date 0123456789ABCDEF0123 appeared there; 10. press ENTER; 11. the site should be loaded; if it is not loaded repeat the same instructions with the second address and continue until the last address if falling. If for some reason the site cannot be opened check the connection to the Internet; if the site still cannot be opened take a look at the instructions on omitting the point about working with the addresses in the HTML instructions. If you browse the instructions in HTML format: 1. click the left mouse button on the first address in this case it is http: unocl45trpuoefft.heardbids.date 0123456789ABCDEF0123; 2. in a new tab or window of your web browser the site should be loaded; if it is not loaded repeat the same instructions with the second address and continue until the last address. If for some reason the site cannot be opened check the connection to the Internet. Unfortunately these sites are shortterm since the antivirus companies are interested in you do not have a chance to restore your files but continue to buy their products. Unlike them we are ready to help you always. If you need our help but the temporary sites are not available: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: unocl45trpuoefft.onion 0123456789ABCDEF0123 in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or operation of Tor Browser, please, visit https: www.youtube.com and type request in the search bar install tor browser windows and you will find a lot of training videos about Tor Browser installation and operation. If TOR address is not available for a long period 23 days it means you are late; usually you have about 23 weeks after reading the instructions to restore your files. Additional information: You will find the instructions for restoring your files in those folders where you have your encrypted files only. The instructions are made in two file formats HTML and TXT for your convenience. Unfortunately antivirus companies cannot protect or restore your files but they can make the situation worse removing the instructions how to restore your encrypted files. The instructions are not viruses; they have informative nature only, so any claims on the absence of any instruction files you can send to your antivirus company. Cerber Ransomware Project is not malicious and is not intended to harm a person and his her information data. The project is created for the sole purpose of instruction regarding information security, as well as certification of antivirus software for their suitability for data protection. Together we make the Internet a better and safer place. If you look through this text in the Internet and realize that something is wrong with your files but you do not have any instructions to restore your files, please, contact your antivirus support. Remember that the worst situation already happened and now it depends on your determination and speed of your actions the further life of your files.",
    "ransom_notes/Buran_!!! YOUR FILES ARE ENCRYPTED !!!.TXT": "!!! YOUR FILES ARE ENCRYPTED !!! All your files, documents, photos, databases and other important\nfiles are encrypted. You are not able to decrypt it by yourself! The only method\nof recovering files is to purchase an unique private key.\nOnly we can give you this key and only we can recover your files. To be sure we have the decryptor and it works you can send an\nemail polssh1@protonmail.com and decrypt one file for free. But this\nfile should be of not valuable! Do you really want to restore your files? Write to email polssh1@protonmail.com polssh@protonmail.com Your personal ID: Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Dharma_Arrow_FILES ENCRYPTED.txt": "all your data has been locked us You want to return? write email jamiewhite25@aol.com or dotfaldo@aol.com",
    "ransom_notes/Saturn_#DECRYPT_MY_FILES#.txt": "S A T U R N All of your files have been encrypted!\nTo Decrypt your files follow these steps: 1. Download and install the Tor Browser from https: www.torproject.org 2. Run it. 3. In the Tor Browser, open website: http: su34pwhpcafeiztt.onion 4. Follow the instructions on the page",
    "ransom_notes/HydraCrypt_README.txt": "NOT YOUR LANGUAGE? USE https: translate.google.com What happened to your files ?\nAll of your files were protected by a strong encryption with RSA4096\nMore information about the encryption keys using RSA4096 can be found here: http: en.wikipedia.org wiki RSAcryptosystem How did this happen ?\n!!! Specially for your PC was generated personal RSA4096 Key , both public and private.\n!!! ALL YOUR FILES were encrypted with the public key, which has been transferred to your computer via the Internet.\n!!! Decrypting of your files is only possible with the help of the private key and decrypt program , which is on our Secret Server What do I do ?\nSo , there are two ways you can choose: wait for a miracle and get your PRICE DOUBLED! Or start obtaining BITCOIN NOW! , and restore YOUR DATA easy way\nIf You have really valuable DATA, you better NOT WASTE YOUR TIME, because there is NO other way to get your files, except make a PAYMENT Your personal ID: 01234567:89ABCDEF:01234567:89ABCDEF For more specific instructions, please visit your personal home page, there are a few different addresses pointing to your page below: 1 http: ccjlwb22w6c22p2k.onion.to\n2 http: ccjlwb22w6c22p2k.onion.city If for some reasons the addresses are not availablweropie, follow these steps: 1 Download and install torbrowser: http: www.torproject.org projects torbrowser.html.en\n2 Video instruction: https: www.youtube.com watch?vNQrUZdsw2hA\n3 After a successful installation, run the browser\n4 Type in the address bar: http: ccjlwb22w6c22p2k.onion\n5 Follow the instructions on the site",
    "ransom_notes/ransomwhere_notes_1636811729427README_FOR_DECRYPT.txtt": "All your data has been lockedcrypted.\nHow to unlockdecrypt instruction located in this TOR website: http: .onion order \nUse TOR browser for access .onion websites.\nhttps: duckduckgo.com",
    "ransom_notes/ransomwhere_notes_1627328005201Screenshot 2021-07-26 203241.txt": "payment AvosLocker Your nelwork and hiard dives wore enetypled naang AL S 256 mililary grade encryplion\nThe only melhod of restoralion for your les s usnig our decryplor Yo may buy il or Ihe quoled prce below\nYouare an enlerpse cient ol ones, thus we will be providing you ive chat support throughoul e proeess Avosl ocker 15 nol nvolved i any allacks tsell and 11 acls merely as anarbilialor s m onemlerast thal bolh pares are sasted wilh our service e D v il it W Do exillaled vonhdeniial o el peeegurls seaies songalsocnty numl\nA el o nents Al dataowill e eakae iy ol conperalel ST Sippot\nYoru e tnmssed v pryiient window s yon wil now b g\ns ol paice il e penally 1oe 1007\nstaff S, 28,001 201 12 21 1 M1\n1360 AN GIAMAQUB K200 1M\nv i o You tnay st i cltyplion pia s By uphading s sio v vplod\ng e F1NEL G TG s then 1 MR 10 size Wowsis.. Nl el lnl Fnler yorun message Maxinum length:2043",
    "ransom_notes/PSCrypt_PAXYHOK.html": "ID ID . ! To recover data you need decryptor. To get the decryptor you should: pay for\ndecrypt: site for buy bitcoin: Buy 1 BTC on one of these sites 1. https: localbitcoins.com 2. https: www.coinbase.com 3. https: xchange.cc . ! . , , : BTC: 3500 IBox. https: www.bestchange.ru .html 24 BTC https: ebtc.com.ua : 1 . Btcu.biz. 2 . . 3 . 3500 4 . . 5 . btcu.biz. 6 . , , . , . 7 . , , . 8 . , :  , . 9 . : systems32x@gmail.com . 10 . , . : , . , 3 mb, : systems32x@gmail.com ! 100 , . , , . . ' ': systems32x@gmail.com systems32x@yahoo.com : systems32x@tutanota.com 24 help32xme@usa.com 24 Additional.mail@mail.com 24 . Unlock files LLC 33530 1st Way South Ste. 102\nFederal Way, WA 98003 United States",
    "ransom_notes/SynACK_RESTORE_INFO-2B1C5CA4.txt": "Syn Ack Files are encrypted, algorithm used: eciessecp192r1 aesecb256.\nTo decrypt your files, please contact us using this email address: bubkjdws@scryptmail.com If for unknown reasons you did not receive any answer on email,\nwrite to BitMessage using site https: bitmsg.me :  Please do not perform any manipulations with encrypted files.\nIf you want to try to restore your files manually, do backups first.\nAnd please do not remove files with text notes, because they contain important information required for file restoring. Please include the following text in your message:  \n102Ta5KqKF  5VXPluoHLews6a9buQ\n hWfI7c8HmMorDXl 1BiQs5F78sSCVp94kff wLtYu1V  \n\niggSzmuBT2WTIdeAWsl \ntbipF3USRGA",
    "ransom_notes/Kee_Hello There! Fellow @kee User!.txt": "What exactly happend?\nAll your Videos, Music, Documents and other files are no longer accessible. I'm sorry to tell you, that there's no way to decrypt your files from this time. Wasting your time is currently no good behaviour! How to get your files back?\nNow you're asking yourself how much Bitcoins you have to send to get your files back, well.. None. You simply can't get your files back! I see that you're surprised. But let's be honest. Others are just fake. You send the money.. you get nothing.\nI spare you time! But I'm a good human being!\nI don't care what you are. I have nothing against you! It's not just you, it's everyone! Then what's the matter with the countdown?\nWell.. actually there might be a little chance to decrypt your files. But even I don't know how to decrypt something without a key and when the timer runs out, all of your files will be corrupted forever! And by the way, closing this program won't help you. All files will be corrupted immediately! Find the kee!",
    "ransom_notes/Dharma_bkp_FILES ENCRYPTED.txt": "all your data has been locked us You want to return? write email bkp@cock.li",
    "ransom_notes/Cerber_2017-01-26__HELP_HELP_HELP_[]_.hta": "Can't you find the necessary files? Is the content of your files not readable? It is normal because the files' names and the data in your files have been\nencrypted by Cerber Ransomware. It means your files are NOT damaged! Your files are modified only. This\nmodification is reversible. From now it is not possible to use your files until they will be decrypted. The only way to decrypt your files safely is to buy the special decryption\nsoftware Cerber Decryptor. Any attempts to restore your files with the thirdparty software will be fatal\nfor your files! You can proceed with purchasing of the decryption software at your personal\npage: Please wait...http: p27dokhpz2n7nvgr.1plugt.top  http: p27dokhpz2n7nvgr.1cpy1q.top  http: p27dokhpz2n7nvgr.15nhsf.top  http: p27dokhpz2n7nvgr.14gmtu.top  http: p27dokhpz2n7nvgr.1321z6.top  If this page cannot be opened click here to get a new address of your\npersonal page. If the address of your personal page is the same as before after you tried to\nget a new one, you can try to get a new address in one hour. At this page you will receive the complete instructions how to buy the\ndecryption software for restoring all your files. Also at this page you will be able to restore any one file for free to be sure\nCerber Decryptor will help you. If your personal page is not available for a long period there is another way\nto open your personal page installation and use of Tor Browser: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: p27dokhpz2n7nvgr.onion  in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or use of Tor Browser, please,\nvisit https: www.youtube.com and type request in the search bar Install Tor\nBrowser Windows and you will find a lot of training videos about Tor Browser\ninstallation and use. Additional information: You will find the instructions HELPHELPHELP.hta for restoring your\nfiles in any folder with your encrypted files. The instructions HELPHELPHELP.hta in the folders with your encrypted\nfiles are not viruses! The instructions HELPHELPHELP.hta will help you\nto decrypt your files. Remember! The worst situation already happened and now the future of your\nfiles depends on your determination and speed of your actions.",
    "ransom_notes/ransomwhere_notes_1626461823622Screen Shot 2021-07-16 at 1.55.25 PM.txt": "am sorry to inform you that your device was compromised. I'll explain what led to all of this. have used a Zero Day vulnerability with a special code to infect your device through a website. This is a complicated software that requires precise skills that have. It works as a chain with specially crafted and unique code and thats why this type of an attack can go\nundetected. You only need one not patched vulnerability to be infected, and unfortunately for you it works that simple. You were not targeted specifically, but just became one of the quite a few unlucky people who got hacked that day.\nAll of this happened a few month ago. So I've had time to collect information on you. think you already know what is going to happen next.\nDuring that time, my software was quietly collecting information about your habits, websites that you visit, searches you do, texts you send.\nThere is more to it, but have listed a few reasons for you to understand how serious this is. For you to clearly understand, my software controlled your camera and microphone as well and it was impossible for you to know about it.\nIt was just about right timing for me to get you privacy violated. I've been waiting enough and have decided that it's time to put an end to this. So here is my offer. need a consulting fee to delete the media content have been collecting. Your privacy stays untouched, if get paid. Otherwise, will leak the most damaging content to your contacts and post it to a public tube for perverts to explore. understand how damaging this will be for you, and amount is not that big for you to keep your privacy.\nPlease dont blame me we all have different ways of making a living. have no intention of destroying your reputation or life, but only if get paid. don't care about you personally, that's why you can be sure that all files have and software on your device will be deleted immediately after receive the transfer. only care about getting paid. My modest consulting fee is 1650 US Dollars transferred in Bitcoin. Exchange rate at the time of the transfer.\nYou need to send that amount to this wallet: 17z8  The fee is non negotiable, to be transferred within 2 business days.\nWe use Bitcoin to protect my identity. Obviously do not try to ask for any help from anybody unless you want your privacy to be violated. will monitor your every move until get paid. If you keep your end of the agreement, you wont hear from me ever again. Take care.",
    "ransom_notes/Dharma_cmb_Info.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email paymentbtc@firemail.cc Write this ID in the title of your message 3AF0FA8F In case of no answer in 24 hours write us to theese\nemails:paymentbtc@firemail.cc You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 file for free decryption. The total size\nof files must be less than 1Mb non archived, and files should not contain\nvaluable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Cerber_2017-04-13__READ_THI$_FILE_[]_.txt": "!!! CERBER RANSOMWARE !!! YOUR DOCUMENTS, PHOTOS, DATABASES AND OTHER IMPORTANT FILES HAVE BEEN ENCRYPTED The only way to decrypt your files is to receive the private key and decryption program. To receive the private key and decryption program go to any decrypted folder, inside there is the special file READTHISFILE with complete instructions how to decrypt your files. If you cannot find any READTHISFILE file at your PC, follow the instructions below: 1. Download Tor Browser from https: www.torproject.org and install it. 2. In the Tor Browser open your personal page here: http: p27dokhpz2n7nvgr.onion 0123456789ABCDEF0123 Note! This page is available via Tor Browser only. Also you can use temporary addresses on your personal page without using Tor Browser. 1. http: p27dokhpz2n7nvgr.1j2ien.top 0123456789ABCDEF0123 2. http: p27dokhpz2n7nvgr.1nhkou.top 0123456789ABCDEF0123 3. http: p27dokhpz2n7nvgr.1a7wnt.top 0123456789ABCDEF0123 4. http: p27dokhpz2n7nvgr.1czh7o.top 0123456789ABCDEF0123 5. http: p27dokhpz2n7nvgr.1hpvzl.top 0123456789ABCDEF0123 Note! These are temporary addresses! They will be available for a limited amount of time!",
    "ransom_notes/GlobeImposter_Unknown_Read___ME.html": "Your files are Encrypted! For data recovery needs decryptor. If you want to buy a decryptor click Buy Decryptor Buy Decryptor If not working, click again. Free decryption as guarantee. Before paying you can send us 1 file for free decryption. If you can not contact, follow these two steps: 1 . Install the TOP Browser from this link: torproject.org 2 . Open this link in the TOP browser:\nhttp: n224ezvhg4sgyamb.onion sup.php",
    "ransom_notes/Argus_ARGUS-DECRYPT.html": ". ARGUS CRYPTOR V1.0 . Attention! All your files, documents, photos, databases and other important files are\nencrypted! The only method of recovering files is to purchase an unique private key. Only\nWE can recover your files! You can get the private key by email as well as through a closed TOR network.\nYou can get there by the following ways Main email : argusdecrypt@cock.li Reserved email : argusdecrypt@mailfence.com Follow the instructions If the answer for a long time no Download Tor browser https: www.torproject.org download downloadeasy Install Tor browser Open Tor Browser Open link in TOR browser: http: argusqug6aw25gye.onion Follow the instructions on this page You can get the opportunity to decrypt 1 file for free. ATTENTION! IN ORDER TO PREVENT DATA DAMAGE: DO NOT MODIFY ENCRYPTED FILES DO NOT DELETE ENCRYPTED FILES DO NOT RENAME ENCRYPTED FILES BEGIN PC DATA\n END PC DATA",
    "ransom_notes/Crypt0l0cker_HOW_TO_RESTORE_FILES.html": "WARNING we have encrypted your files with Crypt0L0cker virus Your important files including those on the network disks, USB, etc: photos,\nvideos, documents, etc. were encrypted with our Crypt0L0cker virus. The only\nway to get your files back is to pay us. Otherwise, your files will be lost. Caution: Removing of Crypt0L0cker will not restore access to your\nencrypted files. To recover your files you have to pay. In order to restore the files open our website\nhttp: e3tdxhll5fa6rirn.flackbon.tw tdju927q.;pass4998\nand follow the instructions. If the website is not available please follow these steps: 1 . Download and install TORbrowser from this link:\nhttps: www.torproject.org download downloadeasy.html.en 2 . After installation run the browser and enter the address:\nhttp: vhx6kpgibjohmvox.onion tdju927q.;pass4998 3 . Follow the instructions on the website.",
    "ransom_notes/Diamond__READ_IT_FOR_RECOVER_FILES.html": "Translate this page: Diamond Computer Encryption What Happened to My Computer? Your important files are encrypted. Many of your documents, photos, videos, databases and other files are no\nlonger accessible because they have been encrypted. Maybe you are busy looking\nfor a way to recover your files, but do not waste your time. Nobody can\nrecover your files without the decryption key. Can I recover my files? Sure. We guarantee that you can recover all your files safely and easily you\nonly need is pay 0.1 bitcoins Approximate value in dollars U 300 How do I Pay? Payment is accepted in Bitcoin only. You buy bitcoins in http: localbitcoin.com or put on google search on your\ncountry buy bitcoin and you verify the locations for buy Bitcoins in your\nlocation. After the payment confirmed all your files is decrypted automatically and you\nrecover all your files are encrypted now. The address for make the payment is\n For automatic recover all your files send 0.1 bitcoin to\n GO LOCALBITCOIN.COM FOR BUY BITCOINS",
    "ransom_notes/ransomwhere_notes_1663194093784Ransomware blackmail.txt": "I am sorry to inform you but your device was hacked. That's what happened. I have used a Zero Click vulnerability with a special code to hack your device through a website.\nA complicated software that requires precise skills that I posess.\nThis exploit works in a chain with a specially crafted unique code and such type of an attack goes undetected.\nYou only had to visit a website to be infected, and unfortunately for you it's that simple for me. You were not targeted, but just became one of the many unlucky people who got hacked through that webpage.\nAll of this happened in August. So I8217;ve had enough time to collect the information. I think you already know what is going to happen next.\nFor a couple of month my software was quietly collecting information about your habits, websites you visit, websearches, texts you send.\nThere is more to it, but I have listed just a few reasons for you to understand how serious this is. To be clear, my software controlled your camera and microphone as well.\nIt was just about right timing to get you privacy violated. I have made a few pornhub worthy videos with you as a lead actor. I8217;ve been waiting enough and have decided that it8217;s time to put an end to this.\nHere is my offer. Let8217;s name this a 8220;consulting fee8221; I need to get, so I can delete the media content I have been collecting.\nYour privacy stays untouched, if I get the payment.\nOtherwise, I will leak the most damaging content to your contacts and post it to a public website for perverts to view. You and I understand how damaging this will be to you, it's not that much money to keep your privacy. I don8217;t care about you personally, that's why you can be sure that all files I have and software on your device will be deleted immediately after I receive the transfer.\nI only care about getting paid. My modest consulting fee is 1700 US Dollars to be transferred in Bitcoin. Exchange rate at the time of the transfer.\nYou need to send that amount to this wallet:  The fee is non negotiable, to be transferred within 2 business days. Obviously do not try to ask for help from the law enforcement unless you want your privacy to be violated.\nI will monitor your every move until I get paid. If you keep your end of the agreement, you wont hear from me ever again. Take care and have a good day.",
    "ransom_notes/Sage_Sage2.0_!Recovery_[].html": "sA Need hS1pelp writh Aa7ctranslatiIon?? ULQObBwse\nhcn5tbZlttps: ktranoslatxI4e.Z23vqDogoogeCSTjGle.ccom9QWeM evZxaXe AThrIQHtTENTIONznW! ALL YNOUVtsELR FIZ1RrDT1LESzWJJ WEREs1w ENCRYTjPTgZ\nDdED! 37xTia9 PLEAoc2CX0SSEJfSef READ TsU6cttyHIS MESv2P0uSAGE CAREFUL76ceaoLY\nxab All yo8ur implortant caand  filUWBMFlIes aTOUs wellR0Kzbs\nas uEdatRxSdPabanP4ses, iwribr1kmages aXaRVETnd  aTMcpnd\nso ronF1qn4Q wmfRTJere gWzLengcryptlc0med by isoftwcsuR8Iare known as SAGE! SAGEil78 2.0 3tusesUjyy militcloary gtKrade cjfUPlelliptjic curvOn8e\ncryptographO0HEfYy andMBV you hIave nMo chSances xeeu1restorZcing\nyXRiou6mYr filesHkzHa withoust ourr hkRaUPZSelp! But if cyou fGDollow UvoulN3yEar  EjOViwe RP3Aguaranutee\nthavRZt you lMMcanjTlJ restoiTMsre all EoCcLyour \nquicklc9zy andum4OF62 siafely! v6 N 8gQcomf sv IKRE1 W8 To getpYV tfOgcGGheQl  opebnbCn anyrt of thmis\ntemporoqWqary 64linkC93pb1Is inHA youFGr brNwVpowserVQ5l2: http: 7gie6ffnkrjykggd.rzunt3u2.com login removed http: 7gie6ffnkrjykggd.er29sl.com login removed ThixrfT9s linksoUVl arloYF4ae temlBGkpo4T0Prary aPvE3CZnd ziwill biPNMOstop\n aJlgjdfttuer someNOAUp2 tPWCTB8ime, sogwI7Be ifZeuK1hy\nyou Blcan't zSopZengs thesesJ links,yb yoht9sPSu can uslhYkW4e TOR\nBrxRELowSTser ThOSe TOZy2q4R BroBSr99dwser isa aT6TvailavB1bl1e on thJQe official\nwebMZsit5v6kiDe: https: www.torproject.org Just oqwXpen tN5PAhis stl1Zdite, idclieqgck on ab3the 6DownloGad TorLr6nFS\nbuttoNj0Uujn and  theng3 \n, VYCU01then useiB iht to UjwQXopen the\nFfoliQlowinPJNeoFFg link:fC27bI http: 7gie6ffnkrjykggd.onion login removed Palease be suR8Wrre to wctZjv2copy thRMSijis \ntexkA6t gransJd linksqyA to youYCeQr noCQtefpad to 4FkxOgavoid\n it ZE",
    "ransom_notes/GlobeImposter_2017-07-31_RECOVER-FILES.html": "Your files are Encrypted! For data recovery needs decryptor. If you want to buy a decryptor, click the button Yes, I want to buy Free decryption as guarantee. Before paying you can send us 1 file for free decryption. To send a message or file use this link. If you send a file for free decryption, also send file RECOVERFILES.HTML Support And finally, if you can not contact, follow these two steps: 1 . Install the TOP Browser from this link: torproject.org Then open this link in the TOP browser: support ?nu105fb;725",
    "ransom_notes/StopDjvu_LotR__readme.txt": "ATTENTION! Don't worry my friend, you can return all your files!\nAll your files like photos, databases, documents and other important are encrypted with strongest encryption and unique key.\nThe only method of recovering files is to purchase decrypt tool and unique key for you.\nThis software will decrypt all your encrypted files.\nWhat guarantees you have?\nYou can send one of your encrypted file from your PC and we decrypt it for free.\nBut we can decrypt only 1 file for free. File must not contain valuable information.\nYou can get and look video overview decrypt tool:\nhttps: we.tl tuidgK0Fb8r\nPrice of private key and decrypt software is 980.\nDiscount 50 available if you contact us first 72 hours, that's price for you is 490.\nPlease note that you'll never restore your data without payment.\nCheck your email Spam or Junk folder if you don't get answer more than 6 hours. To get this software you need write on our email:\nbufalo@firemail.cc Reserve email address to contact us:\ngorentos@bitmessage.ch Our Telegram account:\n@datarestore Your personal ID:",
    "ransom_notes/Dharma_4k_Info.hta": "All FILES ENCRYPTED RSA1024 All YOUR FILES HAVE BEEN ENCRYPTED!!! IF YOU WANT TO RESTORE THEM, WRITE US TO\nTHE EMAIL rocosmon@cock.li IN THE LETTER WRITE YOUR ID, YOUR ID 9C8BF309 IF YOU ARE NOT ANSWERED, WRITE TO EMAIL:rocosmon@cock.li YOUR SECRET KEY WILL BE STORED ON A SERVER 7 DAYS, AFTER 7 DAYS IT MAY BE\nOVERWRITTEN BY OTHER KEYS, DON'T PULL TIME, WAITING YOUR EMAIL FREE DECRYPTION FOR PROOF You can send us up to 1 file for free decryption. The total size of files must\nbe less than 1Mb non archived, and files should not contain valuable\ninformation. databases,backups, large excel sheets, etc. DECRYPTION PROCESS: When you make sure of decryption possibility transfer the money to our bitcoin\nwallet. As soon as we receive the money we will send you: 1 . Decryption program. 2 . Detailed instruction for decryption. 3 . And individual keys for decrypting your files. !WARNING! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Locky_zepto__HELP_instructions.html": ".. !!! IMPORTANT INFORMATION !!!! All of your files are encrypted with RSA2048 and AES128 ciphers. More information about the RSA and AES can be found here: http: en.wikipedia.org wiki RSAcryptosystem http: en.wikipedia.org wiki  Decrypting of your files is only possible with the private key and decrypt\nprogram, which is on our secret server. To receive your private key follow one of the links: 1 . http: zjfq4lnfbs7pncr5.tor2web.org removed 2 . http: zjfq4lnfbs7pncr5.onion.to removed If all of this addresses are not available, follow these steps: 1 . Download and install Tor Browser:\nhttps: www.torproject.org download downloadeasy.html 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the address bar: zjfq4lnfbs7pncr5.onion removed 4 . Follow the instructions on the site. !!! Your personal identification ID: removed !!! ..",
    "ransom_notes/Matrix_Version2_[].hta": "All your files have been encrypted! All of important data on this computer was encrypted with strong RSA2048\nalgorithm due to the violation of the federal laws of the United States of\nAmerica! Article 1, Section 8, Clause 8; Article 202; Arcticle 210 of the\nCriminal Code of U.S.A. provides for a deprivation of liberty for four to\ntwelve years. Following violations were detected: Your IP adress was used to visit websites containing pornography, child\npornography, zoophilia and child abuse! To unlock your files you have to pay the penalty! You have only 96 hours to recover your personal data! After this time your\nunique key will be deleted and file decryption will become impossible! Each 12 hours the payment size will be automatically increased by\n100! You must pay the penalty through the Bitcoin Wallet. To get your unique key and unlock files, you should send the following code:  to our agent emails: bluetablet9643@yahoo.com or decodedecode@yandex.ru You will recieve all necessary instructions! Hurry up or you will be arrested!!!",
    "ransom_notes/CryptoMix_Arena__HELP_INSTRUCTION.TXT": "All your files have been encrypted! If you want to restore them, write us to the email : ms.heisenberg@aol.com Write this ID in the title of your message  number number In case of no answer in 48 hours write us to theese emails : ms.heisenberg@aol.com You have to pay for decryption in Bitcoins. The price depends on how fast you write to us. After payment we will send you the decryption tool that will decrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 files for free decryption. The total size of files must be less than 2 Mb non archived, and files should not contain valuable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register, click 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beg",
    "ransom_notes/Unknown Ransomware_e1a88ddb222b48f55f5be7eb9ea9164e_HOW TO DECRYPT FILES.txt": "All your information documents, databases, backups and other files this computer was encrypted using the most cryptographic algorithms.\nAll encrypted files are formatted .Crypted.\nThis form files '.Crypted' is a joint development American Hackers.\nYou can only recover files using a decryptor and password, which, in turn, only we know.\nIt is impossible to pick it up.\nReinstalling the OS will not change anything.\nNo system administrator in the world can solve this problem without knowing the password\nIn no case do not modify the files! But if you want, then make a backup.\nDrop us an email at the address india2lock@gmail.com\nYou have 48 hours left. If they are not decrypted then after 48 hours they will be removed!!!",
    "ransom_notes/Matrix_Version2_Bl0cked-ReadMe.rtf": "attention! all your files were encrypted with RSa2048 algorithm.\nWithout your personal decryption key data recovery is impossible!\nTo get your unique key and decrypt the files, You have to send the following code:  to our email address: bluetablet9643@yahoo.com Then You will recieve all necessary instructions.\nYou have only 96 hours to recover your data! after this time your unique decryption key will be automatically deleted and file decryption will become impossible!\nHurry up! each 12 hours the payment size will be automatically increased by 100! cf0all the attempts of decryption by yourself will result only in irrevocable loss of your data.\nIf you still want to try to decrypt them by yourself please make a backup at first because the decryption will become impossible in case of any changes inside the files.\nIf you did not receive the answer from the aforecited email for more then 24 hours and only in this case!, use the reserve email address: decodedecode@yandex.ru",
    "ransom_notes/GlobeImposter_Unknown_How to restore your files.hta": "Your files are encrypted! Your personal ID: AB BE BD 7F A7 71 DC D7 09 A5 3F 76 6B 2D B6 91 34 D1 04 63 43 20 22 D8 BE D2 7F 61 D7 0E 73 70 05 9B 1A D4 2F D6 55 32 7D 91 A0 5E AF DB EA 24 69 4F 44 56 6C 23 14 8D 2B 3C 3C 4E 4F 6A 01 48 EC 25 F6 92 6D 1E 8F FB AA E6 10 69 C9 FE EF 1D 3C 1E 31 03 D6 F7 18 66 09 29 03 80 B0 DF A6 05 DA DA EC 96 6A 1F D9 46 AD E1 BF 6A ED 44 5F 6D 7D A7 DF 70 96 F7 E6 70 B2 26 5B FD 2C 07 61 87 C6 A2 37 34 67 3F 80 E4 CE 47 35 08 DD 91 2F 3E 0F 81 70 C1 23 31 68 AC 41 1D 9C A1 E9 B0 8A 2B 59 02 8F EB 51 E3 7E 2C C7 1B 0D 18 45 FC 1A 38 B3 8D EC AE 54 B6 2F CD CE 8F 0C DF B5 94 FA AD 33 6F 42 D2 A4 7E DE A1 22 B6 B5 93 E1 70 75 86 C4 AD AD 9C EC 7C 57 AE 05 A9 48 AB 22 49 E0 93 4A 9C 4B 58 BF E0 C3 66 98 3A 7B 95 52 CB 67 E5 A4 32 1E E3 41 D1 FC 11 B4 01 B6 8E 93 5B BA 04 Due to poor security, access to your server computer was obtained. Your\ndocuments, photos, databases and other important data was encrypted. Data recovery requires a decoder. To get the decryptor and instructions you should send an email to\ndsupport@protonmail.com. Please, send 1 encrypted image or text file, and\nindicate in letter your personal ID look at the beginning of the document,\nit's very important! We will give you the decrypted file in order for you to be sure and assign\nthe price to decrypt all files. After you will get an instruction how to pay\nfor decrypt, and after payment you will receive a decryptor and instructions. After start decryptor program all your files will be restored. Attention! Do not attempt to remove any program or run the antivirus tools! Do you want to decrypt the files yourself? If you are not afraid to lose all files good luck. The price for each is different.",
    "ransom_notes/Cerber_2017-08-02__R_E_A_D___T_H_I_S___[]_.txt": "Hi, I'am CRBR ENCRYPTOR ; ALL YOUR DOCUMENTS, PHOTOS, DATABASES AND OTHER IMP0RTANT FILES HAVE BEEN ENCRYPTED! The only one way to decrypt your files is to receive the private key and decryption program. To receive the private key and decryption program go to any decrypted folder, inside there is the special file READTHIS with complete instructions how to decrypt your files. If you cannot find any READTHIS file at your PC, follow the instructions below: 1. Download Tor Browser from https: www.torproject.org and install it. 2. In the Tor Browser open your personal page here: http: oqwygprskqv65j72.onion 0123456789ABCDEF0123 Note! This page is available via Tor Browser only. Also you can use temporary addresses on your personal page without using Tor Browser. 1. http: oqwygprskqv65j72.1hbdbx.top 0123456789ABCDEF0123 2. http: oqwygprskqv65j72.13gpqd.top 0123456789ABCDEF0123 3. http: oqwygprskqv65j72.1jitcy.top 0123456789ABCDEF0123 4. http: oqwygprskqv65j72.1jfniy.top 0123456789ABCDEF0123 5. http: oqwygprskqv65j72.1ldyev.top 0123456789ABCDEF0123 Note! These are temporary addresses! They will be available for a limited amount of time!",
    "ransom_notes/PrincessLocker_PrincessLockerV1_!_HOW_TO_RESTORE_[].txt": "Your ID: 2vqopc51hk5l Your extension: 5hyvf Your files are encrypted. Read decrypting instructions on: http: txdmxtyifjyxdnpj.onion.link http: txdmxtyifjyxdnpj.torstorm.org http: txdmxtyifjyxdnpj.onion.nu http: txdmxtyifjyxdnpj.onion.cab http: txdmxtyifjyxdnpj.onion.to If you can't access these websites from your browser, you have to download TOR browser: https: www.torproject.org projects torbrowser.html Follow this link via Tor Browser: http: txdmxtyifjyxdnpj.onion",
    "ransom_notes/Dharma_stopencrypt_info.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email stopencrypt@qq.com Write this ID in the title of your message 7A450B2E In case of no answer in 24 hours write us to theese emails:stopencrypt@qq.com You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 file for free decryption. The total size\nof files must be less than 1Mb non archived, and files should not contain\nvaluable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/CryptoWire_DesktopReadme_INSTRUCTIONS.txt": "If you are seeing this message your files are already encrypted. VERY IMPORTANT READ CAREFULLY You should now see a window offering you to restore your computer files.\nIf you do not see this window, you will need to rerun the program, disable antivirus, or restart the computer.\nGetting this window to open is the only way to get your files back.\nAny attempt to use third party programs to recover the files is guranteed to corrupt them\nThis ransomware is custom programmed at every deployment to ensure of this. Failure to see the decryption window and failure to follow the instructions\nWill cause all the files to be permanetly deleted and any personal information collected will be published on dark markets.\nYou have 48 hours from the creation of this TXT file. Can't get decryption window or for serious questions email BellevueInject@openmailbox.org\nMoralizing, preaching, or any non mission critical emails will result in deletion of your files.",
    "ransom_notes/Cerber_2016-05-05_# DECRYPT_MY_FILES #.txt": "Cannot you find the files you need? Is the content of the files that you looked for not readable? It is normal because the files' names, as well as the data in your files have been encrypted. Great!!! You have turned to be a part of a big community CerberRansomware. !!! If you are reading this message it means the software !!! Cerber Ransomware has been removed from your computer. What is encryption? Encryption is a reversible modification of information for security reasons but providing full access to it for authorized users. To become an authorized user and keep the modification absolutely reversible in other words to have a possibility to decrypt your files you should have an individual private key. But not only it. It is required also to have the special decryption software in your case Cerber Decryptor software for safe and complete decryption of all your files and data. Everything is clear for me but what should I do? The first step is reading these instructions to the end. Your files have been encrypted with the Cerber Ransomware software; the instructions DECRYPT MY FILES .html and DECRYPT MY FILES .txt in the folders with your encrypted files are not viruses, they will help you. After reading this text the most part of people start searching in the Internet the words the Cerber Ransomware where they find a lot of ideas, recommendations and instructions. It is necessary to realize that we are the ones who closed the lock on your files and we are the only ones who have this secret key to open them. !!! Any attempts to get back your files with the thirdparty tools can !!! be fatal for your encrypted files. The most part of the thirdparty software change data within the encrypted file to restore it but this causes damage to the files. Finally it will be impossible to decrypt your files. When you make a puzzle but some items are lost, broken or not put in its place the puzzle items will never match, the same way the thirdparty software will ruin your files completely and irreversibly. You should realize that any intervention of the thirdparty software to restore files encrypted with the Cerber Ransomware software may be fatal for your files. !!! There are several plain steps to restore your files but if you do !!! not follow them we will not be able to help you, and we will not try !!! since you have read this warning already. For your information the software to decrypt your files as well as the private key provided together are paid products. After purchase of the software package you will be able to: 1. decrypt all your files; 2. work with your documents; 3. view your photos and other media; 4. continue your usual and comfortable work at the computer. If you understand all importance of the situation then we propose to you to go directly to your personal page where you will receive the complete instructions and guarantees to restore your files. There is a list of temporary addresses to go on your personal page below: 1. http: decrypttozxybarc.dconnect.eu removed 2. http: decrypttozxybarc.tor2web.org removed 3. http: decrypttozxybarc.onion.cab removed 4. http: decrypttozxybarc.onion.to removed 5. http: decrypttozxybarc.onion.link removed What should you do with these addresses? If you read the instructions in TXT format if you have instruction in HTML the file with an icon of your Internet browser then the easiest way is to run it: 1. take a look at the first address in this case it is http: decrypttozxybarc.dconnect.eu removed; 2. select it with the mouse cursor holding the left mouse button and moving the cursor to the right; 3. release the left mouse button and press the right one; 4. select Copy in the appeared menu; 5. run your Internet browser if you do not know what it is run the Internet Explorer; 6. move the mouse cursor to the address bar of the browser this is the place where the site address is written; 7. click the right mouse button in the field where the site address is written; 8. select the button Insert in the appeared menu; 9. then you will see the address http: decrypttozxybarc.dconnect.eu removed appeared there; 10. press ENTER; 11. the site should be loaded; if it is not loaded repeat the same instructions with the second address and continue until the last address if falling. If for some reason the site cannot be opened check the connection to the Internet; if the site still cannot be opened take a look at the instructions on omitting the point about working with the addresses in the HTML instructions. If you browse the instructions in HTML format: 1. click the left mouse button on the first address in this case it is http: decrypttozxybarc.dconnect.eu removed; 2. in a new tab or window of your web browser the site should be loaded; if it is not loaded repeat the same instructions with the second address and continue until the last address. If for some reason the site cannot be opened check the connection to the Internet. Unfortunately these sites are shortterm since the antivirus companies are interested in you do not have a chance to restore your files but continue to buy their products. Unlike them we are ready to help you always. If you need our help but the temporary sites are not available: 1. run your Internet browser if you do not know what it is run the Internet Explorer; 2. enter or copy the address https: www.torproject.org download downloadeasy.html.en into the address bar of your browser and press ENTER; 3. wait for the site loading; 4. on the site you will be offered to download Tor Browser; download and run it, follow the installation instructions, wait until the installation is completed; 5. run Tor Browser; 6. connect with the button Connect if you use the English version; 7. a normal Internet browser window will be opened after the initialization; 8. type or copy the address http: decrypttozxybarc.onion removed in this browser address bar; 9. press ENTER; 10. the site should be loaded; if for some reason the site is not loading wait for a moment and try again. If you have any problems during installation or operation of Tor Browser, please, visit https: www.youtube.com and type request in the search bar install tor browser windows and you will find a lot of training videos about Tor Browser installation and operation. If TOR address is not available for a long period 23 days it means you are late; usually you have about 23 weeks after reading the instructions to restore your files. Additional information: You will find the instructions for restoring your files in those folders where you have your encrypted files only. The instructions are made in two file formats HTML and TXT for your convenience. Unfortunately antivirus companies cannot protect or restore your files but they can make the situation worse removing the instructions how to restore your encrypted files. The instructions are not viruses; they have informative nature only, so any claims on the absence of any instruction files you can send to your antivirus company. Cerber Ransomware Project is not malicious and is not intended to harm a person and his her information data. The project is created for the sole purpose of instruction regarding information security, as well as certification of antivirus software for their suitability for data protection. Together we make the Internet a better and safer place. If you look through this text in the Internet and realize that something is wrong with your files but you do not have any instructions to restore your files, please, contact your antivirus support. Remember that the worst situation already happened and now it depends on your determination and speed of your actions the further life of your files.",
    "ransom_notes/ransomwhere_notes_1653905568220_readme.txt": "ATTENTION! Don't worry, you can return all your files!\nAll your files like pictures, databases, documents and other important are encrypted with strongest encryption and unique key.\nThe only method of recovering files is to purchase decrypt tool and unique key for you.\nThis software will decrypt all your encrypted files.\nWhat guarantees you have?\nYou can send one of your encrypted file from your PC and we decrypt it for free.\nBut we can decrypt only 1 file for free. File must not contain valuable information.\nYou can get and look video overview decrypt tool:\nhttps: we.tl t6Ti2DxXR3I\nPrice of private key and decrypt software is 980.\nDiscount 50 available if you contact us first 72 hours, that's price for you is 490.\nPlease note that you'll never restore your data without payment.\nCheck your email Spam or Junk folder if you don't get answer more than 6 hours. To get this software you need write on our email:\nmanager@time2mail.ch Reserve email address to contact us:\nsupportsys@airmail.cc Your personal ID:",
    "ransom_notes/BTCWare_Nuclear_HELP.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email black.world@tuta.io You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 3 files for free decryption. The total\nsize of files must be less than 1Mb non archived, and files should not\ncontain valuable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Evil locker_!_HOW_RECOVERY_FILES_!.txt": "EVIL LOCKER HELLO, DEAR FRIEND! 1. ALL YOUR FILES HAVE BEEN ENCRYPTED! Your files are NOT damaged! Your files are modified only. This modification is reversible. The only 1 way to decrypt your files is to receive the decryption program. 2. HOW TO RECOVERY FILES? To receive the decryption program write on our email: evil@cock.lu or evil@firemail.cc And in subject write your ID: IDredacted 6 hex char We send you full instruction how to decrypt all your files. 3. FREE DECRYPTION! Free decryption as guarantee. We guarantee the receipt of the decryption program after payment. To believe, you can give us up to 3 files that we decrypt for free. Files should not be important to you! databases, backups, large excel sheets, etc. EVIL LOCKER",
    "ransom_notes/Striked_README_DECRYPT.html": "YOUR FILES ARE STRIKED! ALL OF YOUR FILES ARE ENCRYPTED! Your personal identifier:1516139534 Your documents, photos, databases, save games and other important data were\nencrypted. For a data recovery requires a decryptor. To decrypt your files send an email tobitcoin@mortalkombat.top In the reply letter you will receive a program for decryption. After starting the decryption program, all your files will be restored. !!! Attention !!!!!! Attention !!!!!! Attention !!! Do not attempt to uninstall the program or run antivirus software Attempts to decrypt files by themselves will result in the loss of your\ndata",
    "ransom_notes/Sad__HELPME_DECRYPT_.txt": "ALL YOUR FILES HAVE BEEN ENCRYPTED All of your dataphoto, documents, databases,... have been encrypted with AES 256 bit and a private and unique key generated for this computer.\nIt means that you will not be able to accsess your files anymore until theyre decrypted.\nThe private key is stored in our servers and the only way to receive your key to decrypt your files is to pay. The only one way to decrypt your files is to receive the private key and decryption program.\nDont waste your time. No one will be able to recover tem without our decryption service.\nThe payment has to be done in Bitcoin to a unique address that we generated for you, Bitcoins are a virtual currency to make online payments.\nIf you dont know how to get Bitcoins, you can google: 'How to Buy Bitcoins' and follow the instructions.\nTo recover your files and unlock your computer, you must send 0.3 Bitcoins\nWe created an easier way to pay, go on this link\nhttps: satoshibox.com \nIf you dont know how to create a wallet go to http: blockchain.info wallet and create a bitcoin wallet. Need more information about Bitcoin?\nhttps: en.wikipedia.org wiki Bitcoin More information about the AES encryption can be found here:\nhttp: en.wikipedia.org wiki  If you have any questions, write us: decryptsad@protonmail.com YOUR PERSONAL IDENTIFICATION:",
    "ransom_notes/PrincessLocker_PrincessLockerV2___USE_TO_REPAIR_[].html": "yjUSTAyabxoxC Your ID: RHLmuyxym1h3T1Wd Your extension: FOQUJo vZquxNw Your files are encrypted! 1 Read decrypting instructions on: http: royall6qpvndxlsj.hiddenservice.net http: royall6qpvndxlsj.onion.casa http: royall6qpvndxlsj.onion.link http: royall6qpvndxlsj.onion.rip http: royall6qpvndxlsj.onion.to 2 If you can not access these websites or they are malfunctioning, download\nand install Tor Browser: http: www.torproject.org download downloadeasy.html 3 Follow this link via Tor Browser: http: royall6qpvndxlsj.onion",
    "ransom_notes/Dharma_brrr_FILES ENCRYPTED.txt": "all your data has been locked us You want to return? write email paydecryption@qq.com",
    "ransom_notes/GlobeImposter_newave_#NEW_WAVE.html": "WARNING!!! Your files was encrypted! Save the ID before doing anything on the computer!!! Be sure to save this ID, without it decryption is impossible!!! Your personal ID: 56 27 2E 8F8 14 A1 3D 07 09 BB F EE 77 9F 74 00 BC .. .. .. 24 6C F5 23 C4 5D 5F 08 Send 3 test image or text file newwave@tuta.io or newwave@airmail.cc. In the letter include your personal ID look at the beginning of this\ndocument. We will give you the decrypted file and assign the price for decryption all\nfilesAfter we send you instruction how to pay for decrypt and after payment\nyou will receive a decryptor and instructions We can decrypt one file in\nquality the evidence that we have the decoder. To recover data you need decryptor. Instructions for obtaining a decryptor: Send your ID to the mailbox below and wait for the answer:newwave@tuta.io or\nnewwave@airmail.cc. In the response letter there will be instructions for decoding. Attention!!! Only newwave@tuta.io or newwave@airmail.cc can decrypt your files Do not trust anyone newwave@tuta.io or newwave@airmail.cc Do not attempt to remove the program or run the antivirus tools Decoders other users are not compatible with your data, because each user's unique encryption key Attempts to selfdecrypting files will result in the loss of your data",
    "ransom_notes/GandCrab_GandCrabV5_5.0.3_[]-DECRYPT.txt": "GANDCRAB V5.0.3 UNDER NO CIRCUMSTANCES DO NOT DELETE THIS FILE, UNTIL ALL YOUR DATA IS RECOVERED FAILING TO DO SO, WILL RESULT IN YOUR SYSTEM CORRUPTION, IF THERE WILL BE DECRYPTION ERRORS Attention! All your files, documents, photos, databases and other important files are encrypted and have the extension: .GACMW The only method of recovering files is to purchase an unique private key. Only we can give you this key and only we can recover your files. The server with your key is in a closed network TOR. You can get there by the following ways: 0. Download Tor browser https: www.torproject.org 1. Install Tor browser 2. Open Tor Browser 3. Open link in TOR browser: http: gandcrabmfe6mnef.onion fe1bfd4c60d8c0e3 4. Follow the instructions on this page On our page you will see instructions on payment and get the opportunity to decrypt 1 file for free. ATTENTION! IN ORDER TO PREVENT DATA DAMAGE: DO NOT MODIFY ENCRYPTED FILES DO NOT CHANGE DATA BELOW BEGIN GANDCRAB KEY     UMKNLwUm45Z6zZuLOAEc4YHsvFGc oQxLZYlBPXrg0N9O4Z      yeKM y9FNfYgAZFEV5CEiAwK f7VAgfQqoSLRaVZLPa6X4Czd3LpUlp Nv lY0    SaxSSjTmkg5yy1kMAzoWjp0ScMG4ugcmk CsTC6BOFw94F2ONxTJ72W4aKxxiSigFpn vw2tXgsDRRY U0VuT8d  dFXsZ6g1O3ZeZAdVTsNr4pcatp7begjhAzLEa1 5owIpMM1dHS  zFsO21zpmYvwvB51   mCpsdix47aJVr5G  JKfXIUZUvtQ9pApKMzxLCteHYvMss1 2yuQ83KhrirC8e8r8  qLRDOK8eWmzvT7Pps97  END GANDCRAB KEY BEGIN PC DATA  bFAv 9mGGoBpAZLv6jx  2PyMLkO0MLEPxIodLAmTS5x0mtsoTXZoP c e rC1tRzjTbmjYlAG3g8l65nVd0 CBUxKQ7KDJYrtX0vSmnFXg ykfgtJNiwqfCnqbr85BitbEnkUnBsuLy zI2Fet1Gt1YbFrXBi t    END PC DATA",
    "ransom_notes/TeslaCrypt_2015-12-04_Howto_RESTORE_FILES.html": "NOT YOUR LANGUAGE? USEGoogle Translate What happened to your files? All of your files were protected by a strong encryption with RSA2048 More information about the encryption RSA2048 can be found here:\nhttp: en.wikipedia.org wiki RSAcryptosystem What does this mean? This means that the structure and data within your files have been\nirrevocably changed, you will not be able to work with them, read them or see them, it is the same thing as losing them forever,\nbut with our help, you can restore them. How did this happen? Especially for you, on our server was generated the secret key pair RSA2048 public and private. All your files were encrypted with the public key, which has been\ntransferred to your computer via the Internet. Decrypting of YOUR FILES is only possible with the help of the private key and\ndecrypt program, which is on our Secret Server!!! What do I do? Alas, if you do not take the necessary measures for the specified time then\nthe conditions for obtaining the private key will be changed. If you really need your data, then we suggest you do not waste valuable\ntime searching for other solutions becausen they do not exist. For more specific instructions, please visit your personal home page, there\nare a few different addresses pointing to your page below: 1.http: alcov44uvcwkrend.softpay4562.com removed 2.http: alcov44uvcwkrend.paybtc798.com removed 3.http: alcov44uvcwkrend.btcpay435.com removed 4.https: alcov44uvcwkrend.onion.to removed If for some reasons the addresses are not available, follow these steps: 1 . Download and install torbrowser:\nhttp: www.torproject.org projects torbrowser.html.en 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the torbrowser address bar: alcov44uvcwkrend.onion removed 4 . Follow the instructions on the site. IMPORTANT INFORMATION: Your Personal PAGES: http: alcov44uvcwkrend.softpay4562.com removed http: alcov44uvcwkrend.paybtc798.com removed http: alcov44uvcwkrend.btcpay435.com removed https: alcov44uvcwkrend.onion.to removed Your Personal PAGES using TORBrowser: alcov44uvcwkrend.onion removed Your personal code if you open the site or TORBrowser's directly:\nremoved",
    "ransom_notes/ransomwhere_notes_1626350488770_readme.txt": "ATTENTION! Don't worry, you can return all your files!\nAll your files like pictures, databases, documents and other important are encrypted with strongest encryption and unique key.\nThe only method of recovering files is to purchase decrypt tool and unique key for you.\nThis software will decrypt all your encrypted files.\nWhat guarantees you have?\nYou can send one of your encrypted file from your PC and we decrypt it for free.\nBut we can decrypt only 1 file for free. File must not contain valuable information.\nYou can get and look video overview decrypt tool:\nhttps: we.tl ttkon5qUcfl\nPrice of private key and decrypt software is 980.\nDiscount 50 available if you contact us first 72 hours, that's price for you is 490.\nPlease note that you'll never restore your data without payment.\nCheck your email Spam or Junk folder if you don't get answer more than 6 hours. To get this software you need write on our email:\nmanager@mailtemp.ch Reserve email address to contact us:\nhelpmanager@airmail.cc Your personal ID:",
    "ransom_notes/Matrix_Version3_WhatHappenedWithFiles.rtf": "attention! all your files were encrypted with RSa2048 algorithm.\nWithout your personal decryption key data recovery is impossible!\nTo get your unique key and decrypt the files, You have to send the following code:  to our email address: redtablet9643@yahoo.com Then You will recieve all necessary instructions.\nYou have only 96 hours to recover your data! after this time your unique decryption key will be automatically deleted and file decryption will become impossible!\nHurry up! each 12 hours the payment size will be automatically increased by 100! cf0all the attempts of decryption by yourself will result only in irrevocable loss of your data.\nIf you still want to try to decrypt them by yourself please make a backup at first because the decryption will become impossible in case of any changes inside the files.\nIf you did not receive the answer from the aforecited email for more then 24 hours and only in this case!, use the reserve email address: decodedecode@tutanota.com",
    "ransom_notes/NemucodAES_[].hta": "ATTENTION! All your documents, photos, databases and other important personal files were\nencrypted using a combination of strong RSA2048 and AES128 algorithms. The only way to restore your files is to buy decryptor. Please, follow these\nsteps: 1. Create your Bitcoin wallet here: https: blockchain.info wallet new 2. Buy 0.14745 bitcoins here: https: localbitcoins.com buybitcoins 3. Send 0.14745 bitcoins to this address:  4. Open one of the following links in your browser: https: bgl3mwo7z3pqyysm.onion.link  https: bgl3mwo7z3pqyysm.onion.to  https: bgl3mwo7z3pqyysm.onion.casa  If all of these pages are not available: Download Tor Browser here: https: www.torproject.org download downloadeasy.html.en Install and run Tor Browser Open this site in Tor Browser: http: bgl3mwo7z3pqyysm.onion  5. Download and run decryptor to restore your files.",
    "ransom_notes/StopDjvu_Sample1__readme.txt": "ATTENTION! Don't worry my friend, you can return all your files!\nAll your files like photos, databases, documents and other important are encrypted with strongest encryption and unique key.\nThe only method of recovering files is to purchase decrypt tool and unique key for you.\nThis software will decrypt all your encrypted files.\nWhat guarantees you have?\nYou can send one of your encrypted file from your PC and we decrypt it for free.\nBut we can decrypt only 1 file for free. File must not contain valuable information.\nYou can get and look video overview decrypt tool:\nhttps: we.tl tuidgK0Fb8r\nPrice of private key and decrypt software is 980.\nDiscount 50 available if you contact us first 72 hours, that's price for you is 490.\nPlease note that you'll never restore your data without payment.\nCheck your email Spam or Junk folder if you don't get answer more than 6 hours. To get this software you need write on our email:\nbufalo@firemail.cc Reserve email address to contact us:\ngorentos@bitmessage.ch Our Telegram account:\n@datarestore Your personal ID:",
    "ransom_notes/NonRansomware_HowToBackFiles.txt": "Attention !!! All your files on this server have been encrypted.\nWrite this ID in the title of your message To restore the files need to write to us on email: The price for restoration depends on how quickly you write tous.\nAfter payment we will send you a decryption tool that will decrypt all your files. You can send us up to 3 files for free decryption. files should not contain important information and their total size should be less than 1 MB IMPORTANT !!!\nDo not rename encrypted files\nDo not try to decrypt your data with thirdparty software,this can lead to permanent data loss! Your ID: xx;xx",
    "ransom_notes/Sad__HELPME_DECRYPT_.hta": "English Sad Ransomware Instructions All of your filesdocuments, photos, databases,... have been encrypted with\nAES 256 bit and a private and unique key generated for this computer. The private key is stored in our servers and the only way to receive your key\nto decrypt your files is to pay. The payment has to be done in Bitcoin to a unique address that we generated\nfor you, Bitcoins are a virtual currency to make online payments. If you dont know how to get Bitcoins, you can google: How to Buy Bitcoins\nand follow the instructions. To recover your files and unlock your computer, you must send 0.3 Bitcoins. We created an easier way to pay, go on this link Warten Sie mal...https: satoshibox.com",
    "ransom_notes/Sage_Sage2.2_!HELP_SOS.hta": "English Deutsch Italiano Portugus Espaol Franais Nederlands The file is encrypted but can be restored Die Datei ist verschlsselt, aber kann wiederhergestellt werden Il file crittografato, ma pu essere ripristinato O arquivo est criptografado, mas poder ser descriptografado El archivo est encriptado pero puede ser restaurado Le fichier est crypt mais peut tre restaur Het bestand is versleuteld maar kan worden hersteld HERE1 The file you tried to open and other important files on your computer were\nencrypted by SAGE 2.2 Ransomware. Action required to restore your files. File recovery instructions You probably noticed that you can not open your files and that some software\nstopped working correctly. This is expected. Your files content is still there, but it was encrypted by\nSAGE 2.2 Ransomware. Your files are not lost, it is possible to revert them back to normal state by\ndecrypting. The only way you can do that is by getting SAGE Decrypter software and your\npersonal decryption key. Using any other software which claims to be able to restore your files will\nresult in files being damaged or destroyed. You can purchase SAGE Decrypter software and your decryption key at your\npersonal page you can access by following links: http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below. If you are asked for your personal key, copy it to the form on the site. This\nis your personal key:  You will also be able to decrypt one file for free to make sure SAGE\nDecrypter software is able to recover your files If none of those links work for you for a prolonged period of time or you need\nyour files recovered as fast as possible, you can also access your personal\npage using Tor Browser. In order to do that you need to: 1. open Internet Explorer or any other internet browser; 2. copy the address https: www.torproject.org download downloadeasy.html.en into address bar and press Enter; 3. once the page opens, you will be offered to download Tor Browser, download it and run the installator, follow installation instructions; 4. once installation is finished, open the newly installed Tor Browser and press the Connect button button can be named differently if you installed nonEnglish version; 5. Tor Browser will establish connection and open a normal browser window; 6. copy the address http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n into this browser address bar and press Enter; 7. your personal page should be opened now; if it didn't then wait for a bit and try again. If you can not perform this steps then check your internet connection and try\nagain. If it still doesn't work, try asking some computer guy for help in\nperforming this steps for you or look for some video guides on YouTube. You can find a copy of this instruction in files named !HELPSOS stored next\nto your encrypted files. HERE2 Anleitung zur  Sie haben sicherlich gemerkt, dass Sie Ihre Daten nicht ffnen knnen und dass\nProgramme nicht mehr ordnungsgem funktionieren. Dies ist zu erwarten. Die Dateiinhalte existieren noch, aber wurden mit\nusenc verschlsselt. Ihre Daten sind nicht verloren. Es ist mglich, sie mit Hilfe von\nEntschlsselung in ihren Originalzustand zurckzuversetzen. Die einzige Mglichkeit das zu tun, ist die Verwendung von SAGE Decrypter\nSoftware und Ihr persnlicher Entschlsselungskey. Das Verwenden von anderer Software, die angeblich ihre Daten wiederherstellen\nkann, wird dazu fhren, dass Ihre Daten beschdigt oder zerstrt werden. Sie knnen die SAGE Decrypter Software und Ihren Entschlsselungskey auf\nIhrer persnlichen Seite erwerben, indem Sie diesen Links folgen: http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below. Falls Sie nach ihrem persnlichen Key gefragt werden, kopieren Sie ihn in das\nFormular auf dieser Seite. Dies ist Ihr persnlicher Key:  Sie knnen eine Datei gratis entschlssen, um sicher zu sein, dass die SAGE\nDecrypter Software ihre Daten wiederherstellen kann Falls keine dieser Links ber einen lngeren Zeitraum funktionieren sollten\noder Sie Ihre Daten so schnell wie mglich wiederherstellen mssen, knnen Sie\nIhre persnliche Seite mit Hilfe des Tor Browser aufrufen. Dazu bentigen Sie: 1. ffnen Sie den Internet Explorer oder einen anderen Internetbrowser; 2. Kopieren Sie diese Adresse https: www.torproject.org download downloadeasy.html.en in die Adressleiste und drcken Sie Enter; 3. So bald sich die Seite ffnet, wird Ihnen der Download des Tor Browser angeboten. Laden Sie ihn herunter und fhren Sie die Installation aus, indem Sie den  folgen; 4. Wenn die Installation abgeschlossen ist, ffnen Sie den soeben installierten Tor Browser und drcken Sie den Connect Knopf Der Namen kann abweichen, falls Sie eine nichtenglische Version installiert haben; 5. Tor Browser wird eine Verbindung herstellen und ein normales Browserfenster ffnen; 6. Kopieren Sie die Adresse http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n in die Browseradressleiste und drcken Sie Enter; 7. Ihre persnliche Seite sollte sich nun geffnet haben; falls nicht: Warten Sie eine Weile und versuchen Sie es erneut. Falls Sie nicht in der Lage sind, diese Schritte durchzufhren, berprfen Sie\nIhre Internetverbindung. Wenn es noch immer nicht funktioniert, fragen Sie\njemanden, der sich mit Computern auskennt, um diese Schritte durchzufhren\noder schauen Sie sich einige Videoanleitungen auf ayoutube an. Sie finden eine Kopie dieser Anleitung in einer Datei namens !HELPSOS neben\nIhren verschlsselten Daten. Istruzioni per il recupero dei file Probabilmente hai notato che non puoi pi aprire i tuoi file e alcuni software\nhanno smesso di funzionare correttamente. Questo era previsto. I tuoi file si trovano ancora al loro posto, ma sono\nstati crittografati da SAGE 2.2 Ransomware. I tuoi file non sono persi, possibile farli tornare al loro stato normale\neseguendo una decrittazione. L'unico modo in cui possibile farlo scaricare il software SAGE Decrypter\ne la tua chiave personale di decrittazione. Utilizzando un qualsiasi altro software che sostiene di essere in grado di\nripristinare i tuoi file, li dannegger o distrugger per sempre. possibile acquistare il software SAGE Decrypter e la tua chiave di\ndecrittazione nella tua pagina personale a cui puoi accedere dai seguenti\ncollegamenti: http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below. Se viene richiesta la chiave personale, possibile copiarla dal modulo del\nsito. Questa la chiave personale:  Sar anche possibile decriptare un file gratuitamente per assicurarsi che il\nsoftware SAGE Decrypter sia in grado di recuperare i file Se nessuno dei collegamenti funziona per un periodo di tempo prolungato o necessario ripristinare il prima possibile, possibile accedere alla propria\npagina personale anche utilizzando Tor Browser. Per poterlo fare necessario: 1. aprire Internet Explorer o qualsiasi altro browser internet; 2. copiare l'indirizzo https: www.torproject.org download downloadeasy.html.en nella barra degli indirizzi e premere Enter; 3. una volta aperta la pagina, verr offerta la possibilit di scaricare Tor Browser, scarica ed esegui il file seguendo le istruzioni di installazione; 4. una volta completata l'installazione, aprire il nuovo Tor Browser e premere il pulsante Connect il pulsante potrebbe avere un nome diverso se non si installata la versione inglese; 5. Tor Browser stabilir una connessione e aprir una normale finestra di navigazione; 6. copiare l'indirizzo http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n nella barra degli indirizzi del browser e premere Enter; 7. ora dovrebbe essere possibile aprire la pagina personale; se cos non fosse, attendere qualche istante e riprovare. Se non possibile eseguire questo passaggio, controllare la connessione\ninternet e riprovare. Se ancora non funziona, prova a chiedere se qualche\nesperto di computer pu farlo al posto tuo oppure dai un'occhiata a qualche\nvideo guida su YouTube. Puoi trovare una copia di queste istruzioni nel file di nome !HELPSOS\nconservato con i tuoi file criptati. Instrues sobre como recuperar os arquivos criptografado: Voc j deve ter percebido que todos os seus arquivos no esto mais acessvel\ne alguns dos seus programas no esto funcionando corretamente. J era de se esperar! Os seus arquivos ainda esto salvos em seu computador,\nporm no esto acessvel porque foram criptografados por SAGE 2.2\nRansomware. Os seus arquivos no foram deletados, possvel descriptograflos. A nica maneira de descriptograflos usando o programa, SAGE Decrypter e\na sua chave de descriptografia pessoal. Ao tentar utilizar decodificadores de terceiros para tentar restaurar os seus\narquivos, irar corromper todos os seus arquivos, podendo gerar danos\nirreversveis. Voc pode comprar o SAGE Decrypter e sua chave pessoal para decodificao\nnos seguintes links: http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below. Caso seja solicitado uma chave pessoal, copie e cole no formulrio no site.\nEssa a sua chave pessoal:  Voc pode descriptografar um arquivo gratuitamente para ter certeza de que o\nSAGE Decrypter, seja capaz de descriptografar todos os seus arquivos no seu\ncomputador. Se nenhum dos links estiver disponvel no momento ou se voc precisar com\nurgncia dos seus arquivos, voc tambm pode acessar a sua pgina pessoal\nusando o Tor Browser. Instrues sobre como utilizlo: 1. abra o Internet Explorer ou qualquer outro navegador; 2. copie o endereo do https: www.torproject.org download downloadeasy.html.en e cole na barra de endereo em seu navegador e pressione Enter; 3. quando a pgina for aberta em seguida, voc ver as informaes sobre o Navegador Tor e o link para download, abra o arquivo e siga as instrues de instalao; 4. Quando a instalao estiver concluda, abra o Navegador Tor e pressione o boto Connecto boto pode ter outro nome, se voc instalou uma verso do programa que no seja em ingls; 5. O Navegador Tor ir estabelecer uma conexo e, em seguida, abrir uma janela no navegador; 6. copie o endereo do http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n e cole na barra de endereo do Navegador Tor, em seguida, pressione Enter; 7. a sua pgina pessoal ir abrir em alguns instantes; caso a pgina no abra, aguarde um pouco e tente novamente. Se voc no conseguir executar todas as etapas, certifiquese de que voc est\nconectado internet e tente novamente. Se voc ainda tiver dificuldade para\nconectar, pea ajuda a um tcnico de informtica para auxililo no processo\nou procure vdeos que possam ajudlo no YouTube. Voc pode encontrar uma cpia do arquivo de instruo chamado !HELPSOS\nsalvo junto ao seus arquivos criptografados. Instrucciones para la recuperacin de archivos Probablemente hayas notado que no puedes abrir tus archivos y que algunas\naplicaciones dejaron de funcionar correctamente. Era de esperarse. El contenido de tus archivos an est all, pero fu\nencriptado por SAGE 2.2 Ransomware. Tus archivos no estn perdidos, es posible regresarlos a su estado normal\ndecodificndolos. La nica forma de hacerlo es con el software SAGE Decrypter y su clave\npersonal de descifrado. Usar cualquier otro software que asegure ser capaz de restaurar tus archivos\nresultar en un dao o destruccin de los archivos. Puedes comprar el software SAGE Decrypter y tu clave de descifrado en tu\npgina personal que puedes accesar a travs de los siguientes links: http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below. Si te es solicitada la clave personal, cpiala en el formulario del sitio.\nEsta es tu clave personal:  Tambin podrs descifrar un archivo gratis para asegurarte que el software\nSAGE Decrypter es capaz de recuperar tus archivos Si ninguno de esos links te funciona por un tiempo prolongado o si necesitas\nrecuperar tus archivos lo ms rpido posible, tambin puedes accesar a tu\npgina personal usando el Tor Browser. Con la finalidad de hacerlo necesitas: 1. abrir Internet Explorer o cualquier otro navegador de internet; 2. copia la direccin https: www.torproject.org download downloadeasy.html.en en la barra de direcciones y presiona Enter; 3. una vez que abra la pgina, le ser ofrecida la descarga de Tor Browser, descrgalo y ejecuta el instalador, siguiendo las instrucciones de instalacin; 4. una vez culminada la instalacin, abre el recien instalado Tor Browser y presione el botn Connect el botn puede tener un nombre diferente dependiendo de la versin instalada; 5. 6. copia la direccin http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n en la barra de direcciones del navegador y presiona Enter; 7. tu pgina personal debera abrir ahora; si no lo hace, espera un momento e intenta de nuevo. Si no puedes hacer el procedimiento, chequea tu conexin a internet e\nintntalo de nuevo. Si an no funciona, intenta pidindole ayuda a un tcnico\nde computacin para seguir las instrucciones o mira algunos videos de ayuda en\nYouTube. Puedes encontrar una copia de estas instrucciones en los archivos llamados\n!HELPSOS almacenados junto a tus archivos encriptados. Les instructions pour restaurer le fichier Vous avez srement remarqu que vous ne pouvez pas ouvrir vos fichiers et\nquun logiciel a arrt de fonctionner correctement. Cest attendu. Le contenu de vos fichiers est encore disponible, mais il a t\ncrypt par SAGE 2.2 Ransomware. Vos fichiers ne sont pas perdus, cest possible de les rcuprer et les avoir ltat normal en les dcryptant. La seule faon de le faire et en ayant le logicielSAGE Decrypter et votre\ncl de dcryptage. En utilisant un autre logiciel qui prtend pouvoir restaurer vos fichiers va\nendommager et dtruir vos fichiers. Vous pouvez acheter le logiciel SAGE Decrypter et votre cl de dcryptage\nsur votre profile auquel vous pouvez accder en cliquant sur ce lien: http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below. Si vous tes demand de fournir votre cl, copiez la dans le formulaire du\nsite. Voici votre cl personnelle:  Vous serez en mesure de dcrypter un fichier gratuitement pour tre sre que\nle logiciel SAGE Decrypter est capable de restaurer vos fichiers Si aucun des liens ne marche pour vous pour une priode prolonge ou si vous\navez besoin de restaurer vos fichiers rapidement, vous pouvez accder votre\nprofile en utilisant Navigateut Tor. Pour le faire vous devez: 1. Ouvrez Explorer ou nimporte quel autre navigateut; 2. Copiez cette addresse https: www.torproject.org download downloadeasy.html.en dans la barre dadresse et cliquez sur Enterer; 3. Une fois que la page est ouverte, on va vous proposer de tlcharger le navigateur Tor, Tlchargezle et lancez linstallation, suivez les instructions dinstallation ; 4. Une fois linstallation faite, ouvrez votre nouveau navigateur Tor et appuyez sur le bouton Connect Le bouton peut tre nomm diffremment si vous navez pas install la version en anglais; 5. Le navigateur Tor va tablir une connection et ouvrir une fentre ordinaire de navigateur ; 6. copiez ladresse http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n dans la barre dadresse et cliquez sur Entrer; 7. Votre profile doit tre ouvert maintenant; si a ne marche pas attendez puis essayez encore une fois. Si vous narrivez pas suivre ces tapes verifies alors votre connexion\ninternet et ressayez. Si a ne marche toujours pas, essayez de demander un\ninformaticien pour suivre ces tapes pour vous ou regardez des vidos\ndinstruction sur YouTube. Vous pouvez trouver une copie de ces instruction dans des fichiers nomms\n!HELPSOS enregistrs avec vos fichiers crypts. . . SAGE 2.2 Ransomware . . SAGE Decrypter . . SAGE Decrypter : http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below. :  SAGE Decrypter . Tor Browser . : 1. ; 2. https: www.torproject.org download downloadeasy.html.en Enter ; 3. Tor ; 4. Tor Connect .; 5. Tor . 6. http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n Enter ; 7. , . . YouTube . !HELPSOSb . Instructies voor herstellen van bestand Je hebt waarschijnlijk gemerkt dat je niet je bestanden kunt openen en dat\nsommige software niet meer werkt. Dit is verwacht. Je bestanden zijn er ngo steeds, maar zijn beveiligd door\nSAGE 2.2 Ransomware. Je bestanden zijn niet weg, het is mogelijk om ze te herstellen door de\nbeveiliging weg te halen. De enige manier daarvoor is om SAGE Decrypter software en je eigen\npersoonlijke beveiligingssleutel te halen. Gebruik van andere software die claimen je bestanden te herstellen zullen\nervoor zorgen dat je bestanden beschadigd of vernietigd worden. Je kan een SAGE Decrypter software en sleutel kopen via je persoonlijke\nlink: http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below. Als er wordt gevraagd voor je persoonlijke sleutel, kopieer het naar het\nformulier op de site. Dit is je persoonlijke sleutel:  Je kunt n bestand gratis herstellen om er zeker van te zijn dat SAGE\nDecrypter software je bestanden kunt herstellen Als geen van de links werken voor een lange tijd of je je bestanden zo snel\nmogelijk wilt herstellen, kan je ook toegang krijgen met de Tor Browser. Om dat te doen moet je: 1. Internet Explorer openen of een andere internet browser; 2. kopieer het adres https: www.torproject.org download downloadeasy.html.en in je adresbalk en druk op Enter; 3. wanneer de pagina opent, kan je de Tor Browser downloaden, download en installeer het, volg de installatie instructies; 4. wanneer download klaar is, open de Tor Browser en druk op Connect knop knop kan een andere naam hebben als je een andere taal hebt; 5. Tor Browser zal een connectie maken en een normale browser openen; 6. kopieer het adres http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n in deze browser adres en druk Enter; 7. je persoonlijke pagina zou nu open moeten zijn; als dit niet zo is wacht dan een moment en probeer het opnieuw. Als je deze stappen niet kan doen check dan je internet connectie en probeer\nhet opnieuw. Als het nog steeds niet lukt vraag een computerpersoon om deze\nstappen voor je te doen of kijk videos op YouTube. Je kunt een kopie van deze instructies vinden in een bestand met de naam\n!HELPSOS bij je beveiligde bestanden. . . SAGE 2.2 Ransomware. . SAGE Decrypter . . SAGE Decrypter : http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below. . .:  SAGE Decrypter Navigateut Tor. : 1. Explorer ; 2. https: www.torproject.org download downloadeasy.html.en Enterer; 3. Tor ; 4. Tor Connect ; 5. Tor ; 6. http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n Entrer; 7. . . YouTube. !HELPSOS . . . SAGE 2.2 Ransomware. . SAGE Decrypter . . SAGE Decrypter : http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below. . :  SAGE Decrypter . . Tor Browser. : 1. ; 2. https: www.torproject.org download downloadeasy.html.en Enter; 3. ; 4. Connect button can be named differently if you installed nonEnglish version; 5. ; 6. http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n Enter; 7. . . . YouTube. !HELPSOS . SAGE 2.2 Ransomware SAGE Decrypter SAGE Decrypter http: 7gie6ffnkrjykggd.3io74zx.com If none of these links work for you, click here to update the list. Updating links... Something went wrong while updating links, please wait some time and try\nagain or use Tor Browser method below. Links updated, if new ones still don't work, please wait some time and try\nagain or use Tor Browser method below.  SAGE Decrypter Tor 1. IE 2. https: www.torproject.org download downloadeasy.html.en 3. Tor 4. TorConnect 5. Tor 6. http: 7gie6ffnkrjykggd.onion login AYuuiybZc\n 7. YouTube !HELPSOS English Deutsch Italiano Portugus Espaol Franais Nederlands",
    "ransom_notes/Hermes_DECRYPT_INFORMATION.html": "HERMES RANSOMWARE All your important files are encrypted Your files has been encrypted using RSA2048 algorithm with unique publickey\nstored on your PC. There is only one way to get your files back: contact with us, pay, and\nget decryptor software. You have UNIQUEIDDONOTREMOVE file on your desktop also it duplicated in\nsome folders, its your unique idkey, attach it to letter when contact with us. Also you can\ndecrypt 3 files for test. We accept Bitcoin, you can find exchangers on https: www.bitcoin.com buy\nbitcoin and others. Contact information: primary email: @bitmessage.ch reserve email: x2486@india.com",
    "ransom_notes/Unknown Ransomware_915d4f3e4d82821884056fd8beec0aff_!INSTRUCTI0NS!.TXT": "All your files have been encrypted PLEASE READ THIS IF YOU WANT TO GET ALL YOUR FILES BACK ATTENTION Do not rename encrypted files. Do not try to decrypt your data using third party software, this can result in complete data loss. Send us email with your personal encryption KEY.\nThis email will be as confirmation your are ready to pay for decryption key. After payment, we send you the decryption tool, that decrypt all your files. Before paying you can send 2 file for free decryption. The total size of file must be less than 1Mb non archived, and files should not contain valuable information backups, databases, large excelword sheets, etc. CONTACT US: epta.mcold@gmail.com\nepta.mcold@yahoo.com ADDITIONAL CONTACTS: epta.mcold@aol.com KEY Y\nLF\nWYI\nIPLC\nD4VYD\nOE32C\n5TUML\n4CKV\n656\nTP\nE",
    "ransom_notes/ransomwhere_notes_1648837664854!0XXX_DECRYPTION_README.TXT": "All your files have been encrypted with 0XXX Virus.\nYour unique id: \nYou can buy decryption for 300USD in Bitcoins. To do this:\n1 Send your unique id  and max 3 files for test decryption to 08donjuan1970689@mail.ru\n2 After decryption, we will send you the decrypted files and a unique bitcoin wallet for payment.\n3 After payment ransom for Bitcoin, we will send you a decryption program and instructions. If we can decrypt your files, we have no reason to deceive you after payment. Also after payment we will give you some tips to protect yourself from this in the future. FAQ:\nCan I get a discount? No. The ransom amount is calculated based on the number of encrypted office files and discounts are not provided. All such messages will be automatically ignored.\nWhat is Bitcoin? read bitcoin.org\nWhere to buy bitcoins? https: bitcoin.org en buy https: buy.moonpay.io or use google.com\nWhere is the guarantee that I will receive my files back? The very fact that we can decrypt your random files is a guarantee. It makes no sense for us to deceive you. Moreover, it would hurt our business.\nHow quickly will I receive the key and decryption program after payment? As a rule, within a few minutes or hours, but very rarely there may be a delay of 12 days.\nHow does the decryption program work? It's simple. You need to copy the key and select a folder to decrypt. The program will automatically decrypt all encrypted files in this folder and its subfolders.",
    "ransom_notes/GlobeImposter_Unknown_how_to_back_files.html": "Your personal ID 58 90 1A 04 7D 33 96 F4 87 F3 03 E2 FF F5 CC C1 3E FF 25 68 DE 0F E7 07 67 51 1F 2F 8B 11 38 65 26 03 1D FC 47 28 EB 40 6B 8D 9E 7A 40 BE 1F 73 EB BB 17 9F 0E E5 6E 96 81 EA 7D FD 5D 68 0A 72 03 13 B0 47 9F B9 EE D3 AB D1 E4 52 4A E6 60 95 A6 38 61 BE C6 E1 4E BF 7C 40 CF A1 93 85 B4 DA 26 F0 9F C7 36 BB 9E 39 AC 78 E7 3F 6A 91 A3 76 B4 09 AB 3C 32 8A F7 62 A0 29 54 7D 53 5C 75 5D 01 3E C1 1D 08 C7 D4 47 4A A5 73 C4 62 6D 4E 6E 5B BD 3A 5D A1 A4 22 2B B0 19 FC D6 E4 28 30 EB 53 0E AD 07 7B CE 5C 71 09 29 6D BB 56 75 76 64 FC 5F 45 AF 55 39 74 41 E7 F9 B5 CD 4B 80 C2 71 F5 BF A7 21 B1 5B BA F7 07 E7 7A 82 1D 0B 7C 0C 1E 72 54 16 FD 9B FE E4 72 52 14 1A D8 65 AE 1E C3 E9 3B 61 EB D9 75 A6 6F F0 80 3F 0B 42 2D 9E 76 B5 1E D7 D4 F8 9A 47 00 0A 77 22 B8 86 B5 35 English Your files are encrypted! All your important data has been encrypted. To recover data you need decryptor. To get the decryptor you should: Send 1 test image or text file ihelperpc@outlook.com. In the letter include\nyour personal ID look at the beginning of this document. We will give you the decrypted file and assign the price for decryption all\nfiles After we send you instruction how to pay for decrypt and after payment you\nwill receive a decryptor and instructions We can decrypt one file in quality\nthe evidence that we have the decoder. Attention! Only ihelperpc@india.com reserv email can decrypt your files Do not trust anyone Window controlAbout Get support ihelperpc@outlook.com Do not attempt to remove the program or run the antivirus tools Attempts to selfdecrypting files will result in the loss of your data Decoders other users are not compatible with your data, because each user's unique encryption key",
    "ransom_notes/JAFF_2017-05-23_ReadMe.txt": "jaff decryptor system Files are encrypted!\nTo decrypt flies you need to obtain the private key.\nThe only copy of the private key, which will allow you to decrypt your files, is located on a secret server\nin the Internet You must install Tor Browser: https: www.torproject.org download downloadeasy.html.en After instalation,run the Tor Browser and enter address: http: rktazuzi7hbln7sy.onion Follow the instruction on the website. Your decrypt ID: xxxxxxxxxx",
    "ransom_notes/Locky_ykcol_ykcol-344c.htm": ". . !!! IMPORTANT INFORMATION !!!! All of your files are encrypted with RSA2048 and AES128 ciphers. More information about the RSA and AES can be found here: http: en.wikipedia.org wiki RSAcryptosystem http: en.wikipedia.org wiki  Decrypting of your files is only possible with the private key and decrypt\nprogram, which is on our secret server. To receive your private key follow one of the links: If all of this addresses are not available, follow these steps: 1 . Download and install Tor Browser:\nhttps: www.torproject.org download downloadeasy.html 2 . After a successful installation, run the browser and wait for\ninitialization. 3 . Type in the address bar: g46mbrrzpfszonuk.onion 4 . Follow the instructions on the site. !!! Your personal identification ID: !!! . ..",
    "ransom_notes/RaRansomware_RaRansomware - Recovery instructions.html": "All your files are belong to us! All your personal files, including, but not limited to: Photos, videos, databases and office projects have been encrypted using a\nmix of two very strong cryptographic algorithms AES128 and RSA1028.\nOriginal files have been overwritten, recovery tools and software will not\nhelp you. The only way to recover your files, are to meet our demands. Be warned, we won't be able to recover your files if you start fiddling with\nthem. You have 120 hours 5 days from this moment to send us payment, or you files\nwill be lost in eternity. To start the recovery process you need to download and install the Tor\nbrowser, which is easily done from their own homepage. Once you have the Tor browser running you need to navigate to\nhttp: recovery6m3lvkxg.onion and then input your personal id displayed\nbelow. Further payment instructions will be given once logged in. redacted 992 bytes in base64",
    "ransom_notes/TeslaCrypt_2016-02-26_Recovery.txt": "NOT YOUR LANGUAGE? USE https: translate.google.com What happened to your files ?\nAll of your files were protected by a strong encryption with AES More information about the encryption keys using AES can be found here: http: en.wikipedia.org wiki AES How did this happen ?\n!!! Specially for your PC was generated personal AES KEY, both public and private.\n!!! ALL YOUR FILES were encrypted with the public key, which has been transferred to your computer via the Internet.\n!!! Decrypting of your files is only possible with the help of the private key and decrypt program , which is on our Secret Server What do I do ?\nSo, there are two ways you can choose: wait for a miracle and get your price doubled, or start obtaining BITCOIN NOW! , and restore your data easy way.\nIf You have really valuable data, you better not waste your time, because there is no other way to get your files, except make a payment. For more specific instructions, please visit your personal home page, there are a few different addresses pointing to your page below:\n1. http: .zatcurr.com removed\n2. http: .keratadze.at removed\n3. http: .milerteddy.com removed\nIf for some reasons the addresses are not available, follow these steps:\n1. Download and install torbrowser: http: www.torproject.org projects torbrowser.html.en 2. After a successful installation, run the browser 3. Type in the address bar: xlowfznrg4wf7dli.onion removed 4. Follow the instructions on the site. IMPORTANT INFORMATION Your personal pages:\nhttp: .zatcurr.com removed\nhttp: .keratadze.at removed\nhttp: .milerteddy.com removed Your personal page TorBrowser: xlowfznrg4wf7dli.ONION removed",
    "ransom_notes/Sadcomputer_sadcomputer_note.txt": "Q: What Happend to my computer?\nA: Your Files Have Been Encrypted. Q: How Do i restore the files?\nA: You need to use bitcoin to restore the files. Q: Can i use other methods?\nA: Yes. You can use Paypal. Q: How can i trust?\nA: We dont cheat users. We restore the files.",
    "ransom_notes/ransomwhere_notes_1652881310416ransomware.txt": "Hello! Unfortunately, I have some unpleasant news for you.\nRoughly several months ago I have managed to get a complete access to all devices that you use to browse internet.\nAfterwards, I have proceeded with monitoring all internet activities of yours. You can check out the sequence of events summarize below: Previously I have bought from hackers a special access to various email accounts currently, it is rather a straightforward thing that can be done online.\nClearly, I could effortlessly log in to your email account as well pierre@pierrespchelp.ca. One week after that, I proceeded with installing a Trojan virus in Operating Systems of all your devices, which are used by you to login to your email.\nActually, that was rather a simple thing to do because you have opened a few links from your inbox emails previously.\nGenius is in simplicity. Thanks to that software I can get access to all controllers inside your devices such as your video camera, microphone, keyboard etc..\nI could easily download all your data, photos, web browsing history and other information to my servers.\nI can access all your social networks accounts, messengers, emails, including chat history as well as contacts list.\nThis virus of mine unceasingly keeps refreshing its signatures since it is controlled by a driver, and as result stays unnoticed by antivirus software. Hereby, I believe by this time it is already clear for you why I was never detected until I sent this letter... While compiling all the information related to you, I have also found out that you are a true fan and frequent visitor of adult websites.\nYou truly enjoy browsing through porn websites, while watching arousing videos and experiencing an unimaginable satisfaction.\nTo be honest, I could not resist but to record some of your kinky solo sessions and compiled them in several videos, which demonstrate you masturbating and cumming in the end. If you still don't trust me, all it takes me is several mouse clicks to distribute all those videos with your colleagues, friends and even relatives.\nIn addition, I can upload them online for entire public to access.\nI truly believe, you absolutely don't want such things to occur, bearing in mind the kinky stuff exposed in those videos that you usually watch, you definitely understand what I am trying to say it will result in a complete disaster for you. We can still resolve it in the following manner:\nYou perform a transfer of 1590 USD to me a bitcoin equivalent based on the exchange rate during the funds transfer, so after I receive the transfer, I will straight away remove all those lecherous videos without hesitation.\nThen we can pretend like it has never happened before. In addition, I assure that all the harmful software will be deactivated and removed from all devices of yours. Don't worry, I am a man of my word. It is really a good deal with a considerably low the price, bearing in mind that I was monitoring your profile as well as traffic over an extended period.\nIf you still unaware about the purchase and transfer process of bitcoins all you can do is find the necessary information online. My bitcoin wallet is as follows:  You are left with 48 hours and the countdown starts right after you open this email 2 days to be specific. Don't forget to keep in mind and abstain from doing the following: Do not attempt to reply my email this email was generated in your inbox together with the return address. Do not attempt to call police as well as other security services. Moreover, don't even think of sharing it with your friends. If I get to know about it based on my skills, that would be very easy, since that I have all your systems under my control and constant monitoring your dirty video will become public without delay. Don't attempt searching for me it is completely useless. Cryptocurrency transactions always remain anonymous. Don't attempt reinstalling the OS of your devices or even getting rid of them. It is meaningless too, because all your private videos are already been available on remote servers. Things you should be concerned about: That I will not receive the funds transfer you make.\nRelax, I will be able to track it immediately, after you complete the funds transfer, because I unceasingly monitor all activities that you do trojan virus of mine can control remotely all processes, same as TeamViewer. That I will still distribute your videos after you have sent the money to me. Believe me, it is pointless for me to proceed with troubling you after that. Besides that, if that really was my intention, it would happen long time ago! It all will be settled on fair conditions and terms! One last advice from me... Moving forward make sure you don't get involved in such type of incidents again!\nMy suggestion make sure you change all your passwords as often as possible.",
    "ransom_notes/Alpha_Read Me (How Decrypt) !!!!.txt": "Greetings,\nWe'd like to apologize for the inconveniences, however, your computer has been locked. In order to unlock it, you have to complete the following steps: 1. Buy iTunes Gift Cards for a total amount of 400.00\n2. Send the gift codes to the indicated email address 3. Receive a code and a file that will unlock your computer. Please note: The nominal amount of the particular gift card doesn't matter, yet the total amount have to be as listed above. You can buy the iTunes Gift Cards online or in any shop. The codes must be correct, otherwise, you won't receive anything. After receiving the code and the security file, your computer will be unlocked and will never be locked again. Sorry for the inconveniences caused.",
    "ransom_notes/BTCWare_Wyvern_!FILES ENCRYPTED.txt": "your data have been encrypted if you want restore files write me decryptorx@cock.li",
    "ransom_notes/Dharma_abibo_Info.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email abibo@protonmail.com Write this ID in the title of your message 60D8C0E3 In case of no answer in 24 hours write us to theese\nemails:abibo@protonmail.com You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 file for free decryption. The total size\nof files must be less than 1Mb non archived, and files should not contain\nvaluable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Mole__HELP_INSTRUCTION.txt": "!! INFORMATIONS!! All your files are encrypted with RSA2048 and AES128 ciphers. More information about the RSA and AES can be found here: URL1: http: en.wikipedia.org wiki RSAnumbers URL2: http: en.wikipedia.org wiki  Decrypting your files is only possible with he private key and decrypts programs, which is on our secret server. Follow these steps: 1. Download and install TorBrowsers: http: torproject.org download downloadeasy.html 2. After a successful installation, run the browser and wait for initialization. 3. Type in the address bar: URL1: http: supportxxgbefd7c.onion URL2: http: supportjy2xvvdmx.onion 4.Follow the instructions on the site. !! Your DECRYPTID:",
    "ransom_notes/Jsworm_JSWORM-DECRYPT.txt": "All your files were encrypted! Your personal ID: Contacts: remarkpaul77@cock.li alfred.helper@keemail.com in case of no answer What should I include in my message? 1. Country 2. List of encrypted drives and their size 3. Extension of encrypted files .IDremarkpaul77@cock.li.JSWORM 4. JSWORM PUBLIC KEY below Free decryption as guarantee! Before paying you send us up to 3 files for free decryption. We recommeded to send pictures, text files, sheets, etc. files no more than 1mb ATTENTION! 1. Do not rename encrypted files. 2. Do not try to decrypt your data using third party software, it may cause permanent data loss. 3. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam. BEGIN JSWORM PUBLIC KEY  END JSWORM PUBLIC KEY",
    "ransom_notes/ransomwhere_notes_1626459900268giacomelli.txt": "To recover your lost files and avoid leaking it send .825 Bitcoin BTC to\n Buckets that we have: giacomellibackup, ,\ngiacomelliintranet, ,\n, s3.giacomellivendas.com.br. Your files are downloaded and backed up on our servers. If we dont receive your\npayment in the next 9 Days, we will sell your files to the highest bidder or use\nthem otherwise.",
    "ransom_notes/Everbe_!=How_recovery_files=!.html": "Language: EN DE FR IT ES primary email:nbspyoursalvations;@protonmail.ch reserve email: neverdies@tutanota.com",
    "ransom_notes/Dharma_bip_FILES ENCRYPTED.txt": "all your data has been locked us You want to return? write emailpeekabooo@qq.com",
    "ransom_notes/Mr.Dec_Decoding help.hta": "You are unlucky! The terrible virus has captured your files! For decoding\nplease contact by email Frankenstein123@tutanota.com or\nFrankenstein123@protonmail.com Your  1 . In the subject line, write your ID.2 . Attach 12 infected files that do\nnot contain important information less than 2 mbare required to generate the\ndecoder and restore the test file.Hurry up! Time is limited!Attention!!!At the\nend of this time, the private key for generating the decoder will be\ndestroyed. Files will not be restored!",
    "ransom_notes/Omerta_READ THIS IF YOU WANT TO GET ALL YOUR FILES BACK.txt": "IF YOU WANT TO GET ALL YOUR FILES BACK, PLEASE READ THIS Your files are now encrypted! BEGIN PERSONAL IDENTIFIER\n,,;l,fJKShDnaajs!HNuQfsHi.G,RUqT;GqrsNgqqha.gkq\nR;iFpoqaREOTR;hDcsJp.qhouTBl@uNjbo.!Gq,;R.FpISD.\ngMqTTpAFeoGeMDl@Mbofu,.HIsTGIcTNNgIGoGKq!NRfJfN\n!qrtgudDlCSupCJB;f;,@nRGfq@APCSaEl\noSgOrEdELarpI!UUutoG;NLicAQ\nEND PERSONAL IDENTIFIER All your files have been encrypted due to a security problem with your PC. Now you should send us email with your personal identifier.\nThis email will be as confirmation you are ready to pay for decryption key.\nYou have to pay for decryption in Bitcoins. The price depends on how fast you write to us.\nAfter payment we will send you the decryption tool that will decrypt all your files. Contact us using this email address: grusha2281@protonmail.com Free decryption as guarantee!\nBefore paying you can send us up to 3 files for free decryption.\nThe total size of files must be less than 10Mb non archived, and files should not contain\nvaluable information databases, backups, large excel sheets, etc.. Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Qwerty_README_DECRYPT.txt": "Your computer is encrypted . Mail cryz1@protonmail.com . Send your ID 5612.\nNote! You have only 72 hours for write on email see below or all your files will be lost!",
    "ransom_notes/CrypMIC_README.html": "ATTENTION!YOUR FILES ARE ENCRYPTED. Write down the information to notebook excercise book! and reboot the\ncomputer. 1 What happened to your files? All of your files were protected by a strong encryption with RSA4096 More information about the encryption RSA4096 can be found here:\nhttp: en.wikiDedia.orQ wiki RSA cryptosystem 2 How did this happen? Specially for your PC was generated personal RSA4096 key, both public and\nprivate. ALL YOUR FILES were encrypted with the public key, which has been transferred\nto your computer via the Internet. Decrypting of your files is only possible\nwith the help of the private key and decrypt program, which is on our secret\nserver 3 What do I do? So , there are two ways you can choose: wait for a miracle and get your\nPRICE DOUBLED! Or start obtaining BITCOIN NOW! , and restore YOUR DATA\neasy way If You have really valuable DATA, you better NOT WASTE YOUR\nTIME, because there is NO other way to get your files, except make a\nPAYMENT Your personal ID removed For more specific instructions,please visit your personal home page, there are\na few different addresses pointing to your page below: 1. http: ccjlwb22w6c22p2k.onion.to 2. http: ccjlwb22w6c22p2k.onion.city If for some reasons the addresses are not available, follow these steps: 1. Download and install torbrowser: https: torproject.org projects torbrowser.html 2. After a successful installation, run the browser 3. Type in the address bar: http: ccjlwb22w6c22p2k.onion 4. Follow the instructions on the site. Write down the information to notebook excercise book! and reboot the\ncomputer.",
    "ransom_notes/ransomwhere_notes_1646142571300README_FOR_RESTORE": "Attention!\nYour files have been encrypted.\nWe highly suggest not shutting down your computer in case encryption process is not finished, as your files may get corrupted.\nIn order to decrypt your files, you must pay for the decryption key application.\nYou may do so by visiting us at http: .onion.\nThis is an onion address that you may access using Tor Browser which you may download at https: www.torproject.org download Details such as pricing, how long before the price increases and such will be available to you once you enter your ID presented to you below in this note in our website.\nContact us soon, because those who don't have their data leaked in our press release blog and the price they'll have to pay will go up significantly.\nThe corporations whom don't pay or fail to respond in a swift manner can be found in our blog, accessible at http: .onion Your ID:",
    "ransom_notes/ransomwhere_notes_16270236410892849045.txt": "HELLO! YOUR REMOTE STORAGE WAS COMPROMISED. ALL YOUR FILES AND FOLDERS HAVE BEEN ENRCYPTED AND HIDDEN. IF YOU WANT TO RECOVER YOUR FILES YOU MUST SEND 0.02 BITCOIN TO THIS BITCOIN WALLET:  YOU HAVE UNTIL THE 16th of JULY 2021 TO MAKE THE PAYMENT.\nAFTER THAT YOUR DATA RECOVERY WILL BE ALMOST IMPOSSIBLE. YOUR UNIQUE ID IS: 231.216.17.13 PLEASE EMAIL US YOUR ID AND PAYMENT CONFIRMATION TO: securit@zohomail.eu AFTER THE PAYMENT CONFIRMATION YOU WILL RECEIVE INSTRUCTIONS ON HOW TO RECOVER ALL YOUR FILES BACK. ATTENTION !!! DO NOT DELETE ANY FILES ON YOUR DRIVE. DO NOT TRY TO RECOVER YOUR DATA USING ANY SOFTWARE. IT WILL RESULT IN PERMANENT DATA LOSS. DO NOT FORMAT, ADD OR DELETE VOLUMES OR WRITE DATA TO THE DISK. IT MAY RESULT IN PERMANENET DATA LOSS. This is NOT a BOT THANK YOU FOR YOUR COOPERATION. Data Security.",
    "ransom_notes/JAFF_2017-05-23_ReadMe.html": "jaff decryptor system Files are encrypted! To decrypt flies you need to obtain the private key. The only copy of the private key, which will allow you to decrypt your files,\nis located on a secret server in the Internet You must install Tor Browser: https: www.torproject.org download download\neasy.html.en After instalation, run the Tor Browser and enter address:\nhttp: rktazuzi7hbln7sy.onion Follow the instruction on the website. Your decrypt ID: xxxxxxxxxx",
    "ransom_notes/Dharma_skynet_Info.hta": "All your files have been encrypted! All your files have been encrypted due to a security problem with your PC. If\nyou want to restore them, write us to the email skynet45@cock.li Write this ID in the title of your message 60D8C0E3 In case of no answer in 24 hours write us to theese\nemails:skynet45@tutanota.com You have to pay for decryption in Bitcoins. The price depends on how fast you\nwrite to us. After payment we will send you the decryption tool that will\ndecrypt all your files. Free decryption as guarantee Before paying you can send us up to 1 file for free decryption. The total size\nof files must be less than 1Mb non archived, and files should not contain\nvaluable information. databases,backups, large excel sheets, etc. How to obtain Bitcoins The easiest way to buy bitcoins is LocalBitcoins site. You have to register,\nclick 'Buy bitcoins', and select the seller by payment method and price. https: localbitcoins.com buybitcoins Also you can find other places to buy Bitcoins and beginners guide here: http: www.coindesk.com information howcanibuybitcoins Attention! Do not rename encrypted files. Do not try to decrypt your data using third party software, it may cause permanent data loss. Decryption of your files with the help of third parties may cause increased price they add their fee to our or you can become a victim of a scam.",
    "ransom_notes/Alpha Crypt_2015-04-30_HELP_TO_SAVE_FILES.txt": "All your documents, photos, databases and other important files have been encrypted with strongest encryption RSA2048 key, generated for this computer. Private decryption key is stored on a secret Internet server and nobody can decrypt your files until you pay and obtain the private key. If you see the main encryptor red window, examine it and follow the instructions. Otherwise, it seems that you or your antivirus deleted the encryptor program. Now you have the last chance to decrypt your files. Open http: qcuikaiye577q3p2.jjeyd2u37an30.com or http: qcuikaiye577q3p2.s24f53mnd7w31.com , https: qcuikaiye577q3p2.s5.torgateways.de in your browser. They are public gates to the secret server. Copy and paste the following Bitcoin address in the input form on server. Avoid missprints. 1H66iejHkDY9SZJRrFrnhLjHff6MRMhKu6 Follow the instructions on the server. If you have problems with gates, use direct connection: 1. Download Tor Browser from http: torproject.org 2. In the Tor Browser open the http: qcuikaiye577q3p2.onion Note that this server is available via Tor Browser only. Retry in 1 hour if site is not reachable. Copy and paste the following Bitcoin address in the input form on server. Avoid missprints. 1H66iejHkDY9SZJRrFrnhLjHff6MRMhKu6 Follow the instructions on the server.",
    "ransom_notes/Dharma_4k_RETURN FILES.txt": "All your data is encrypted! for return write to mail: rocosmon@cock.li",
    "ransom_notes/JAFF_2017-05-24_README TO SAVE YOUR FILES.txt": "Files are encrypted!\nTo decrypt flies you need to obtain the private\nkey. The only copy of the private key, which will allow you to decrypt your\nfiles, is located on a secret server\nin the Internet. 1.\nYou must install Tor Browser:\nhttps: www.torproject.org download downloadeasy.html.en 2.\nAfter instalation, run the Tor Browser and enter address:\nhttp: rktazuzi7hbln7sy.onion Follow the instruction on the website. Your decrypt ID: 0123456789",
    "ransom_notes/Locky_bart_recover.txt": "!!! IMPORTANT INFORMATION !!! All your files are encrypted. Decrypting of your files is only possible with the private key, which is on our secret server. To receive your private key follow one of the links: 1. http: s3clm4lufbmfhmeb.tor2web.org ?idremoved3d3d 2. http: s3clm4lufbmfhmeb.onion.to ?idremoved3d3d 3. http: s3clm4lufbmfhmeb.onion.cab ?idremoved3d3d 4. http: s3clm4lufbmfhmeb.onion.link ?idremoved3d3d If all addresses are not available, follow these steps: 1. Download and install Tor Browser: https: torproject.org download downloadeasy.html 2. After successfull installation, run the browser and wait for initialization. 3. Type in the address bar: s3clm4lufbmfhmeb.onion  4. Follow the instructions on the site. !!! Your personal identification ID: removed !!!",
    "ransom_notes/LockeR_[HOW_TO_DECRYPT_FILES].html": "What happened to my files ? All of your important files were encrypted using a combination of RSA2048 and\nAES256. What does this mean ? This means that your files were modified in a way that makes working with them\nimpossible, unless you have the keys to decrypt them. Is it possible to recover my files ? Yes, it possible to get your files back, you'll need a special program\ndecryptor and the private key of the key pair used to encrypt them. How can I get the decryptor and the private key ? You can buy both of them in any of the links below. Just visit one of them and\nfollow the instructions. 1. http: lockerrwhuaf2jjx.onion.link  2. https: lockerrwhuaf2jjx.onion.gq  3. https: lockerrwhuaf2jjx.onion.to  4. https: lockerrwhuaf2jjx.onion.top  If you cannot access the site from any of the addresses above, you can follow\nthe instructions below to access the site using the Tor Browser. 1. Download the Tor Browser Bundle here: https: www.torproject.org. 2. Execute the file you downloaded to extract the Tor Browser into a folder on your computer. 3. Then simply open the folder and click on Start Tor Browser. 4. Copy and paste the onion address into the address bar: http: lockerrwhuaf2jjx.onion"
}